{
  "progress_md": "Ideas: boundary-probe separation for vertex types; succinct 3-coloring bridge\n- Pivot retained: Reduce Succinct 3-Coloring (NEXP-complete) to Feasible-Function Existence (F1) for β-normalized, r=1 LCLs on oriented paths. Colors at the S-window implement the vertex coloring; the bridge between two contexts simulates D(u,v) and enforces “≠” iff D(u,v)=1.\n- New ingredient (type separation without per-type tailoring): Design a fixed family of boundary-output “probe patterns” Q_j (one per bit index j∈[B]) that, when set on the four boundary nodes of a context, uniformly trigger a radius-1 pointer that reads the j-th bit of an interior u-block positioned O(1) from S. The existence (extendibility) of a completion under probe Q_j equals that bit. Therefore the vector (ext_Q_j)_{j=1..B} encodes u, and different u yield different types. This avoids the flawed idea of “programming arbitrary boundary truth tables per type”.\n\nClean statements (to be proven/verified)\n- Lemma A (Probe-bits). There exist global Cin–out, Cout–out and, for the left-side vertex-context shape W(u) (|W(u)|∈{ℓ_pump,ℓ_pump+1}), a fixed family of boundary-output 4-tuples {Q_j: j∈[B]} such that, for any boundary input assignment a, Gw:=W(u) has a legal completion with boundary outputs Q_j on its four boundary nodes iff the j-th bit of u equals 1. Consequently, Type(W(u))≠Type(W(u′)) for u≠u′.\n  Why useful: Gives 2^B distinct vertex context types using only B=poly(s) probes, well within the β^4 boundary assignments. The construction is uniform and radius-1 (probes trigger a constant-symbol “probe role” that spawns a pointer reading the port region where u’s bits are pre-exposed near S; failures dead-end).\n- Lemma B (Canonical vertex-context family). There exist two canonical context shapes L(u):=W_L(u) S F_R and R(v):=F_L S W_R(v) with |W_L(u)|,|W_R(v)|∈{ℓ_pump,ℓ_pump+1} and fixed fillers F_L,F_R (no vertex data) such that:\n  (i) L(u) and R(v) are active (contain well-formed u- or v-blocks anchored O(1) from S),\n  (ii) Type(L(u)) (resp. Type(R(v))) is determined by u (resp. v) via Lemma A, and\n  (iii) any other context type without such a block is inactive: any non-⊥ color at S leads to a locally-detectable dead end; ⊥ always extends via neutral plumbing.\n  Why useful: Ensures exactly one (or at least a unique canonical) type per vertex; non-vertex types force f(·)=⊥ by (F1) universal quantification.\n- Lemma C (Bridge semantics for 3-coloring). There is a fixed, radius-1 seam gadget (placed across the concatenation of L(u) and R(v) in an (F1) instance) that locally simulates a universal TM U for poly(s) steps to evaluate D(u,v) using:\n  (i) a copy of D stored in each block (copied from Σ_in via Cin–out), and\n  (ii) the B-bit ports of u (on the right edge of L(u)) and v (on the left edge of R(v)).\n  The bridge admits a completion iff [D(u,v)=0] or [D(u,v)=1 and the two S colors differ]. Malformed simulations are locally refutable (standard error-chain); spurious accept is impossible due to row-to-row radius-1 checks.\n  Why useful: Matches (F1)’s universal pair check with “≠ on edges, trivial on non-edges”.\n\nSketch of constructions (radius-1 and uniform)\n- Vertex block (near S): A constant-role phase track places a “port zone” of length Θ(B) immediately adjacent to S inside W_L(u) (to the right) and W_R(v) (to the left). This port zone carries the B bits (u_1,…,u_B) (resp. v) twice with parity/check bits; its layout is enforced by Cout–out (deterministic pattern given activation at S). The rest of the block includes a self-delimiting header and a RUN zone encoding U’s tableau on input D (copied from the input track) and the index, all standard and locally checkable.\n- Probe patterns Q_j: Four special outputs on the boundary (two per side of the word) encode a “probe-bit j” token with local phase. Cout–out has rules: if a probe token sits on the boundary, the unique legal continuation from that boundary is a finite-state pointer that advances into the port zone, lands on the j-th cell, and requires its bit=1; otherwise no outgoing legal edge exists in the layered DP. This uses O(1) symbols and maintains radius-1 (pointer heads advance cell-by-cell with locally checkable direction and countdown in unary up to j encoded by constant number of “repeat until phase X” steps; the step count is derived by walking, not stored in boundary symbols). Result: extendibility under Q_j discriminates u_j.\n- Bridge simulation: In wa S1 wb wc S2 wd with wa S1 wb=L(u), wc S2 wd=R(v), the seam region wb wc contains a fixed-width (poly(s)+O(B)) “bridge RUN” where U takes as inputs (D, u, v) read from the adjacent port zones and computes d:=D(u,v). Cout–out enforces single-step tableau constraints, with local error-escape allowed only for malformed inputs; a dedicated final row propagates d to a 1-bit flag near S2. Separate local rules check “if d=1 then colors at S1,S2 must be unequal; if d=0 then no constraint on colors”.\n\nCorrectness of the reduction (succinct 3-coloring ⇒ (F1) and vice versa)\n- Completeness: If G is 3-colorable, fix χ: {0,1}^B→{RED,GRN,BLU}. Define f on vertex types by f(Type(L(u))) = χ(u) and f(Type(R(v))) = χ(v); define f(τ)=⊥ for all inactive (non-vertex) types. For any ordered pair of contexts in the (F1) check, either both are vertex-types (u,v): the bridge computes D(u,v) and enforces χ(u)≠χ(v) when D=1 (holds by proper coloring), or at least one is inactive, in which case ⊥ plumbing makes the DP succeed. Hence (F1) holds.\n- Soundness: If some f satisfies (F1), read χ(u) := f(Type(L(u))). For any u,v with D(u,v)=1, the bridge between Type(L(u)) and Type(R(v)) must be extendible; the simulation forces χ(u)≠χ(v). Thus χ is a proper 3-coloring. Non-vertex types cannot be mapped to a color, else some pair (inactive, anything) would violate (F1) due to the local “colors-only-when-vertex” gating; therefore setting them to ⊥ is necessary and consistent.\n\nNeutralizing (F2) and hardness for the tri-class classifier\n- As in previous rounds, add a global ⊥-filler language permitted on repeated sides w_i^z independent of context; then (F2) is true for every f by Lemma 1 in output.md. Therefore the classifier answers O(1) iff (F1) holds, and Ω(n) otherwise (Theorem 8 machinery). Since feasible-function existence (mid-consistency) is NEXPTIME-hard by the reduction above and in NEXPTIME (output LCL_classification.pdf), the three-way classification is NEXPTIME-hard.\n\nExamples and sanity checks\n- Tiny case B=2: u∈{00,01,10,11}. Define Q_1,Q_2 probes. For the four left-contexts L(u), the 2-bit vector (ext_Q1, ext_Q2) equals u. The bridge runs D on pairs and requires color-inequality only on edges.\n- DP perspective: The probe under Q_j forces a unique finite path in the layered automaton that reaches the j-th port cell; existence of an outgoing edge at that cell hinges on the bit=1. The bridge tableau likewise becomes a layered composition check; any inconsistency blocks all paths, so the DP precisely mirrors the existence of a legal completion.\n\nObstacles / things to make explicit next\n- Probe pointer encoding: Make the boundary probe tokens and the in-block “port zone” phases explicit, with a table showing (current symbol, next symbol) pairs permitted by Cout–out. Verify that the pointer is guaranteed to stop on the exact j-th cell (walk semantics) without storing j in the boundary symbol (to keep alphabet constant).\n- Seam I/O interface: Specify how the bridge RUN reads u and v: either by duplicating the B-bit ports directly adjacent to the bridge (preferred), or via pointers with locally checkable handshakes. The former is cleaner and fits ℓ_pump.\n- Error-chain integration: Ensure malformed blocks are always completable via the error alphabet (like §3), and that the color-at-S activation is allowed only when the vertex role is present, preventing spurious constraints on inactive types.\n- Size bookkeeping: Enumerate the tracks and show |Σ_out| = β = poly(s) suffices: roles/phases O(1), colors+⊥ (4), error alphabet O(1), U’s work tape O(1), plus finitely many probe/pointer states O(1). The “O(B)-long” ports are spatial, not alphabetic.\n\nGaps/notes on output.md\n- The core lemmas (type bound, composition, periodicity, finite-Z, DP) are sound and sufficient for our verifier. Minor clarification: in Theorem 5 the DP assumes fixed input string; the construction adapts by restricting layer i to Cin–out[Input(i)]. No action needed.\n- The bound Z≤ℓ^2 (Cor. 4) is non-tight but usable; we will carry it as-is for (F2) neutralization.\n\nNext steps (auditable deliverables)\n1) Formalize Lemma A with a concrete probe alphabet and Cout–out snippet; prove the “iff u_j=1” claim rigorously.\n2) Specify the canonical L(u), R(v) layouts with exact offsets: positions of the port zones, header footprint, and RUN rows. Provide a bound O(poly(s)) for occupied length.\n3) Write the seam tableau interface and prove Lemma C: that the only accepting completions correspond to the correct d = D(u,v) and enforce inequality when d=1.\n4) Package the reduction C↦P_D, including ⊥-filler for (F2), and finalize the completeness/soundness argument with explicit references to the output lemmas (replacement, pumping) to guarantee existence of required contexts within lengths ℓ_pump or ℓ_pump+1.\n"
}