{
  "feedback_md": "High-level assessment: All four reports move in a coherent direction (reduce Succinct 3-Coloring to (F1) by separating vertex types and simulating D(u,v) across the seam; neutralize (F2) with a ⊥-filler). The overall plan is promising and consistent with our DP/type framework. However, only informal sketches are given; several key points require correction or formalization before anything can move to output.md.\n\nMajor issues and corrections:\n- Prover 01’s Lemma 1 (single fixed probe b⋆) is not viable as stated. With global rules fixed, a single boundary-output 4-tuple cannot distinguish 2^B many indices; the check “agree with a constant j-th bit of the target u” cannot depend on u unless u comes from the interior. If the probe only checks RID equals the adjacent input RID, then the test always accepts and cannot separate types. We need a family of probes indexed by boundary outputs (as in Provers 02/03/04) so acceptance depends on u.\n- Consistency of f on the same u across multiple types: The proposed soundness arguments sometimes rely on the pair (τ_u, τ_u) enforcing equal colors. That is not guaranteed if D(u,u)=0 (typically true), because the seam accepts irrespective of colors for non-edges. Therefore we must either (i) engineer that there is exactly one “active” left-type and one “active” right-type per u (all other contexts are inactive and cannot carry colors), or (ii) enforce a same-u consistency constraint separately. The clean approach is (i): design canonical vertex-context shapes L(u), R(v) that are the only contexts allowed to place color tokens at S; all other contexts are inactive and any non-⊥ at S dead-ends locally.\n- Error-chain robustness: In all probe and seam gadgets, ensure the “error alphabet” does not provide an alternative accepting continuation under a reserved probe. Under a reserved probe boundary pattern, the only legal continuation must be the deterministic pointer/run; if a check fails, there must be no error-escape. Conversely, in non-probe modes and for malformed interiors, an error-chain must exist to avoid constraining f.\n- Radius-1 feasibility and alphabet sizing: Pointer/counting mechanisms that must reach the j-th port cell need either O(B) pointer states or an address field in the port zone. Both are acceptable because β is polynomial in s and can be chosen with c1 ≥ c0 so β ≥ B. Avoid claims that a constant-state pointer can hit arbitrary j without an address field.\n- Definition of types vs fixed inputs: Be explicit that E_w(a) is computed with the interior input string fixed to that of w. Several sketches implicitly use this; we should state it clearly in output.md (a minor clarification only).\n\nPromising directions to consolidate:\n- Type separation: Prefer either (A) the per-bit probe family Q_j (Prover 04) with an O(B)-symbol address field in the port zone so that extendibility under Q_j equals u_j, or (B) the mask/parity probe family (Prover 03) with M ≥ B tests and an injective signature Sig(u) = (⟨M_t,u⟩) that is enforced by a deterministic pointer+RUN gadget. Both are radius-1 and use β = poly(s). Prover 02’s base-β^4 encoding of a probe index b is also fine but heavier than needed; using M = Θ(B) probes suffices to separate 2^B vertices.\n- Canonical vertex contexts: Fix L(u) and R(v) shapes that alone unlock the “color-at-S” role; all other contexts must forbid color tokens at S (inactive). This avoids the need to prove equality of f on multiple types representing the same u.\n- Seam gadget: The row-by-row 1D tableau simulation across the bridge that reads u, v from adjacent port zones and evaluates D(u,v) in poly(s) time is standard (nearest-neighbor checks); gate acceptance by (EDGE=0) or (EDGE=1 and colors differ). This is the right alignment with (F1).\n- Neutralize (F2): The global ⊥-plumbing on repetitions is compatible with keeping (F1) unchanged. Just ensure it never alters S’s positions or the “vertex role” gating.\n\nConcrete next steps (what to write down explicitly so we can verify by the O(kβ^2) DP):\n1) Pick and fully specify one type-separation gadget. If choosing per-bit probes Q_j:\n   - Define the port zone layout: B addressed cells adjacent to S with an address track Addr∈{1,…,B} and a data track RID∈{0,1}.\n   - Define the boundary-reserved outputs Q_j and show the only legal continuation is a deterministic pointer that moves to the unique cell with Addr=j and accepts iff RID=1.\n   - Prove the Type-Separation Lemma: for a fixed boundary-input a⋆, E_{L(u)}(a⋆)[Q_j]=u_j; hence Type(L(u)) ≠ Type(L(u′)) for u≠u′.\n2) Define canonical L(u), R(v) shapes precisely: lengths, offsets of headers, port zones, and RUN zones. Add local rules that permit color tokens at S only when the adjacent block is a well-formed vertex block.\n3) Specify the seam tableau alphabet and local constraints: how the bridge reads the two B-bit ports, how the final EDGE bit is emitted, and the local check that enforces “if EDGE=1 then colors differ, else accept.” Include the refutation for malformed rows.\n4) Integrate ⊥-plumbing for (F2) and explicitly state that it never touches S or overrides the vertex-role gating.\n5) Provide a small B=2 instance and brute-force the DP to validate the separation and seam behavior.\n\nIf the above is written concretely, we can start moving the Type-Separation Lemma and the Seam Gadget Lemma (with full local rule tables) into output.md. Until then, no new theorems are publication-ready.\n",
  "new_notes_md": "Refined hardness plan via Succinct 3-Coloring: type separation and seam simulation (radius 1)\n\nParameters and normalization\n- Given a succinct graph instance D of size s over V={0,1}^B with B=s^{c0}, choose β=s^{c1} with c1≥c0 so β≥B and the output alphabet Σ_out has size β. The LCL instance P_D has radius 1 and is β-normalized (Cin–out global, Cout–out nearest-neighbor global). The DP and type framework from output.md applies with |T|≤|Σ_in|^4·2^{β^4}.\n\nCanonical vertex contexts and activity gating\n- We will construct canonical context shapes L(u)=W_L(u) S F_R and R(v)=F_L S W_R(v) for each u,v∈{0,1}^B such that:\n  1) W_L(u) (resp. W_R(v)) is a well-formed vertex block anchored O(1) from S; it exposes a port zone of length Θ(B) immediately adjacent to S holding the index bits.\n  2) Only these canonical contexts permit color tokens at S (role gating). Any context that is not a canonical vertex context is inactive: any non-⊥ token at S dead-ends locally; ⊥ at S always extends via neutral plumbing.\n  3) For each u (resp. v) the type Type(L(u)) (resp. Type(R(v))) depends only on u (resp. v) via a boundary-probe mechanism detailed below. Thus we obtain at least 2^B distinct left-types and 2^B distinct right-types.\n\nType separation via a family of boundary probes (two workable options)\n- Option A (per-bit probes Q_j with address field): Reserve B distinct boundary-output 4-tuples {Q_j : j∈[B]}. In the port zone, include an address track Addr∈[B] and a data track RID∈{0,1}. Local rules enforce that under boundary outputs Q_j the only legal continuation is a deterministic pointer that walks from the boundary to the unique port cell with Addr=j and then accepts iff RID=1 at that cell; otherwise no continuation exists. For all non-reserved boundary outputs we allow generic ⊥-plumbing so they do not affect separation. Fix a boundary-input pattern a⋆. Then for each u we have E_{L(u)}(a⋆)[Q_j]=u_j. Consequently, u≠u′ implies Type(L(u))≠Type(L(u′)). This uses O(B) extra symbols (addresses/pointer states) and remains within β=poly(s).\n- Option B (mask/parity probes with M≥B tests): Reserve M boundary-output 4-tuples {b_t : t∈[M]} with M≥B. Store in the input of W_L(u) a table of M masks M_t∈{0,1}^B (with the B×M matrix of full rank over GF(2)) and the RID block u. Under boundary outputs b_t, a deterministic pointer reads M_t and then the RID block and accumulates the inner product ⟨M_t,u⟩ mod 2 using a small “RUN” zone (row-by-row locally checked). Accept iff the parity is 1. Define Sig(u)=(⟨M_t,u⟩)_t∈{0,1}^M; Sig is injective because M≥B and the masks are independent. Fixing a boundary-input a⋆, E_{L(u)}(a⋆)[b_t]=Sig(u)_t, so types differ for distinct u. Again, the probe behavior is radius-1 and β=poly(s) suffices.\n- In both options, under reserved probes the control is deterministic (no error-chain escape). Outside reserved probes, error-chains and ⊥-plumbing ensure malformed interiors do not constrain f.\n\nSeam gadget for succinct adjacency and color inequality\n- In an (F1) instance on L(u) seam R(v), the bridge wb∘wc hosts a row-by-row simulation of a fixed TM U that evaluates D(u,v) in poly(s) steps:\n  1) The port zones adjacent to S on each side expose the B-bit strings u and v. A small handshake track opens a corridor through wb∘wc where U’s tableau is laid out.\n  2) Cout–out enforces nearest-neighbor consistency between successive rows; malformed rows are locally refutable (no accepting continuation). The run emits a verdict bit EDGE∈{0,1} at a fixed place near S.\n  3) Local acceptance: If EDGE=0 (non-edge), admit completion irrespective of colors at S; if EDGE=1 (edge), admit completion iff the two color tokens at the two S nodes differ. These are radius-1 checks.\n- If either side is inactive (not a canonical vertex context), a ⊥-plumbing language allows completion irrespective of the other side and the colors; however, the role gating forbids colors at S for inactive types, so mapping inactive types to a color would violate (F1) on some pair.\n\nNeutralizing (F2)\n- Add a global ⊥-filler that, for any context (w_1,S,w_2) and any z≥1, allows filling w_1^z and w_2^z entirely with ⊥ symbols, consistent with any boundary outputs and inputs, without altering the two S positions or the vertex-role gating. Then (F2) holds for every f, reducing the 3-way classification on this family to (F1)-feasibility.\n\nWhy this matches our DP/type framework\n- Types are defined with respect to fixed inputs; the reserved-probe acceptance depends only on the interior index u and the chosen boundary 4-tuple, so it is type-invariant. The DP in O(kβ^2) can verify both probe behavior and seam runs on small test instances (e.g., B=2), giving a concrete auditable path.\n\nKey cautions to enforce in the local rules\n- Reserved probes must have a unique legal continuation (deterministic pointer/run); no error-chain may provide an alternative accepting path.\n- Color tokens at S must be gated by the vertex role; inactive contexts cannot place colors, ensuring f is only free on canonical vertex types and ⊥ elsewhere.\n- The seam gadget must accept for non-edges regardless of colors and enforce inequality for edges; malformed simulations must not accept.\n\nMinimal sanity check (B=2)\n- Use Option A with Q_1,Q_2 and an Addr track {1,2} in the port zone. For u∈{00,01,10,11}, the vector (E_{L(u)}(a⋆)[Q_1], E_{L(u)}(a⋆)[Q_2]) equals u. The seam gadget with a small circuit D (e.g., a 4-cycle) enforces inequality exactly on edges, which can be brute-forced by the DP.\n",
  "new_notes_append": "True",
  "new_outputs_md": "",
  "new_outputs_append": "True",
  "verdict": "partial success"
}