{
  "content": "# Clarification\nThe statement of “Conjecture 7.2” is not present in the provided notes/output. The paper excerpt contains two conjectures:\n- Conjecture (labeled thm:5): injectivity of τ^Z_{N,Z} for any infinite set Z of roots of unity.\n- Conjecture (labeled thm:7): units in Habiro’s ring Z[q]^N are exactly {±q^i}.\nI will assume Conjecture 7.2 refers to the injectivity-for-infinite-Z statement. If instead it refers to the units conjecture, please confirm; some remarks below still inform that case.\n\nIdeas\n- Extend Theorem 5.4 (Theorem~\\ref{thm:2} in the excerpt), which proves injectivity of τ^R_{S,Z} when Z contains infinitely many elements of prime power order, to a strictly larger class of infinite Z that need not contain any prime power orders.\n- The proof of Theorem~\\ref{thm:3} hinges on finding, for a fixed n, infinitely many m with m/n a prime power; this forces a fixed coefficient in the Φ_n-adic expansion to be divisible by arbitrarily many primes. We can generalize by allowing an infinite chain of orders where successive ratios are prime powers.\n\nMain result (new): Chain criterion for injectivity\nDefinition. A sequence (m_i)_{i\\ge 1} of positive integers is a prime-power chain if m_{i+1}/m_i is a positive power of a prime for each i.\n\nTheorem A (Chain injectivity). Let R be a subring of \\bar{\\mathbb{Q}}, S\\subset \\mathbb{N} be \\Leftrightarrow_R-connected, and Z\\subset Z^{\\bar{\\mathbb{Q}}}_S. Suppose N_Z contains an infinite prime-power chain (m_i)_{i\\ge 1}. Then the evaluation map\nτ^R_{S,Z}\\colon R[q]^S \\to \\prod_{\\zeta\\in Z} R[\\zeta]\n is injective.\n\nProof. It suffices to show injectivity on the subproduct indexed by any infinite subset, hence we may restrict to Z' consisting of primitive roots of orders in T=\\{m_i\\mid i\\ge 1\\}. Assume a\\in R[q]^S satisfies τ^R_{S,T}(a)=0. Set n:=m_1 and write the Φ_n-adic expansion in R[q]^{\\{n\\}}:\nρ^R_{S,\\{n\\}}(a)=\\sum_{j=\\ell}^{\\infty} a_j\\,\\Phi_n(q)^j,\\quad a_\\ell\\notin (\\Phi_n(q)).\nFor each i, a evaluates to 0 at order m_i, hence its image in R[q]/(\\Phi_{m_i}) is 0. Standard properties of inverse limits imply that “divisibility” by \\Phi_{m_i} holds in R[q]^S; applying ρ^R_{S,\\{n\\}} we get, in R[q]^{\\{n\\}}, divisibility by \\Phi_{m_i}:\nρ^R_{S,\\{n\\}}(a)=\\Phi_{m_i}(q)\\,b_i\\quad \\text{for some }b_i.\nLet W_k:=\\prod_{i=2}^{k}\\Phi_{m_i}(q). Then ρ^R_{S,\\{n\\}}(a)=W_k\\,c_k for some c_k and all k.\nReduce modulo (\\Phi_n): in R[q]/(\\Phi_n), we have\n(a_\\ell \\bmod \\Phi_n)=\\big(W_k \\bmod \\Phi_n\\big)\\cdot (c_k^{(0)} \\bmod \\Phi_n),\nwhere c_k^{(0)} is the constant term of c_k in the Φ_n-adic expansion. We claim\nW_k \\bmod (\\Phi_n)\\ \\in \\ (p_1\\cdots p_{k-1})\\cdot \\big(R[q]/(\\Phi_n)\\big),\nwhere m_{i+1}/m_i=p_i^{e_i}. This follows by induction using Lemma~\\ref{lem:3}(1): for each i, there exist A_i,B_i\\in\\mathbb{Z}[q] with\n\\Phi_{m_{i+1}}=p_i A_i+\\Phi_{m_i}B_i.\nModulo (\\Phi_n), \\Phi_{m_{i+1}}\\equiv p_i A_i+(\\Phi_{m_i}\\bmod \\Phi_n)B_i, hence\nW_{i+1}=W_i\\Phi_{m_{i+1}} \\equiv p_i(W_i A_i)\\ (\\bmod\\ \\Phi_n),\nso by induction W_k\\equiv (\\prod_{i=1}^{k-1}p_i)\\,U_k\\ (\\bmod\\ \\Phi_n). Consequently, each coefficient of a_\\ell\\bmod (\\Phi_n) is divisible in R by p_1\\cdots p_{k-1}. As k\\to\\infty and each rational prime is a nonunit in R\\subset \\bar{\\mathbb{Q}}, we conclude a_\\ell\\equiv 0 \\bmod (\\Phi_n), a contradiction. Thus ρ^R_{S,\\{n\\}}(a)=0. The injectivity of ρ^R_{S,\\{n\\}} (Theorem~\\ref{thm:17}) implies a=0. Hence τ^R_{S,Z} is injective. ∎\n\nWhy useful here\n- Theorem A strictly extends Theorem~\\ref{thm:2}: it covers infinite Z that do not contain any prime power orders, e.g., Z with orders of the form m\\cdot p^e for a fixed m>1 (odd) and infinitely many e, or more generally any Z containing an infinite chain m_1\\mid m_2\\mid m_3\\cdots with successive ratios prime powers.\n\nExamples\n- Fix odd m>1. Let Z contain primitive roots of unity of orders m\\cdot 2^e for infinitely many e\\ge 1. Then τ^\\mathbb{Z}_{\\mathbb{N},Z} is injective by Theorem A, even though Z contains no prime powers (if m>1).\n- More generally, if Z contains orders m\\cdot p^e for fixed m, fixed prime p, and arbitrarily large e, then τ is injective.\n\nObstacles\n- The “hard” case not covered by Theorem A (nor by Theorem~\\ref{thm:2}) is when N_Z fails to contain any infinite prime-power chain, e.g., Z consisting of all primitive p-th roots with p prime, or more generally sets of pairwise coprime orders with no divisibility chains. New ideas seem needed (e.g., exploiting pairwise coprimeness of (\\Phi_m,\\Phi_n)=1 and Chinese remaindering at the level of compatible systems in the inverse limit).\n- For the units conjecture U(\\mathbb{Z}[q]^\\mathbb{N})={±q^i}, Theorem A does not directly apply. A unit u maps to units u(\\zeta)\\in \\mathbb{Z}[\\zeta]^\\times for all \\zeta; constraining such a “global” family of cyclotomic units to arise from a single Habiro element remains open. Proposition 7.19 in the excerpt shows no new units arise from rational functions with cyclotomic denominators, narrowing the search, but further structure (e.g., Jacobson radical or a “logarithm” on suitable pro-p parts) seems necessary.\n\nNext steps\n- Target the prime-order case: attempt to prove injectivity of τ for Z consisting of all primitive p-th roots with p in an infinite set of primes. A promising route is to exploit that (\\Phi_p,\\Phi_q)=(1) for distinct primes p\\neq q and to combine vanishing constraints through the components at products \\Phi_{p_1}\\cdots \\Phi_{p_k} inside the inverse system—noting the lack of cofinality is the main obstruction.\n- Explore whether one can show: if a\\in \\mathbb{Z}[q]^\\mathbb{N} vanishes at infinitely many prime orders, then its projections to (q^n-1)-adic completions vanish for infinitely many n, forcing a=0 via Theorem~\\ref{thm:17}.\n- For the units conjecture, consider the subgroup of units with u(1)=1 and u(\\zeta)=1 for infinitely many \\zeta forming a chain; Theorem A then forces u=1. Extend from “1 at infinitely many \\zeta” to “root of unity value at infinitely many \\zeta”, aiming to show u=±q^i.\n"
}