{
  "content": "Ideas\n- Close the remaining gap: classify cliques S of kG with no edge-sharing pair. Prove that either S is contained in a single vertex-star T(v) (hence not maximal unless S=T(v)), or S is exactly the triple of edge-neighbors of a fully interior face (hence not maximal, as it extends to N(t)).\n- With this, we obtain a complete classification of maximal cliques of kG: they are precisely vertex-stars T(v) and the 4-cliques N(t) for fully interior faces t. A clean corollary is ω(kG)=max{4, max_v |T(v)|}.\n\nTools recalled (established earlier)\n- K4-freeness; all primal maximal cliques are facial triangles.\n- Link of an interior vertex is a chordless cycle; T(v) is a clique; for interior v, T(v) is maximal in kG.\n- Local Helly across an interior edge: if uv is interior with faces uvw, uvx, then any face meeting both must contain u or v.\n- If S contains two faces sharing an interior edge, then S=T(u), or T(v), or N(t) for one of the two uv-faces (anchor argument).\n- For fully interior t=abc, N(t)={t and its three edge-neighbors} is a maximal K4 of kG.\n\nKey new lemma: the three-triangle lemma\nLemma 1 (Three-triangle lemma).\nLet F1,F2,F3 be facial triangles that are pairwise intersecting, no pair shares an edge, and F1∩F2∩F3=∅. Then there is a fully interior face t=abc such that {F1,F2,F3}={f_ab,f_bc,f_ca}, the three faces across the edges of t.\nProof.\nLet c be the unique vertex in F1∩F2, a the unique vertex in F2∩F3, and b the unique vertex in F3∩F1. Then: F1 contains b and c (it meets F2 at c and F3 at b); F2 contains c and a; F3 contains a and b. Thus bc, ca, ab are edges (each appears in F1,F2,F3 respectively). Hence a,b,c form a 3-cycle; by Whitney, abc bounds a face t. Edge bc lies in F1 and t, so bc is interior; similarly ab and ca are interior. Moreover, F1 cannot contain a (else a∈F1∩F2∩F3), so F1 is the unique face across bc; similarly F2=f_ca and F3=f_ab. ∎\n\nClassification of no-edge-sharing cliques\nProposition 2 (No-edge-sharing cliques are extendable).\nLet S be a clique in kG (a pairwise-intersecting family of facial triangles) in which no two members share an edge. Then exactly one of the following holds:\n(i) There is a vertex v such that S⊆T(v).\n(ii) |S|=3 and S={f_ab,f_bc,f_ca} for some fully interior face t=abc.\nIn particular, no such S is maximal in kG: in case (i) it extends within T(v) (unless S=T(v)), and in case (ii) it extends to N(t)=S∪{t}.\nProof.\nIf ⋂S≠∅ pick v∈⋂S; then S⊆T(v), proving (i). Suppose ⋂S=∅. Pick three distinct faces F1,F2,F3∈S. They are pairwise intersecting; since S has no edge-sharing pair, Lemma 1 applies, yielding a fully interior t=abc with {F1,F2,F3}={f_ab,f_bc,f_ca}. We show S has no other face. Let f∈S\\{F1,F2,F3}. To intersect f_ab, f contains a or b; to intersect f_bc, f contains b or c; to intersect f_ca, f contains c or a. If f contains two of {a,b,c}, then f shares an edge with one of F1,F2,F3, forbidden. Hence f contains at most one of {a,b,c}; but then f cannot intersect all three of F1,F2,F3, a contradiction. Thus S={F1,F2,F3}, proving (ii). The extension claims follow: in (i) add any other face through v; in (ii) add t. ∎\n\nGlobal classification of maximal cliques of kG\nTheorem 3 (Maximal cliques of kG).\nLet G be the underlying graph of a finite Whitney triangulation of the disk. Then every maximal clique S of kG is of one of the two types:\n- S=T(v) for some vertex v (interior or boundary) such that T(v) is maximal in kG; or\n- S=N(t) for some fully interior triangular face t.\nConversely, each such T(v) and each N(t) is a maximal clique of kG.\nProof.\nThe converse holds by definition for those T(v) that are maximal and by the proven maximality of N(t). For the forward direction, let S be a maximal clique. If S contains two faces sharing an interior edge, the shared-edge classification yields S=T(u), T(v), or N(t) for one of the two faces on that edge, as required. If S has no edge-sharing pair, Proposition 2 implies S⊆T(w) for some w or S is the triple {f_ab,f_bc,f_ca}. In the former case, maximality forces S=T(w); in the latter, S is not maximal since S∪{t} is a larger clique (contradiction). Thus S is of the stated types. ∎\n\nCorollary 4 (Clique number of kG).\nFor a Whitney triangulation G of the disk, ω(kG)=max{4, max_v |T(v)|}.\nProof.\nBy Theorem 3, the largest cliques are among the T(v) and the N(t), and |N(t)|=4. ∎\n\nExamples\n- Fan (one interior vertex v): the only maximal clique is T(v), which is all faces; hence kG is complete and k^2G≅K1.\n- Two-face disk: the unique interior edge has the two incident faces; the only maximal clique is T(w) for each endpoint w (size 2); kG≅K2, k^2G≅K1.\n- Central-triangle hexagon: the fully interior face t gives N(t)≅K4; by Corollary 4, ω(kG)=4; adding t collapses to K1 at the next iteration.\n\nObstacles and checks\n- Boundary stars T(v): our classification does not assume T(v) is always maximal; the theorem only asserts that any maximal clique is a T(v) (when such T(v) is maximal) or an N(t). This neatly bypasses the variability for boundary vertices.\n- Size-2 maximal cliques can occur (e.g., two-face disk) but are of star type and are captured by Theorem 3.\n\nNext steps\n- Formalize Theorem 3 and its lemmas into proofs.md; in particular, Proposition 2 closes the “no-edge-sharing” gap flagged by the verifier.\n- Use the classification to analyze k(kG): its vertices correspond to {T(v)} and {N(t)}; record exact intersection patterns T(u)∩T(v) (nonempty iff uv is an edge), T(v)∩N(t) (nonempty iff v∈V(t) or v is the third vertex across one edge), and N(t)∩N(t′). Aim to bound ω(k(kG)) and identify conditions forcing k^2G complete (hence k-null in two steps).\n- Outerplanar case: exploit the dual-tree structure. T(v) corresponds to a contiguous path of faces in the dual tree; use interval-graph machinery to describe kG from these paths and apply Theorem 3 (there are no fully interior faces when the dual is a path). Target an ear-removal induction proving k-nullness for all maximal outerplanar disks.\n\nSummary\n- Proved the three-triangle lemma and a full classification (Proposition 2) of no-edge-sharing cliques.\n- Completed the global classification (Theorem 3): maximal cliques of kG are exactly vertex-stars T(v) and the 4-cliques N(t) around fully interior faces. Immediate corollary: ω(kG)=max{4, max_v |T(v)|}.\n- These results strengthen the local structure needed for analyzing k-dynamics and set up the next step: structural analysis of k(kG) via stars and interior 4-cliques."
}