{
  "content": "Ideas\n- Close the “no edge-sharing” gap: classify cliques C of kG formed by facial triangles with the property that no two share an edge. We prove such C either has a common vertex (thus C⊆T(v)) or has size exactly 3 and equals the three neighbors of a fully interior face t (hence not maximal, since it extends to C(t)).\n- With this, finish the global classification: every maximal clique of kG is either a full vertex-star T(v) or a fully interior face-centered K4 C(t). This removes the incorrect size restriction on T(v) noted by the verifier.\n- Record useful intersection formulas among T(·) and C(·) families to prepare a structural analysis of k(kG).\n\nNotation and preliminaries\n- G is a finite Whitney triangulation of the disk. Its maximal cliques are exactly the facial triangles; write F(G) for the set of faces.\n- For a vertex v∈V(G), T(v):={faces of G containing v}.\n- For a face t=abc, define C(t):={t}∪{the opposite face across each interior edge of t}. Thus |C(t)|∈{1,2,3,4}, with |C(t)|=4 iff all three edges of t are interior (“fully interior face”).\n- Basic facts we use (proved in earlier rounds and checked by the verifier): G is K4-free; every 3-cycle is a face; the link of an interior vertex is a chordless cycle; “local Helly across an interior edge”: for an interior edge uv with uvw and uvx the incident faces, any face meeting both must contain u or v. Also, the only common neighbors of the endpoints of an edge uv are the two third vertices of the two faces on uv.\n\nA key auxiliary lemma\nLemma 1 (Two common neighbors only). If uv is an edge of G with incident faces uvw and uvx, then the common neighbors of u and v in G are exactly {w,x}.\nProof. If z is adjacent to both u and v, then uvz is a 3-cycle, hence a face by the Whitney property. An edge in a triangulation is in exactly two faces; therefore z∈{w,x}. ∎\n\nNo-edge-sharing cliques\nLemma 2 (No-edge-sharing cliques are either vertex-stars or 3-neighborhoods). Let C⊆F(G) be a clique in kG such that no two faces in C share an edge. Then either:\n(i) there is a vertex v with C⊆T(v), or\n(ii) |C|=3 and C is exactly the set of the three neighbors of a unique fully interior face t (equivalently, C=C(t)\\{t}).\nProof. If C contains three faces τ1,τ2,τ3 with no common vertex, then, since no pair in C shares an edge, Lemma 1 implies that each pair τi,τj intersects in exactly one vertex and these three pairwise intersections are distinct. By the argument in the “three-triangle” lemma from previous rounds, τ1,τ2,τ3 are the unique three neighbors of a fully interior face t=abc, where {a,b,c} are these three intersection vertices. Moreover, any fourth face τ meeting all of τ1,τ2,τ3 would have to contain at least two of {a,b,c} (by Lemma 1 applied to pairs), hence share an edge with one of τi’s, contradicting our no-edge-sharing hypothesis. Thus |C|=3 and we are in case (ii).\nOtherwise, every triple of faces in C has a common vertex. Fix distinct τ0,τ1∈C. Because no two faces in C share an edge, τ0∩τ1 is a single vertex, denote it by v. For any τ∈C, the triple {τ0,τ1,τ} has a common vertex; the only common vertex of τ0 and τ1 is v, hence v∈τ. Therefore v∈⋂_{τ∈C}τ, proving C⊆T(v), i.e., case (i). ∎\n\nMaximal cliques: full classification\nProposition 3 (Maximal cliques via a shared interior edge; corrected). Let C be a maximal clique in kG that contains two faces on the same interior edge uv. Then C=T(u), or C=T(v), or C=C(t′) for one of the two uv-faces t′. In the mixed case (faces containing u but not v and v but not u occur), the “anchor” argument forces C to be exactly C(t′).\nProof. This is the refined “anchor” proof from prior rounds, using Lemma 1 and the local Helly across uv; details have been vetted in feedback and are omitted here for brevity. ∎\n\nProposition 4 (Maximality of C(t)). If t is a fully interior face, then C(t) induces K4 in kG and is a maximal clique.\nProof. Any two elements of C(t) share a vertex of t, so C(t) induces K4. Let f∉C(t) be a face intersecting all members of C(t). If f contains none of {a,b,c}, it misses t; impossible. If f contains two of {a,b,c}, then it shares an edge with t, hence equals t or the opposite face across that edge, both in C(t); contradiction. If f contains exactly one, say a, then to meet the opposite-face across bc (which omits a) f must contain x_bc, the third vertex of that opposite; but then the edges ab, ac, b x_bc, c x_bc and a x_bc give a K4 on {a,b,c,x_bc}, violating K4-freeness. Thus no such f exists and C(t) is maximal. ∎\n\nTheorem 5 (Global classification of maximal cliques of kG). Let G be a Whitney triangulation of the disk. Then every maximal clique of kG is either of the form T(v) for some vertex v, or of the form C(t) for some fully interior face t.\nProof. Let C be a maximal clique. If C contains two faces sharing an interior edge, apply Proposition 3. Otherwise, C has no edge-sharing pairs. By Lemma 2, either C⊆T(v) for some v, in which case maximality forces C=T(v), or |C|=3 and C=C(t)\\{t} for a fully interior t, which is not maximal by Proposition 4. ∎\n\nIntersection calculus (for use in k(kG))\n- T(u)∩T(v) is precisely the set of faces incident with edge uv; it has size 2 if uv is interior, size 1 if uv is boundary, and is empty if uv∉E(G).\n- For a fully interior t=abc, C(t)∩T(a)={t, face across ab, face across ca} has size 3; C(t)∩T(x_ab)={face across ab} has size 1; similarly for b,c and the other opposite vertices. Hence each C(t) meets exactly 6 distinct T(·)’s unless some of those T(·) are non-maximal and thus absent in k(kG).\n- If t1 and t2 are fully interior and share an edge, then C(t1)∩C(t2)={t1,t2}; if they share no edge, |C(t1)∩C(t2)|≤1 (often 0). In particular, among C(·)-type vertices in k(kG) the induced subgraph has maximum degree at most 3 via edge-sharing in the primal.\n\nExamples\n- Hexagon with central fully interior triangle ACE (faces: ACE; ABC, CDE, EFA). kG is K4, so k^2G≅K1 (C(t) is the unique maximal clique).\n- Hexagon triangulation with faces ABC, ACD, ADE, DEF. Maximal cliques of kG are T(A) and T(D) (both size 3), hence k^2G≅K2 and k^3G≅K1.\n\nObstacles and remarks\n- Dynamics beyond classification: H:=kG is not a triangulation, so Theorem 5 does not recursively apply to H. However, Theorem 5 gives an explicit list of H’s maximal cliques, enabling a direct study of J:=k(H)=k^2G. Vertices of J correspond to those T(v) that are maximal in H and to all fully interior faces t (via C(t)). A key next step is to characterize when T(v) is maximal in H (boundary cases may or may not be maximal) and to describe adjacency in J via the intersection calculus above.\n- Outerplanar ear-removal. Fully interior faces can occur even in maximal outerplanar triangulations (e.g., triangle ACE in a hexagon), so any ear-removal induction must track both T(v)- and C(t)-type cliques. The dual graph is a tree, and T(v) correspond to contiguous paths therein; C(t) correspond to degree-3 branching around fully interior triangles. This suggests J is “tree-like” (sparse), but a precise invariant ensuring k-nullness remains to be proved.\n\nNext steps (checkable)\n1) Formalize in proofs.md: Lemma 1; Lemma 2 with the short “fix two faces” argument; Proposition 3 with the corrected anchor proof; Proposition 4; Theorem 5; and the intersection calculus claims with brief proofs.\n2) Characterize maximality of T(v) in H: give necessary and sufficient conditions in terms of inclusions among the paths of faces around vertices (in the outerplanar case, paths in the dual tree), and how the presence of a fully interior face C(t) subsumes some T(v).\n3) Describe J=k^2G explicitly in small families: outerplanar triangulations up to n=10, and disks with one or two interior vertices of degree 4 or 5. Verify that J tends to be a forest or a cactus; if so, iterate k and record stabilization times.\n4) Seek a potential function Φ(G) defined on Whitney disks such that Φ(kG)<Φ(G) strictly, using counts of fully interior faces and inclusion-maximal vertex-stars. A promising candidate is the number of maximal cliques of kG plus a weighted sum of the sizes of their pairwise intersections.\n\nSummary\n- We closed the “no edge-sharing” case (Lemma 2) and, combined with the shared-edge classification, proved Theorem 5: every maximal clique of kG is either a vertex-star T(v) or a fully interior face-centered C(t). This corrects the prior size restriction and aligns with the verifier’s feedback.\n- We added intersection formulas between T(·) and C(·), setting up the analysis of J=k^2G. The outerplanar ear-removal program must accommodate C(t)-type cliques; the dual-tree viewpoint remains promising for showing k-nullness in that subcase."
}