{
  "progress_md": "Round 0007 — Audit, new structural corollaries, and probability refinements\n\nOverview and quick audit of output.md\n- The current file is coherent and self-contained for the plateau calculus. The new branches (τ=⌊m/ln L⌋, balanced split τ=⌊L/2⌋), the global min-of-three envelope, and the multi-plateau probability mixing are all correctly stated with safe constants. I see no blocking correctness errors.\n- Small opportunity: Corollary 9 already yields a family of quantile/probability statements for any η∈(0,1). It may be valuable to explicitly record the “median” instantiation (η=1/2) yielding a 25% plateau-level probability, alongside the existing 1% instantiation, for ease of use.\n\nNew, checkable additions (proposed to curate)\n\n1) Power-law profile corollary (constant average and explicit constants)\n- Statement. Suppose on a window [m,2m) we have \n  OPT_k ∈ [C_1 k^{−p}, C_2 k^{−p}] for some p>0 and constants C_1,C_2>0.\n  Then the maximal factor-2 plateau I⊆[m,2m) starting at m has length L≥(2^{1/p}−1)m and hence, by Corollary 5, for k uniform on I,\n  E_{k∈I} E_++[ALG/OPT] ≤ 2 C_bi (a+1+ln(2/α)) + o(1), with α:=2^{1/p}−1 and a:=2+1/(2e).\n  Consequently, averaging over [m,2m) yields a constant bound depending only on p and C_bi, uniformly for large m.\n- Proof sketch (checkable). For k∈[m, m+L), OPT_{m+L} ≥ OPT_m/2 is equivalent to ((m+L)/m)^p ≤ 2, i.e., L ≤ (2^{1/p}−1)m. Hence the factor-2 plateau starting at m has length at least α m with α=2^{1/p}−1. Apply Corollary 5 with this α and note the endpoint term is o(1) as L→∞.\n- Why useful. Captures a broad and natural regime (polynomial decay) where random-k smoothing gives a constant bound with explicit dependence on p. This can be turned into explicit numeric constants by plugging C_bi (e.g., 5) and p (examples below).\n- Example. For p=1 and C_bi=5, α=1 and the plateau average is ≤ 10(3+1/(2e)+ln 2)+o(1) ≈ 38.8.\n\n2) Median (25%) plateau-level probability guarantee (simple instantiation of Corollary 9)\n- Statement. In Corollary 9, choosing η=1/2 and c=2 yields, for k uniform over any plateau I=[m,m+L) with L≥2,\n  P_{k,++}[ ALG/OPT ≤ 2·B_I ] ≥ (1−1/2−O(1/L))·(1−1/2) = 1/4 − O(1/L),\n  where B_I = 2 C_bi (1 + m/(e(T−1))) and T = max{2, ⌈(L−1)/2⌉+1}. If L ≥ α m, then B_I ≤ 2 C_bi (1 + 2/(α e)) + O(1/L).\n- Why useful. Complements the 1% probability remark with a clean, stronger (≈25%) option under the same framework; particularly handy when downstream needs favor a larger success probability, albeit with a larger constant than one might get by tuning η.\n\n3) Discrete 1/k-smoothness across the window ⇒ O_A(1) average (global structural corollary)\n- Hypothesis. Suppose for all k∈[k0,2k0) we have\n  ln(OPT_{k−1}/OPT_k) ≤ A/k\n  for some A>0. (Equivalently, OPT_{k−1} ≤ (1 + A/k) OPT_k.)\n- Lemma (plateau length and count). On any factor-2 plateau starting at m within the window, the length satisfies L ≥ (ln 2)·m/A (by Lemma 2 with δ=A/m). Moreover, the starting indices m_j of consecutive plateaus grow multiplicatively by at least (1 + (ln 2)/A). Hence the number of plateaus J across [k0,2k0) is at most ⌈ ln 2 / ln(1 + (ln 2)/A) ⌉ ≤ ⌈ (1 + (ln 2)/A)·A/ln 2 ⌉ = O(A).\n  A safe bound is J ≤ ⌈ (A + ln 2)/ln 2 ⌉.\n- Corollary (global average). Applying Corollary 5 on each plateau and Corollary 13 for aggregation,\n  E_{k∼U([k0,2k0)),++}[ALG/OPT]\n  ≤ 2 C_bi (a+1+ln(2/α)) + (C_fix/k0)∑_{j=1}^{J} ln m_j,\n  with α=(ln 2)/A. Since J=O(A) and m_j≤2k0, the endpoint term is ≤ C_fix·J·ln(2k0)/k0 = o(1). Therefore,\n  E[ALG/OPT] ≤ 2 C_bi (a+1+ln(2A/ln 2)) + o(1),\n  i.e., an O_A(1) bound uniformly over the window for large k0.\n- Proof sketch (checkable). The length bound is Lemma 2 with δ=A/m. For the count, m_{j+1} ≥ m_j + (ln 2)m_j/A = (1 + (ln 2)/A)m_j; iterating till we exceed 2k0 gives the stated J bound. Aggregation then applies Corollary 5 per plateau and shows the endpoint-sum is negligible because J≪k0.\n- Why useful. This supplies a transparent, data-agnostic smoothness condition that forces long plateaus throughout the window and yields a global O(1) average (as a function of A), sharpening the unconditional O(log k0) bound under a verifiable regularity premise.\n\n4) Global mixture corollary from power-law or 1/k-smoothness (explicit probability)\n- If the entire window [k0,2k0) satisfies the power-law or 1/k-smoothness hypotheses (items 1–3), then γ=1 in Corollary 16 and in the “25%” remark above. Consequently,\n  P_{k,++}[ ALG/OPT ≤ 2·B_I ] ≥ 1/4 − o(1),\n  with B_I ≤ 2 C_bi (1 + const) depending only on p (power law) or A (smoothness). This offers a straightforward probability ≥ 0.25 guarantee meeting the alternative task objective with fully explicit constants.\n\nWhy these additions are useful here\n- They convert common, checkable structural properties of OPT(·) (polynomial decay; bounded discrete derivative) into clean, global O(1) averages and explicit constant-probability statements, strengthening the “why randomizing k helps” narrative beyond single-plateau assumptions.\n- All statements are direct instantiations of existing machinery (Lemma 2, Corollary 5, Corollary 9, Corollary 13) and require only short algebraic verifications.\n\nExamples and sanity checks\n- Power-law p=1. On [m,2m), α=1; by item 1 with C_bi=5, the plateau average is ≤ 10(3+1/(2e)+ln 2)+o(1) ≈ 38.8; by item 2 with α=1, B_I ≤ 2·5·(1+2/e) ≈ 18.7, giving a 25% probability threshold ≤ 37.4.\n- Smoothness A=2. Then α=(ln 2)/2≈0.346; the global average is ≤ 2 C_bi (a+1+ln(2A/ln 2)) + o(1) ≈ 10(3+1/(2e)+ln(2·2/ln 2)) ≈ 10(3.183 + 1.060) ≈ 42.4 (with C_bi=5), plus o(1).\n\nObstacles and gaps\n- Heavy-coverage program. The main missing piece remains a rigorous persistence denominator: a deterministic or high-probability lower bound of the form cost_t(all) ≥ (β+1)·U_t(H) prior to covering all heavy clusters, derivable from a clean separation hypothesis. Once established, summing conditional collision probabilities becomes straightforward.\n- Constants for the median probability. The η=1/2 choice is general but not constant-optimal. Users may tune η to trade off between success probability and threshold; documenting η=1/2 offers a simple default.\n\nNext steps (actionable)\n1) Add the “Power-law profile” corollary (item 1) to output.md with explicit constants and a short proof (one-liner invoking Corollary 5 with α=2^{1/p}−1).\n2) Add a one-line “25% probability” remark (η=1/2, c=2) next to the 1% instantiation.\n3) Curate the “global smoothness ⇒ O_A(1) average” corollary (item 3) including the plateau-count bound J=O(A) and the endpoint-term o(1) argument.\n4) For heavy coverage, target a clean geometric hypothesis and prove cost_t(all) ≥ (β+1)·U_t(H) before completing coverage of H; then combine with the eH_t supermartingale to bound expected heavy-collisions and lift to high probability.\n"
}