{
  "content": "# Status and aim\n\n- The complexity of 3-coloring circle graphs remains open (Unger’s purported O(n log n) algorithm was invalidated by Bachmann–Rutter–Stumpf; NP-completeness is known for k ≥ 4, but k = 3 is unresolved).\n- Goal: make incremental, verifiable progress via special cases, parameterized algorithms, and crisp obstacles.\n\n# Preliminaries\n\n- Circle graphs ≡ overlap graphs of intervals. If we cut the circle at a point avoiding endpoints, each chord becomes an interval [l, r] on a line; two chords cross iff the intervals overlap (i.e., intersect and neither contains the other). Conversely, given intervals, glue the endpoints around a circle and connect endpoints of each interval to obtain chords; two intervals overlap iff the chords cross. Thus 3-coloring circle graphs ≡ 3-coloring interval-overlap graphs.\n\n- Rephrase: Color intervals with 3 colors so that no two overlapping intervals share a color. Intervals of the same color must form a family closed under nesting and disjointness; among simultaneously active intervals, each color class is a stack (properly nested parentheses).\n\n# A fixed-parameter algorithm by interval ply\n\nDefinition (ply). For a set of intervals, its ply w is the maximum number of intervals covering any point (i.e., the maximum size of the active set between consecutive endpoints). Note w is for the interval family, not the overlap graph.\n\nTheorem. Given a circle-graph representation (equivalently an interval family), 3-colorability can be decided in time O(n · w · 3^w) and space O(3^w) where w is the ply. More generally, k-colorability is decidable in O(n · w · k^w).\n\nSketch of algorithm (deterministic DP over endpoints):\n- Sort the 2n endpoints; let e_1, …, e_{2n} be their order. At position t define the active set A_t of intervals i with l_i ≤ t < r_i.\n- A DP state at time t is a partition (A^1_t, A^2_t, A^3_t) of the active set A_t into three color stacks that is admissible, meaning it could arise from some partial 3-coloring of intervals whose starts are ≤ t, respecting the stack constraint: within each A^c_t, if we denote r_top(A^c_t) as the minimum right endpoint in that set, every interval in A^c_t must have right endpoint ≥ r_top(A^c_t).\n- Initialization: S_0 = { (∅, ∅, ∅) }.\n- Transition from t to t+1:\n  • If e_{t+1} = start of interval j: for each state and color c with either A^c_t = ∅ or r_j < r_top(A^c_t), add j to A^c_t to form a successor state.\n  • If e_{t+1} = end of interval j: a state is valid only if j ∈ A^c_t for a unique c and r_j = r_top(A^c_t) (i.e., j is at the top of its stack); then remove j from A^c_t to form the successor.\n- Accept if S_{2n} contains the empty partition.\n\nComplexity analysis:\n- For each t, |A_t| ≤ w, so the number of partitions is ≤ 3^{|A_t|} ≤ 3^w. Deduplicating states per t yields O(3^w) states at any step.\n- Each transition computes r_top after add/remove in O(1) if we store the per-color current minimum and in O(w) when a removed minimum must be recomputed by scanning the bitmask; overall O(w) per transition suffices.\n- There are 2n steps, so time O(n · w · 3^w). Memory O(3^w) per layer.\n\nCorrectness invariant:\n- Inductively, every reachable state corresponds to at least one partial coloring that respects that intervals of the same color are nested when simultaneously active. The start condition r_j < r_top(A^c) ensures any newly colored interval is nested inside the current top of that color; the end condition r_j = r_top ensures LIFO popping of nested intervals. Hence no pair of overlapping intervals receives the same color; conversely, any valid 3-coloring induces such a path of states.\n\nRemarks:\n- Extends verbatim to k colors with branching factor k and state count k^{|A_t|}.\n- This DP explicitly uses the interval representation; since circle graphs are recognizable in polytime and a representation can be found in polytime, the overall algorithm is FPT in w on the graph input as well.\n\n# Limits of the parameter w\n\n- The parameter w can be Θ(n) even for trivially 3-colorable instances (e.g., a chain of nested intervals has ply n but empty overlap graph). Thus the FPT result by ply does not settle the general P vs NP-hardness question.\n\n# Special polynomial-time cases\n\n1) Proper interval representations (no containment).\n- If no interval contains another, “overlap” = “intersection”, so the overlap graph is an interval graph. Interval graphs are perfect; 3-colorability reduces to testing ω ≤ 3, which is computable in linear time after sorting endpoints.\n\n2) Permutation graphs.\n- Permutation graphs are a subclass of circle graphs (map the two lines to two arcs of a circle and straighten segments into chords). They are perfect, so 3-coloring is polynomial-time via perfect-graph coloring (e.g., GLS algorithm). Therefore, 3-coloring is polytime on circle graphs that admit a permutation representation.\n\n# Small examples and sanity checks\n\n- Example where nesting yields a K_3 in the overlap graph: intervals B = [2,7], C = [3,8], D = [4,9] mutually overlap; A = [1,10] contains all and is nonadjacent to B,C,D. The overlap graph is K_3 plus an isolated vertex; 3-colorable by giving B,C,D distinct colors, A reuses any color. The DP above finds this in O(3^w) with w ≤ 4.\n\n- Greedy caveat: a naive online greedy that assigns any feasible color at each start can fail on constructed instances (not included here for brevity); the DP avoids this by exploring all admissible partitions of the active set per endpoint.\n\n# Structural observations possibly useful for future progress\n\n- Cliques: In interval-overlap graphs, any clique corresponds to a family of intervals pairwise intersecting without containment; by Helly’s property, they share a common point. Thus ω equals the maximum size of an antichain (by containment) among intervals active at some cut. For any yes-instance of 3-colorability, ω ≤ 3. However, ω ≤ 3 does not bound the ply w.\n\n- Containment poset: Each color class must be a union of chains together with disjoint components; among active intervals, any single color induces a chain. This “three-stack” structure suggests there might be a flow/matching formulation; we currently do not have a correct compact LP/flow model that enforces the LIFO-nesting constraint globally.\n\n# Obstacles to unconditional P or NP-hardness\n\n- Hardness: Reductions from general 3-COL must land within circle graphs. Planar-3-COL reductions do not directly apply because planar graphs are not contained in circle graphs. Gadget design must respect realizability as chord intersections; robust crossover gadgets remain nontrivial.\n\n- Algorithmic: While the three-stack discipline reveals structure, compressing the DP state to poly(n) without the ply parameter seems to require a nonlocal invariant that we do not yet have (top-of-stack information alone is insufficient to reconstruct pops deterministically).\n\n# Next steps (concrete, testable)\n\n- Implement and test the O(n · w · 3^w) DP on random and structured instances to assess typical ply and practical performance; extend to k colors to check scalability.\n\n- Explore alternative parameters closer to the overlap structure: e.g., the maximum size of an active antichain (which equals ω), plus the number of simultaneously active containments; or the total number of containment pairs. Aim for FPT in (#containment pairs) with a kernelization that contracts laminar chains.\n\n- Identify larger polynomial-time subclasses beyond permutation/proper-interval models: e.g., circle graphs whose circle representation has endpoints confined to a constant number of arcs (t-arc models, t fixed), for which one might combine perfect-graph algorithms and small-ply DP.\n\n- Hardness direction: Try to construct “wire” and “equality/inequality” gadgets within chord diagrams that enforce color propagation, and test via SAT-assisted search whether the resulting graphs are realizable as circle graphs and behave as intended.\n\n# Provisional takeaways for output.md\n\n- Status: 3-coloring circle graphs remains open.\n- Positive result: 3-colorability of circle graphs is FPT in the interval ply w with time O(n · w · 3^w) via a DP over endpoint order that maintains admissible partitions of the active set into three nesting stacks. This extends to k colors with O(n · w · k^w).\n- Special cases in P: proper-interval representations; permutation graphs (hence those circle graphs admitting a permutation representation).\n"
}