{
  "content": "Status and goal\n- The exact complexity of 3-coloring circle graphs remains open. The purported O(n log n) algorithm of Unger is invalid (Bachmann–Rutter–Stumpf). I isolate structural lemmas and give an FPT algorithm under a natural “circular ply” parameter that is directly checkable from a chord representation. I also record neighborhood structure (permutation/trapezoid) that can be exploited in future decompositions.\n\nSetup: circle graphs as overlap graphs\n- Fix a chord diagram with a circular order of 2n endpoints. Cut the circle at a point not coinciding with an endpoint to obtain a linear order 1<…<2n. Each chord x becomes an interval I(x)=(s(x),t(x)) with s(x)<t(x). Two vertices x,y are adjacent iff s(x)<s(y)<t(x)<t(y) or vice versa (overlap without containment). This is the standard equivalence of circle graphs with overlap graphs of intervals.\n\nLemma A (Neighborhoods are permutation graphs)\n- Claim: For any vertex/chord X, the induced subgraph on N(X) is a permutation graph.\n- Proof: Let the endpoints of X split the circle into arcs L and R. Each Y∈N(X) has one endpoint on L and one on R. Reading the orders on L and R as two permutations, Y intersects Z∈N(X) iff the orders are inverted on L vs R; that is exactly the permutation graph model. ∎\n- Consequence: G[N(X)] admits polynomial-time optimal coloring; in particular, testing 2-colorability (which must hold in any 3-coloring, since neighbors of X use the two colors different from c(X)) is linear-time. This necessary condition can be efficiently checked for all X.\n\nLemma B (Double neighborhoods are trapezoid graphs)\n- Claim: For chords X,Y, the subgraph induced by vertices intersecting both X and Y is a trapezoid graph.\n- Proof sketch: The endpoints of X,Y cut the circle into four arcs. Straighten two opposite arcs to two parallel lines; a chord intersecting both X,Y corresponds to a trapezoid whose bases lie on these two lines. Two such chords intersect iff the trapezoids intersect. ∎\n- Consequence: Intersections of neighborhoods of two pivots are also polynomially colorable, giving additional structure for decompositions.\n\nTheorem (FPT algorithm for 3-coloring by circular ply)\n- Parameter: Let w be the maximum number of intervals covering any point of the linearized order (equivalently, the maximum number of chords whose endpoints lie on both sides of some cut point as we sweep the circle). This “circular ply” is computable in O(n) time from the representation.\n- Claim: Given a chord representation, 3-colorability can be decided in time O(n·3^w) and memory O(3^w).\n\nProof (dynamic programming on the sweep)\n- Process events i=1,…,2n in order. Maintain the set A of active intervals (those with s≤i<t) together with a family S of partial states. A state is a proper coloring c: A→{1,2,3} consistent with all adjacencies introduced so far. The number of actives |A| never exceeds w.\n- Transition at start of interval b with end rank r among current actives: For each state c, the neighbors of b among current actives are exactly those a∈A with t(a)<t(b) (i.e., with end rank ≤r). Define forbidden colors F(c)= { c(a): t(a)<t(b) }. Extend c by choosing any color in {1,2,3}\\F(c). If F(c)={1,2,3}, discard. This enforces all new edges incident to b (edges to future intervals will be enforced when those future intervals start).\n- Transition at end of interval a: remove a from A in each state; no new constraints arise (every edge {a,·} was enforced when the other endpoint started).\n- Correctness: Every overlap edge arises at the start of the later-starting interval and is enforced then. Non-edges (nested or disjoint intervals) impose no constraint. By induction over events, S is nonempty at the end iff G is 3-colorable. Since |A|≤w, the number of states is ≤3^w at all times; each transition is processed in time polynomial in 3^w. ∎\n- Extensions: k-colorability runs in O(n·k^w). If w=O(1), the algorithm is linear; if w=O(log n), it is quasi-polynomial.\n\nExamples and sanity checks\n- Cycles C_m are circle graphs with w=2; the DP handles C_5 (needs 3 colors) correctly.\n- Dense nesting (large w) makes the DP exponential, as expected given the unknown general complexity.\n\nObstacles and why naive ideas fail\n- Necessary condition N(X) bipartite for all X (true in all 3-colorable graphs) is not sufficient; BRS exhibited counterexamples to Unger’s attempt to leverage similar constraints. Our Lemma A only makes those checks faster, not sufficient.\n- Globalizing the permutation-graph structure of N(X) across many pivots needs consistency on overlaps N(X)∩N(Y), for which Lemma B (trapezoid graphs) helps but does not yet yield a polynomial-time global algorithm.\n\nNext steps\n- Algorithmic: (i) Engineer the O(n·3^w) DP; verify on random chord diagrams; (ii) Seek representation-dependent cuts minimizing w heuristically; (iii) Explore whether split decomposition combined with Lemmas A–B yields an XP algorithm with provable bounds.\n- Structural: (i) Characterize when the family of 2-colorings of N(X) across all X is jointly extendable; search for a compact consistency certificate; (ii) Investigate whether K_4-free circle graphs have additional constraints that enable polynomial 3-coloring.\n- Hardness: Attempt gadget constructions within the chord model for NAE-3SAT; aim for K_4-free instances. Use triangle gadgets and permutation/trapezoid neighborhoods to route constraints along the circle ordering.\n\nSummary of concrete, checkable contributions\n- Lemma A (N(X) is permutation) with proof; Lemma B (N(X)∩N(Y) is trapezoid) with proof sketch.\n- Theorem: 3-coloring of a circle graph given its representation is FPT in circular ply w, with an explicit O(n·3^w) DP. This yields immediate polynomial-time solvability for bounded-ply subclasses and a practical exact algorithm for small w."
}