{
  "content": "Ideas\n\n- We tighten and prove several graph-based sufficient (and some necessary) conditions guaranteeing a pure Nash equilibrium (PNE) in binary signed network coordination (SNC) games u_i(x)=x_i(h_i+∑_j W_{ij} x_j), with dependency arc i→j iff W_{ij}≠0. We focus on small, auditable modules that slot into the SCC composition pipeline.\n\n- New contributions: (i) weight-dominance ⇒ strict PNE; (ii) 2-player SCCs are universally PNE-admitting (UPA) iff the two off-diagonal entries have the same sign; (iii) forests with sign-symmetric digons ⇒ PNE (via SCC composition); (iv) UPA classification for functional SCCs (outdegree 1 inside SCC): UPA iff every directed cycle has positive sign; (v) structural-balance cycle-parity check in SCCs; (vi) bias-dominates-frustration certificate for a targeted profile.\n\nLemmas and theorems (with proofs)\n\nLemma (Weight-dominance ⇒ strict PNE). If for all i, |h_i|>∑_j |W_{ij}|, then x^* with x^*_i=sgn(h_i) is a strict PNE.\nProof. For fixed x^*_{−i}, u_i(x)=x_i(h_i+∑_j W_{ij}x_j). Then x^*_i(h_i+∑_j W_{ij}x_j)≥|h_i|−∑_j |W_{ij}|>0, so flipping i strictly decreases u_i. Hence x^* is strict.\n\nLemma (Two-player SCC UPA iff same-sign digon). Let U={1,2}, W_{11}=W_{22}=0. The subgame on U is UPA (PNE exists for every external f∈R^U) iff W_{12}W_{21}≥0.\nProof. If W_{12}W_{21}≥0, pick σ with σ_1=1, σ_2=sgn(W_{12}). Then [σ]W_{UU}[σ] has nonnegative off-diagonals; the 2-player subgame is unsigned (supermodular), hence admits a PNE for all f. Conversely, if W_{12}W_{21}<0, take f=0. Best responses are x_1=sgn(W_{12}x_2), x_2=sgn(W_{21}x_1), i.e., x_1=s_{12}x_2, x_2=s_{21}x_1 with s_{ij}=sgn(W_{ij}). Composition yields x_1=(s_{12}s_{21})x_1, impossible since s_{12}s_{21}=-1. Hence not UPA.\n\nTheorem (Forests with sign-symmetric digons ⇒ PNE). If the underlying undirected graph is a forest and every digon {i,j} with both directions present has sgn(W_{ij})=sgn(W_{ji}), then for any W,h the game admits a PNE.\nProof. In a forest, each SCC is either a singleton or a 2-node digon. Singletons are trivially UPA. A sign-symmetric digon is UPA by the 2-player lemma. The condensation is acyclic; by SCC composition (solve sink to source, treating downstream as external fields), a global PNE exists.\n\nTheorem (Functional SCC UPA ⇔ all directed cycles positive). Let U be an SCC where each i∈U has exactly one out-neighbor in U. Then the subgame on U is UPA iff every directed cycle in U has positive sign product ∏_{(i→j)∈C} sgn(W_{ij})=+1.\nProof (⇒). If some directed cycle C has negative sign product, set f=0. For each i on C, u_i depends only on x_{succ(i)} with coefficient W_{i,succ(i)}. Best response is unique: x_i=sgn(W_{i,succ(i)} x_{succ(i)}). Composing along C yields x_i=(-)x_i, impossible. Thus no PNE for this f; not UPA.\n(⇐). If all cycles are positive, define σ by fixing r∈U with σ_r=1; for any v, let σ_v be the product of sgn(W_{ij}) along any directed path r→…→v. Cycle-positivity implies path-independence. Then [σ]W_{UU}[σ] has nonnegative entries (each unique out-arc in U becomes nonnegative), so the subgame is unsigned; supermodular games admit a PNE for all external f. Hence UPA.\n\nProposition (Structural-balance cycle parity on SCCs). For a strongly connected U, the following are equivalent: (i) ∃σ with [σ]W_{UU}[σ]≥0; (ii) every directed cycle in U has positive sign product. Proof. (i)⇒(ii) by multiplying signs along the cycle; (ii)⇒(i) by the path-product construction above. This yields an O(|U|+|E(U)|) checker.\n\nLemma (Bias-dominates-frustration certificate). For σ∈{±1}^V, define L_i(σ)=σ_i(h_i+∑_j W_{ij}σ_j). If L_i(σ)>0 for all i, then σ is a strict PNE. A sufficient bound: L_i(σ) ≥ σ_i h_i + ∑_{j: sgn(W_{ij})=σ_iσ_j} |W_{ij}| − ∑_{j: sgn(W_{ij})≠σ_iσ_j} |W_{ij}|. If the RHS is >0 for all i, σ is a strict PNE.\n\nTheorem (Uniform guarantee ⇔ DAG). A dependency digraph G guarantees a PNE for every real W supported on G (zero diagonal) and every h iff G is acyclic.\nProof. If acyclic, PNE exists by backward induction along a topological order (constructive BR-path). If G has a directed cycle C, pick h=0 and W nonzero only on C with edge signs having negative product. Then each player on C has a unique best response x_i=sgn(W_{i,succ(i)}x_{succ(i)}), yielding a contradiction. Hence only DAGs guarantee uniformly.\n\nExamples\n\n- Sign-asymmetric digon: W_{12}=1, W_{21}=-1, h=0 yields no PNE (discoordination). Fails the 2-player UPA condition.\n- Forest with sign-symmetric digons: Any underlying tree where every mutual pair has same-sign weights admits a PNE for every W,h (by SCC composition).\n- Functional SCC with a negative cycle: A simple directed cycle with one negative edge (product −1) is not UPA; with f=0, no PNE.\n\nObstacles\n\n- Full characterization of UPA SCCs beyond undirected and structurally balanced remains open. The functional-SCC theorem gives a clean iff within that subclass. General necessary conditions need care because symmetric (potential) SCCs may contain negative-sign cycles yet be UPA.\n\nNext steps\n\n- Implement a polynomial-time pipeline: DAG check; else SCC decomposition; per-SCC: (a) symmetry test (exact potential), (b) structural balance via cycle parity, (c) if functional, apply cycle-positivity test; else fall back to cohesive-core methods or bias-dominance certificates. Construct PNE by reverse topological order when all SCCs pass UPA tests.\n- Explore whether “UPA iff undirected or structurally balanced” holds for strongly connected nonfunctional SCCs; seek counterexamples or a proof via domination on carefully chosen cycles.\n- Integrate indecomposability-based stability (from the paper) once PNE existence is established, to obtain BR-reachable/stable sets when R-cores are cohesive.\n"
}