{
  "summary_md": "Round summary: Identified and constructed graph-level guarantees for pure Nash equilibria (PNE) in binary signed-network coordination (SNC) games. Main classification: a dependency digraph guarantees a PNE for every weight matrix W (zero diagonal on that digraph) and every bias h iff the digraph is acyclic (DAG) — sufficiency by backward induction, necessity via directed cycles with odd negative-product signs that force inconsistent BR constraints. SCC composition: if every SCC is \"universally PNE-admitting\" (UPA) under arbitrary external fields (examples: undirected SCCs or structurally balanced SCCs via a gauge), then solve SCCs from sinks upward to build a global PNE and BR-path. Added UPA tests: 2-node SCCs (W12W21≥0) and functional digraphs (outdegree ≤1) where UPA ⇔ every directed cycle has positive sign. Produced constructive sufficient conditions (cohesive-core bounds, weight-dominance), diagnostics (matching-pennies digons, dominant-negative cycles), and a draft SCC-based algorithmic pipeline. Citations: papers/paper1.txt; Main Results & Proofs (this round).",
  "one_line_summary": "DAGs iff uniform PNE guarantee; SCC/gauge composition and new UPA tests give constructive PNE.",
  "highlights": [
    "Uniform guarantee: dependency digraph guarantees PNE for all W,h ⇔ it is a DAG (backward induction; negative-sign cycle obstructs).",
    "SCC composition: if every SCC is universally PNE-admitting (e.g., undirected or structurally balanced via gauge), a global PNE exists and is BR-reachable by reverse topological assembly.",
    "UPA characterizations added: two-node SCC UPA ⇔ W12·W21≥0 (no matching-pennies digon); functional digraphs UPA ⇔ every directed cycle has positive sign.",
    "Unsigned (W≥0) → supermodular (exists NE, globally BR-reachable); undirected (W symmetric) → exact potential (NE + BR-stable subset).",
    "Sufficient constructive criteria: cohesive-core bounds w_R+τ·h ≥ w_S (or gauge variant) yield consensus/polarized PNE; weight-dominance |h_i|>∑_j|W_ij| gives strict PNE.",
    "Algorithmic pipeline (draft): DAG check → else SCC-decompose → per-SCC gauge/symmetry/functional tests → assemble PNE by reverse order or report obstructions (dominant negative cycles, negative-product cycles)."
  ],
  "next_questions": [
    "Characterize UPA SCCs beyond undirected/structurally-balanced/functional classes (structural/cycle conditions).",
    "Implement and test a polynomial-time checker + PNE-constructor following the SCC/gauge/cohesive pipeline.",
    "Analyze tightness/necessity of cohesive-core and (h^-,h^+)-indecomposability conditions; produce minimal counterexamples."
  ]
}