{
  "progress_md": "Round 0004 — audit, tightenings, and small new results/lemmas\n\nAudit of output.md (gaps and clarifications)\n- Theorem A, item (iii) remark. The proof of non-columnity (for the specific choice |J_0|=1/2) is correct via the component-length obstruction. The parenthetical remark “(iii) can also be deduced from Corollary F by instead choosing |J_0|∉{1/m}” changes the construction (different J_0). That is fine as a variant, but strictly it does not prove (iii) for the J_0 fixed in Theorem A. Suggest: move this to a separate “variant” remark (Theorem A′) where we choose |U|≠1/4 so that |J_0|=2|U|∉{1/m} and appeal directly to Corollary F.\n- Proposition I (“singleton rigidity,” |J_0|=1/2). The step “Similarly, d_n=0 is impossible” tacitly uses that J_1 cannot admit a two-translate partition of S^1. This follows from the assumption on J_0 because E+δ=S^1\\E iff (S^1\\E)+δ=E. Since J_1=(S^1\\J_0)+α is a translate of S^1\\J_0, forbidding J_0 ⊔ (J_0+δ)=S^1 automatically forbids J_1 ⊔ (J_1+δ′)=S^1. Suggest adding this one-line justification explicitly.\n- Lemma E (Boundary obstruction). In output.md it is labeled “As before.” To avoid cross-referencing, I recommend restating the lemma explicitly: if k_min:=min K and μ_min:=|⋃_{i: k_i=k_min}[a_i,b_i]|, then for any finite-column tiling A+T=X×S^1 with p:=min X we must have d_{p−k_min}·μ_min=1 (hence 1/μ_min∈N); similarly at the right boundary with k_max.\n- Endpoint convention is consistently addressed; OK.\n\nNew results and refinements (small, auditable)\n1) Fourier obstruction to two-translate complements (formal statement and proof)\n- Lemma (Fourier two-copy obstruction). Let E⊂S^1 be measurable. If there exists δ with E+δ = S^1\\E a.e., then for every nonzero t∈Z with \\hat{1_E}(t)≠0 we have e^{2\\pi i t δ} = −1. In particular, if \\hat{1_E}(2) and \\hat{1_E}(4) are both nonzero, such a δ cannot exist.\n  Proof. Taking Fourier coefficients in 1_{E+δ}+1_E=1 yields e^{2\\pi i t δ} \\hat{1_E}(t)+\\hat{1_E}(t)=0 for all t≠0, hence the first claim. For t=2 and t=4 this would force e^{4\\pi i δ}=−1 and e^{8\\pi i δ}=−1 simultaneously, which is impossible. ∎\n- Why useful here. This cleanly certifies the “no two-translate” hypothesis in Proposition I for many explicit J_0. For example, if J_0=U∪(U+1/2) with U=[0,c) and c∉Q, then \\hat{1_{J_0}}(2)=2\\hat{1_U}(2)=(e^{4\\pi i c}−1)/(2\\pi i)≠0 and similarly \\hat{1_{J_0}}(4)≠0, hence no δ with J_0+δ=S^1\\J_0 exists. This provides an alternate, short certification for the concrete tiles used in Theorem A (if we take U with irrational length).\n\n2) Boundary obstruction (general K, explicit statement)\n- Lemma (Boundary integrality, general form). Let A=\\bigcup_i\\{k_i\\}×[a_i,b_i], and for each height k define the aggregated layer J_k:=⋃_{i: k_i=k}[a_i,b_i] with μ_k:=|J_k|. Suppose A+T=X×S^1 with X finite and let d_n:=|T_n|. If p:=min X and k_min:=min\\{k_i\\}, then only anchors z=p−k_min can contribute to row p, hence d_{p−k_min}·μ_{k_min}=1. Symmetrically, with q:=max X and k_max:=max\\{k_i\\}, we have d_{q−k_max}·μ_{k_max}=1. In particular, if 1/μ_{k_min}∉N or 1/μ_{k_max}∉N, A is not a column.\n  Proof. Standard localization at the boundary: any anchor z<p−k_min would create coverage below p; any anchor z=p−k with k>k_min would create coverage at row p−(k−k_min)<p. Thus row p is covered solely by d_{p−k_min} disjoint translates of J_{k_min}, forcing the identity. The right boundary is analogous. ∎\n- This subsumes Lemma E and makes the obstruction reusable for arbitrary K (not only {0,1,2}).\n\n3) Classification in the complementary two-layer setting (|J_0|=1/2)\n- Proposition (Increment parameterization under singleton and complementarity). Let A=({0}×J_0)∪({1}×J_1) with J_1=S^1\\(J_0+α) and |J_0|=|J_1|=1/2. Assume J_0 admits no two-translate tiling. Then every tiling A+T=Z×S^1 is singleton per row (Proposition I), and is determined by a sequence (θ_m)_{m∈Z} with the recursion\n  θ_{m}−θ_{m−1} ∈ α + Stab(J_0)  for all m,\n  where Stab(J_0):=\\{t∈S^1: J_0+t=J_0 a.e.\\}. Conversely, any bi-infinite sequence (θ_m) obeying this recursion defines a tiling. In particular, if J_0 has exactly 1/2-periodicity (Stab(J_0)={0,1/2}+Z), the allowable increments are α or α+1/2 independently at each step m.\n  Proof. Proposition I gives |T_m|≡1. Row m’s identity U_m=J_0+θ_m=S^1\\V_m and V_m=J_1+θ_{m−1}=S^1\\(J_0+α+θ_{m−1}) forces J_0+θ_m=J_0+α+θ_{m−1} a.e., hence the increment constraint. Conversely, given any sequence satisfying the constraint, the two sets J_0+θ_m and J_1+θ_{m−1} are complementary in row m, providing a tiling with a.e. disjointness. ∎\n- Why this matters. It shows Theorem A’s complementary construction has a large family of (irreducible) tilings, encompassing the helical tilings T_α and T_{α+1/2} as the constant-increment choices. This also clarifies that demanding a specific period further fixes the increment to be constant.\n\n4) Worked explicit choices ensuring “no two-translate” via Fourier\n- Example. Take U=[0,c) with c=\\sqrt{2}/10. Then J_0:=U∪(U+1/2) has \\hat{1_{J_0}}(2)=2\\hat{1_U}(2)=(e^{4\\pi i c}−1)/(2\\pi i)≠0 and \\hat{1_{J_0}}(4)=2\\hat{1_U}(4)=(e^{8\\pi i c}−1)/(4\\pi i)≠0 (since 2c,4c∉Z). By the Fourier lemma, J_0 admits no δ with J_0+δ=S^1\\J_0. Thus Proposition I applies. Picking any irrational α then produces two irreducible tilings with periods (1,α) and (1,α+1/2), incommensurable by Lemma R.\n\nSmall corrections/caveats to record\n- Proposition H (K={0,1,2} two-order family): the incommensurability clause correctly keeps s rational. Removing that hypothesis can fail (counterexample: β=\\sqrt{2}, s=β/2 gives β/(β−s)=2∈Q).\n- As noted above, J_1 has a two-translate tiling iff J_0 does (since J_1=(S^1\\J_0)+α). This justifies the symmetry step in Proposition I’s proof.\n\nWhy these additions advance the program\n- They provide a compact, verifiable obstruction (Fourier) to the only delicate step in the |J_0|=1/2 regime (ruling out 2-fold partitions), applicable to many explicit U. This simplifies checking Theorem A (iii) concretely.\n- The general boundary lemma is a reusable tool beyond K={0,1,2}, and makes non-column checks almost mechanical for many tiles.\n- The increment-parameterization proposition clarifies the full family of tilings for the complementary construction (in the singleton regime), isolating the exact freedom and showing how the helical tilings sit inside it. This aligns with Corollary J and avoids overclaiming uniqueness.\n\nIdeas to pursue next (auditable targets)\n- Record the Fourier lemma as a formal tool in output.md and apply it to a few concrete U (single-interval U with irrational length, or two-interval U with simple rational endpoints), computing \\hat{1_{J_0}}(2), \\hat{1_{J_0}}(4) explicitly to certify non-columnity in Theorem A.\n- State and prove the boundary integrality lemma (general K) explicitly in output.md and reference it in Proposition H, replacing “As before.”\n- Multi-order extensions beyond K={0,1,2}: using Lemma C, list all σ for ℓ=4 with K={0,1,2,3} and compute the resulting linear constraints; look for simultaneous compatibilities yielding ≥3 distinct slopes, and then apply the boundary lemma to certify non-columnity (e.g., force 1/μ_{k_min}∉N).\n- Quantify incommensurability in the q-phase family: for any irrational α and 0≤j<j′<q, (α+j/q)/(α+j′/q)∉Q by Lemma R; record this explicitly with a short proof in output.md (currently indicated parenthetically under Proposition G).\n\nPotential pitfalls and how we avoid them\n- Overclaiming singleton rigidity for general |J_0|. We restrict singleton rigidity to |J_0|=1/2 with a “no 2-translate” hypothesis (Proposition I). For general |J_0|, the boundary equation can allow patterns like (d_m,d_{m−1})=(1/|J_0|,0); forbidding these requires forbidding m-translate tilings for m=1/|J_0| (Fourier can help), but we do not claim this generally here.\n- Endpoint issues are kept as a standing a.e. convention; all Fourier arguments rely on L^2-coefficients and are stable under null boundary changes.\n\nConcrete checklist for the verifier\n- For the U=[0,\\sqrt{2}/10) example, compute \\hat{1_{J_0}}(2), \\hat{1_{J_0}}(4) explicitly from the single-interval formula and verify they are nonzero; conclude “no two-translate.”\n- Insert the explicit statement/proof of the boundary integrality lemma into output.md; confirm Proposition H cites it correctly.\n- Add the one-line symmetry justification in Proposition I about J_1 and J_0 two-translate equivalence.\n- Optionally, include the increment-parameterization proposition (with its short proof) to make Corollary J’s content explicit as a classification statement in the |J_0|=1/2 complementary case.\n"
}