{
  "summary_md": "Round 0008 produced three complementary prover notes that sharply reduce the remaining computation needed to close the |A|=4 step. New rigorous lemmas (21–23) extract internal S5-induced symmetries: a swap (12) yields central symmetry F(α,α), two internal generators (S3,S4) act on the last three coordinates, and their composition gives the x↔z swap. These symmetries partition {±1}^3 into small orbits and cut each base table to at most four representatives. Practically, the 2+2 vertex‑sign ansatz requires only two decisive membership checks ( (+,−,−) in F(+,+) and in F(+,−) ), or a slightly weaker feasibility check on the realized multiset of pair‑types. The round also produced auditable explicit witnesses: a product‑of‑entries invariant ∏ p_i = sgn(τ) for O5, a certified forbidden triple (++−)∉F(+,−) (τ=(12)(34)), and (−,+,+)∉F(+,+) (τ=(13)). A subtle bookkeeping correction was made: ε alone is not enough—i0 must be tracked via the τ witness (Lemma 20). Next steps are to implement/validate IsO5, run symmetry unit tests, evaluate the decisive entries, and fall back to the tiny 2^6 CSP/backtracking only if needed.",
  "highlights": [
    "Lemmas 21–23 (from prover-01) prove internal symmetries: central symmetry F(α,α), generators S3/S4 on the last three coordinates, and an x↔z swap; these preserve triple‑product and reduce per‑table checks to ≤4 representatives.",
    "For the 2+2 ansatz it suffices (modulo the stated caveats) to test two entries: (+,−,−) in F(+,+) and (+,−,−) in F(+,−); a weaker feasibility selection test is also given if only two permutations are available.",
    "Prover-02 gives a handy invariant for O5: the product of coordinates of any O5 vector equals sgn(τ) for its witness τ — useful for S‑oracle sanity checks.",
    "Two explicit, auditable exclusions found via exact τ witnesses: (++−) ∉ F(+,−) (τ=(12)(34)) and (−,+,+) ∉ F(+,+) (τ=(13)) — these shrink the search space without enumeration.",
    "A bookkeeping correction (prover-03): ε alone is insufficient to certify O5 membership; i0 (=τ(1)) must be tracked when applying Lemma 20 — avoids false positives."
  ],
  "next_questions": [
    "Implement and validate IsO5 (build S via Lemmas 18–19 and Lemma 20); run the unit tests and symmetry checks (S3, S4, x↔z swap, Lemma 21) listed in the notes.",
    "Evaluate the two decisive table entries: (+,−,−) for F(+,+) and for F(+,−). If both hold, apply Prop. 11; otherwise populate the full F(+,+)/F(+,−) (4 representatives each) and run the 2^6 CSP/backtracking fallback.",
    "Confirm the listed ε/i0 pairs appear in S and archive all τ witnesses and the final F‑tables (with symmetry annotations) for reproducibility."
  ]
}