{
  "progress_md": "Status and alignment with task\n- The curated output.md now contains: (i) the output-only bridges (W=0 and W>0), (ii) the read/write simulation with the corrected K = max(2W, R+W), (iii) a 2t-commutativity lemma that localizes influence to B(·,2t), and (iv) a new quiescent bridge (Lemma 8) with the corrected separation K = 2t+1 (or 2t+2W+1) and a proof that respects standard LOCAL round timing. These cover an O(log* n) simulation for output-only and for (W,t)-quiescent Online-LOCAL(t).\n- The remaining open gap is the unrestricted deterministic Online-LOCAL(t) on trees, where idle state accumulation across many arrivals can foil color-phased batching.\n\nGaps or clarifications in output.md (minor and easy to address)\n- Corollary B vs Lemma 8 radii: Corollary B uses K = 2t+2W (no +1), which is correct because it simulates a derived sequential (R,W)-rule via Lemma 5, not batched online windows. Lemma 8 requires +1 since it parallelizes online t-windows per color and must forbid a single edge between active regions. Consider adding a one-sentence remark after Corollary B explaining why there is no +1 there but there is in Lemma 8.\n- Hypotheses of Lemma 8: It may help to restate explicitly that the standard LOCAL round timing is assumed (send based on current state, receive, then update), and that nodes outside the active region do not change their state; hence they cannot forward newly received information in later rounds. This explains the domain-of-dependence argument used in the proof.\n\nNew incremental, testable steps towards closing the unrestricted case on trees\nA) Localized round-elimination for Online-LOCAL(t) on trees (lower-bound route)\n- Goal: Show that sinkless orientation does not admit deterministic Online-LOCAL(t) with constant t on bounded-degree trees. Then, by the tree-LCL classification (Theorem 2.33), any LCL solvable in constant Online-LOCAL(t) lies in the O(1)/Θ(log* n) class, implying the required O(log* n) deterministic LOCAL upper bound.\n- Tool already in output.md: Lemma 7 and Cor. 7.1 localize pre-decision influence to B(e,2t). We leverage this to run a localized node↔edge round-elimination inside a fixed ball.\n- Lemma LB.1 (Node→edge localization). On a Δ-regular tree with an ID-graph H as in Def. 2.16, assume A is a deterministic Online-LOCAL(t) algorithm that solves node-centered edge grabbing for all arrival orders. Fix an edge e = uv and normalize the prefix by Cor. 7.1 so that only B(e,2t) arrives before deciding e. Then there is an edge-centered (t−1/2)-local reduction that determines the orientation of e by exhaustively considering all normalized local arrival orders within B(e,2t) consistent with the fixed ID labels on the ball. Why sound: any two “local witnesses” that would force opposite decisions for e can be extended to global inputs and arrival orders (by pushing all other arrivals past e using Cor. 7.1), contradicting correctness of A.\n- Lemma LB.2 (Iterated elimination). Iterating LB.1 and its converse edge→node step 2t times yields a 0-round edge-centered algorithm tied to an ID-graph labeling, contradicting the ID-graph property (Def. 2.16) as in the classical proof. Hence no deterministic constant-t Online-LOCAL algorithm can solve sinkless orientation on trees.\n- Why checkable: Both lemmas operate entirely inside B(e,2t), a finite object for fixed Δ,t. The “glueability” claim (extending consistent local arrival orders to a global order) is justified by Cor. 7.1 and the tree structure (no cycles) and can be written as a standalone lemma (Normalization-and-extension lemma) for verification.\n\nB) Strengthening the quiescent bridge (positive route)\n- Interface-of-boundary states lemma. In Lemma 8’s proof, one may formalize the dependency as: for v in phase i, the transcript in R_v depends only on the boundary states on ∂R_v at the start of the phase. Because boundary nodes do not change state during the phase and dist(R_v,R_w) ≥ 2 for v≠w of the same color, transcripts in distinct active regions are independent and coincide with any sequential permutation. This lemma can be added as a short formal claim nested in Lemma 8.\n- Special case W=0 on trees: give a tiny sanity example (path, t=1) showing necessity of K=2t+1 by constructing two same-color centers at distance 2t+1=3; an edge between the two radius-1 regions permits one-round coupling if K=2t.\n\nC) Path, t=1 interface program (state-elimination-by-quiescence attempt)\n- Definitions: For a path and t=1, let K(v) be the restriction of already fixed outputs to B(v,2) just before v arrives, after normalizing arrivals via Cor. 7.1. For each neighbor u of v, define Σ(u→v;K) as the set of outgoing 1-round messages u can send to v over all normalized arrival orders within B(v,2) consistent with K.\n- Target (context-invariance on paths): Prove that Σ(u→v;K) depends only on K (not on deeper mutable histories). If true, choose a canonical selector g(K) ∈ Σ(u→v;K) and define a quiescent online rule A′ whose neighbor interfaces are g. This would yield a quiescent Online-LOCAL(1) algorithm equivalent on paths, extendable to trees by branch decomposition, and to general t by replacing radii 1,2 with t,2t.\n- Why auditable: All normalized histories live in the finite ball B(v,2); we can try to either prove invariance or build an explicit LCL counterexample where Σ differs while K is fixed.\n\nSanity checks, tiny examples\n- Necessity of +1 in Lemma 8: On a path, t=1, pick two centers at distance 3. Their B(·,1) balls are disjoint but adjacent; if nodes outside active balls may not change state but still send messages based on (fixed) state, a single cross-edge allows a one-round signal between regions, so K=2t would be unsafe. K=2t+1 forbids such an edge.\n- Consistency of radii across the pipeline: Output-only W-write bridge first derives a sequential rule with R=2t+W, then simulates it with K=max(2W,R+W)=2t+2W (no +1). The +1 appears only in Lemma 8, which batches online windows per color.\n\nWhy this is progress\n- We provide concrete, local lemmas (LB.1–LB.2) that, once formalized, would rule out constant-t Online-LOCAL for the log n-hard class (sinkless orientation), thereby establishing the desired O(log* n) LOCAL upper bound for any LCL solvable in constant Online-LOCAL(t) on bounded-degree trees.\n- We sharpen the quiescent bridge with a boundary-state lemma and sanity examples, reinforcing its correctness and clarifying the role of K.\n- We outline an auditable path/t=1 program to try to compile arbitrary Online-LOCAL into a quiescent one via local interface canonicalization; this has clear success/failure outcomes confined to constant-radius balls.\n\nNext steps (actionable)\n1) Write formal proofs of LB.1 and LB.2 in output.md, including the normalization-and-extension lemma (any local arrival order inside B(e,2t) extends to some global order without altering states inside B(e,t) up to e’s decision time).\n2) Augment Lemma 8 with a brief “boundary-state sufficiency” sub-lemma and add a short remark after Corollary B about why the +1 is unnecessary there but needed in Lemma 8.\n3) Start the path, t=1 interface analysis: (i) define Σ(u→v;K) precisely, (ii) attempt a proof of context-invariance, or (iii) construct a minimal LCL counterexample on a path if invariance fails. Document either outcome.\n4) Double-check all radius constants with toy graphs to prevent off-by-one mistakes (in particular, re-verify K=2t+2W+1 for (W,t)-quiescent and K=max(2W, R+W) for sequential (R,W)-simulation).\n"
}