{
  "feedback_md": "High-level assessment. Both reports push in two complementary directions. The positive route (quiescent bridge) looks clean, and the proposed Phase-locality lemma (your Lemma 10) is exactly the missing invariant to make Lemma 8 watertight. The negative (lower-bound) route via localized round-elimination is promising but still has a substantive gap: the non-conflict (“double grab implies contradiction”) step for Lemma LB.1 is not yet justified under the current problem formalization.\n\nWhat is solid and ready to archive. (i) A strong witness-localization statement at a vertex v (your Lemma 9) is correct and useful; it is essentially a refined form of Corollary 7.1 already in output.md but with explicitly stated items (i)–(iii). The standard proof bubbles v leftward across predecessors at distance > 2t using Lemma 7; this keeps the set of pre-v arrivals inside B(v,2t) unchanged and preserves the state on B(v,t). (ii) The Phase-locality invariant inside a color phase under (W,t)-quiescence is correct. The key is the ≥2 separation between active regions and the standard LOCAL timing (send-from-state, then receive, then update). Nodes outside the union of active regions maintain their state; hence they cannot forward newly received information in later rounds. This yields round-by-round independence of disjoint active regions. These two items can be safely added to output.md.\n\nCritical gap in LB.1 (node→edge step). The proposed “non-conflict via gluing” argument is not valid as stated for the node-form of sinkless orientation (each node chooses an outgoing incident edge). If both endpoints u and v of e have local arrival histories that make them “grab” e in opposite directions, gluing those histories does not contradict correctness: in the node-form problem, both endpoints can choose the same edge (towards each other) without violating the constraint “every node has at least one outgoing edge.” Even in an edge-formulation, online irrevocability typically prevents the later endpoint from overriding the earlier edge orientation, so one needs a proof that the later endpoint is forced into an impossible action, which is not established by the current gluing sketch.\n\nHow to fix LB.1. You have at least three viable options; pick one and formalize carefully:\n- Edge-form LCL with decisive step at the second endpoint: Specify that the orientation of an edge is decided exactly at the arrival of the second endpoint, and this decision is encoded redundantly (or consistently) at both endpoints. Then “double-witness in opposite directions” truly yields a contradiction, because the same global arrival order realizes both local histories up to the decisive step, forcing an impossible edge orientation at the decisive moment.\n- Universal (rather than existential) definition in the elimination step: Define the edge rule so that e is oriented u→v only if all normalized local arrival orders within the ball (consistent with the same boundary) make the node-form algorithm orient e from u to v at the decisive step. This avoids non-uniqueness but makes the induction stronger; you must then show that universal quantification is preserved under the elimination iteration. This mirrors classical round-elimination proofs that work with sets of allowed labels.\n- A normalization-and-extension lemma as a standalone technical tool: Precisely state and prove that any normalized local arrival schedule inside B(e,2t) extends to a global schedule whose transcript inside B(e,t) (up to and including the decisive step for e) is identical. This is necessary in any case; however, it is not sufficient to resolve the non-conflict issue unless one of the above modeling choices is made.\n\nOther actionable cleanups. (i) Add an explicit “boundary-state sufficiency” sub-claim inside Lemma 8 (your Lemma 10) and point out why K = 2t+2W+1 is minimal: dist(R_v,R_w) ≥ 2 is the real invariant. (ii) After Corollary B, add a remark clarifying why no +1 is needed there (we simulate a derived sequential (R,W)-rule with K = max(2W,R+W), not batched online t-windows). (iii) For the path, t=1 interface program, either push towards a proof of context-invariance under added constraints (e.g., output-only or quiescent), or produce a concrete counterexample on paths if unrestricted; in either case, keep the discussion confined to constant-radius balls via the new witness-localization.\n\nBottom line and next steps. I have appended to output.md: (1) Lemma 9 (strong witness-localization at v) with a clean proof, and (2) Claim 8.1 formalizing phase-locality under quiescence within Lemma 8, plus (3) a short remark explaining the +1 discrepancy. For the lower-bound route, before adding LB.1/LB.2 to output.md, please fix the model and non-conflict step as above and write the normalization-and-extension lemma with precise quantifiers and a complete proof. This will make the elimination pipeline auditable end-to-end.",
  "new_notes_md": "Additions (witness localization, phase-locality, and LB pitfalls)\n\n1) Strong witness localization at v (unrestricted Online-LOCAL(t)). Using Lemma 7 (2t-commutativity), one can bubble v leftward across any predecessor u with dist(u,v) > 2t. Performing all such swaps yields an arrival sequence in which every predecessor of v lies in B(v,2t). Moreover, the set of predecessors of v inside B(v,2t) is unchanged, so the arrived subgraph just before v equals the restriction of the original arrived subgraph to B(v,2t). Each swap preserves the state on B(v,t) at v’s arrival; hence the state on B(v,t) when v arrives is identical before and after normalization. This refinement is now recorded as Lemma 9 in output.md.\n\n2) Phase-locality under (W,t)-quiescence. In Lemma 8’s color-phase simulation with K = 2t+2W+1 (so that dist(R_v,R_w) ≥ 2 for R_v = B(v,W+t)), nodes outside R := ⋃ R_v keep their state fixed in the t rounds of the phase. Under standard LOCAL timing (send from current state; receive; update), such nodes cannot forward newly received information in later rounds. Therefore, there is no causal influence along any path that leaves one active region and re-enters another within the same phase. The transcript inside each R_v depends only on the initial boundary states, and the effects of different R_v commute. This is now formalized as Claim 8.1 inside Lemma 8’s proof.\n\n3) Localized round-elimination on trees: modeling choices and a gap. The intended LB.1 (node→edge) step asserts that if both endpoints have local witnesses for opposite orientations of an edge e inside B(e,2t), then one can glue these into a single global execution that contradicts correctness. This is not valid for the node-form of sinkless orientation: both endpoints may “grab” e without violating the constraint that every node has at least one outgoing edge. To proceed, adopt one of:\n- Edge-form LCL with decisive step at the second endpoint, so “double-witness in opposite directions” is a genuine contradiction; or\n- A universal-quantifier version of the elimination step, together with a proof that the universal property is preserved by iteration; and in all cases\n- A precise normalization-and-extension lemma: any normalized local arrival order inside B(e,2t) extends to a global order whose transcript inside B(e,t) (up to the decisive step for e) is preserved.\n\n4) Radius sanity. The +1 in K = 2t+2W+1 (for quiescent batching) is necessary to guarantee dist(R_v,R_w) ≥ 2 and exclude one-round coupling across a single cross-edge. In contrast, in Corollary B we simulate a derived sequential (R,W)-rule and only require K = max(2W, R+W) (no +1).\n\nNext steps (crisp):\n- Prove the normalization-and-extension lemma for balls B(e,2t) on trees.\n- Fix the problem model for the LB route (edge-form with a decisive step, or a universal-quantifier variant) and re-state LB.1/LB.2 accordingly; then supply complete proofs.\n- Continue the path, t=1 interface study under quiescence or output-only; either prove context-invariance or give a counterexample LCL confined to B(v,2).\n",
  "new_notes_append": "True",
  "new_outputs_md": "Lemma 9 (Strong witness-localization at a vertex)\nStatement. Let A be any deterministic Online-LOCAL(t) algorithm on a bounded-degree graph G, let σ be any arrival sequence, and let v be any vertex. There exists an arrival sequence σ_v obtained from σ by repeatedly swapping adjacent arrivals such that:\n(i) Every vertex that arrives before v in σ_v lies in B(v,2t).\n(ii) The arrived subgraph just before v arrives in σ_v equals the restriction to B(v,2t) of the arrived subgraph just before v arrives in σ (i.e., the set of predecessors of v inside B(v,2t) is unchanged).\n(iii) The entire state and the fixed outputs on B(v,t) at the moment v arrives are identical under σ and under σ_v.\n\nProof. Starting from σ, repeatedly swap v with its immediate predecessor u whenever dist(u,v) > 2t. Each such swap is between two consecutive arrivals u and v whose t-neighborhoods are disjoint; by Lemma 7 (2t-commutativity), the global state after these two steps is identical independent of their order. After no more such swaps are possible, every predecessor of v has distance ≤ 2t from v, proving (i). During this process, we swap v only with vertices at distance > 2t, so the set of predecessors of v within B(v,2t) is unchanged, and therefore the arrived subgraph in B(v,2t) just before v is the same as in σ; this is (ii). Property (iii) follows because each swap preserves the state on B(v,t) (by Lemma 7), and hence the state on B(v,t) at the time v arrives is invariant under the sequence of swaps. □\n\nClaim 8.1 (Phase-locality under (W,t)-quiescence; to be used within Lemma 8).\nFix a proper coloring φ of G^{K} with K = 2t+2W+1 and consider phase i of the simulation in Lemma 8, where all vertices v with φ(v)=i “arrive” simultaneously and we run t synchronous LOCAL rounds on the subgraph induced by colors ≤ i. For each such v, let R_v = B(v, W+t). Then, during phase i:\n(a) Only nodes in R := ⋃_{φ(v)=i} R_v may change state; nodes outside R keep their state fixed throughout the phase.\n(b) For each v, the t-round transcript (states and messages) on R_v depends only on A and on the initial states on R_v together with the states on the external neighborhood ∂R_v at the start of the phase (i.e., after phase i−1), and is identical to the transcript obtained by executing only v’s t-round window in isolation with those boundary states.\n(c) The combined effect of the phase equals the composition, in any order, of the individual arrival windows of the vertices with φ(v)=i.\n\nProof. Because φ is a proper coloring of G^{K} with K = 2t+2W+1, any distinct same-color vertices v,w satisfy dist(v,w) ≥ K+1, hence dist(R_v,R_w) ≥ (K+1) − 2(W+t) = 2; in particular, there is no edge between R_v and R_w. By (W,t)-quiescence, during the t rounds of the phase only nodes within distance ≤ t of B(v,W) for some v with φ(v)=i may change state; the union of these sets is precisely R, proving (a). Under the standard LOCAL timing (in each round: send based only on the current state; then receive; then update), a node whose state does not change in a given round cannot make its outgoing messages depend on newly received information in later rounds unless its state changes; thus nodes outside R cannot relay any information originating in one active region to another during the phase. An induction on the round counter r=1,…,t shows that the state/message evolution on each R_v is identical to the evolution when executing only v’s t-round window with the same boundary states (states on ∂R_v are fixed by (a)), establishing (b). Since there is no causal influence between distinct active regions within the phase and no edge between them, the per-region effects commute, yielding (c). □\n\nRemark (Why no +1 in Corollary B but +1 in Lemma 8). In Corollary B we first derive a sequential (R,W)-rule with R = 2t+W from the output-only online algorithm, and then simulate this sequential rule using a proper coloring of G^{K} with K = max(2W, R+W). This simulation does not execute concurrent online t-windows; independence is guaranteed by avoiding read–write and write–write conflicts for the sequential rule, and no extra +1 is needed. In contrast, Lemma 8 batches online t-windows of the same color in parallel; to prevent even a single cross-edge between distinct active regions during the t rounds, we require dist(R_v,R_w) ≥ 2, which is ensured by K = 2t+2W+1 (the +1 is necessary).",
  "new_outputs_append": "True",
  "verdict": "partial success"
}