{
  "content": "# Ideas\n\n- Clarify the target notion: Here PE means global Pareto-efficiency (no allocation Pareto-dominates it), not “PE within the reachable set.” This differs from the notion studied in Gourvès–Lesca–Wilczynski and follow-ups, where Pareto-efficiency is taken relative to the reachable set. For trees, that latter problem remains open. We attack the global PE version (TREE-REACHABLE-PE).\n- Key observation: Any allocation reachable via a sequence of allowed swaps (each swap strictly benefits both endpoints of an edge) is individually rational (IR) relative to the initial endowment. Hence, if a reachable globally PE allocation exists, it must be IR+PE.\n- Classical (Shapley–Scarf) market fact with strict preferences: The TTC (Top Trading Cycles) allocation is the unique allocation that is both IR and globally PE.\n  - Consequence: TREE-REACHABLE-PE reduces to testing whether the TTC allocation is reachable from the initial endowment by edge-adjacent improving swaps on the given tree.\n  - On trees, the Reachable Matching decision problem is polynomial-time solvable (Gourvès–Lesca–Wilczynski): given a target matching, decide if it is reachable from the initial matching by allowed swaps along tree edges.\n\n# Claims and Proof Sketches\n\nClaim 1 (Reachable ⇒ IR). Any allocation obtained by a finite sequence of allowed swaps is individually rational with respect to the initial endowment.\n- Proof. Let the sequence of matchings be µ0 → µ1 → ··· → µk, with µ0 the initial endowment. By definition of allowed swap, at step t only the two swapped agents strictly improve, and all others keep their object. Hence for each agent a, the sequence (µt(a))t is nondecreasing in a’s preference order; if a ever swaps it strictly increases, otherwise it stays at its endowment. Therefore µk(a) is weakly preferred to µ0(a) for every agent a.\n\nClaim 2 (Uniqueness of IR+PE). In the Shapley–Scarf housing market with strict preferences, the TTC allocation µTTC is the unique allocation that is both individually rational and globally Pareto-efficient.\n- Remarks/justification. This is standard: TTC produces a core allocation; with strict preferences the core is a singleton (Shapley–Scarf). Core allocations are IR, and (global) Pareto-efficient. Conversely, any allocation that is both IR and (globally) Pareto-efficient must be in the core; otherwise a blocking coalition using its initial endowments would induce a Pareto-improvement, contradicting global PE. Hence IR+PE ⇔ core ⇔ TTC. (This equivalence is classical; the verifier may insert a formal citation, or we can supply a short inductive TTC-based proof on request.)\n\nCorollary (Reduction). A reachable globally Pareto-efficient allocation exists if and only if the TTC allocation is reachable by allowed swaps from the initial matching. In that case, it is the only such allocation.\n\nClaim 3 (Reachable Matching on trees is poly-time). Given a tree T, an initial matching µ, and a target matching µ∗, deciding if µ∗ is reachable via allowed swaps is solvable in O(n^2) time (cf. Gourvès–Lesca–Wilczynski). A constructive proof uses “good edges”: edges whose endpoints need to cross next on their dipaths towards µ∗; at least one exists unless the current state already equals µ∗, and performing a swap on any good edge monotonically advances all agents along their dipaths. Maintaining the set of good edges yields an O(n^2) procedure and a witness sequence of swaps when reachable.\n\n# Main Algorithm (TREE-REACHABLE-PE on trees)\n\nInput: Tree T = (V,E), strict preferences (≻v)v∈V over objects, and initial endowment µ0 (agent v holds hv).\n\nOutput: Either a reachable globally Pareto-efficient allocation (and a swap sequence) or report “none.”\n\nSteps:\n1) Compute the TTC allocation µTTC for the housing market instance (V, {hv}, (≻v)). This takes O(n^2).\n2) Run the tree Reachable Matching routine with target µTTC. If it returns “reachable,” output the corresponding sequence of allowed swaps along E; the resulting allocation is reachable and globally PE (by Claim 2). If it returns “not reachable,” report “none exists.”\n\nCorrectness:\n- By Claim 2, any reachable globally PE allocation must equal µTTC.\n- By Claim 1, any reachable allocation is IR; thus if any reachable globally PE allocation exists, it is IR+PE, hence equals µTTC.\n- Therefore existence reduces to reachability of µTTC, decided correctly by Step 2.\n\nComplexity:\n- TTC: O(n^2). Tree reachability to a fixed target: O(n^2). Overall O(n^2), and we obtain an explicit swap sequence when it exists.\n\n# Example Check\n\nGiven the sample star around B with preferences from the prompt, TTC yields everyone’s top choice among endowments (the final matching A:d, B:a, C:b, D:c). The tree-reachability procedure (good-edge swaps) recovers the witnessed sequence (B,C), (B,D), (B,A). As predicted, the outcome is reachable and globally PE.\n\n# Obstacles and Clarifications\n\n- Distinguish carefully from the open problem in the literature: Gourvès–Lesca–Wilczynski (object-moving model) analyze “Pareto-efficiency within the reachable set.” For trees (and generalized stars), the complexity of finding a reachable allocation that is Pareto-efficient relative to the reachable set remains open. Our target here is global PE, which collapses to reachability of TTC by the IR+PE uniqueness.\n- Strict preferences are crucial; with ties, TTC need not be unique and the IR+PE characterization changes.\n- For general graphs (not trees), Reachable Matching is NP-hard; our reduction to reachability of TTC then yields NP-hardness of TREE-REACHABLE-PE in general networks.\n\n# Next Steps (Auditable)\n\n- Provide a compact, self-contained proof (to go into proofs.md) that in Shapley–Scarf with strict preferences, IR+PE allocations coincide with the core (and hence TTC). Alternatively, insert standard citations (Shapley–Scarf 1974; Roth–Postlewaite 1977) for the verifier.\n- Implement small-instance enumeration (n ≤ 6) to empirically validate the “TTC dominates all IR” heuristic: enumerate all IR allocations, check that TTC Pareto-dominates each; this gives further evidence for Claim 2 if a full proof is deferred.\n- Integrate a polished version of the O(n^2) “good edges” reachability algorithm for trees (with explicit invariant and termination measure) into proofs.md.\n\n# Summary\n\n- Any reachable allocation is IR.\n- In housing markets with strict preferences, IR+PE allocations are exactly the (unique) TTC outcome.\n- Therefore, TREE-REACHABLE-PE on trees is decidable in O(n^2) time: compute µTTC and check reachability on the tree. If reachable, output the swap sequence; else, report none exists.\n"
}