{
  "content": "# Ideas\n\n- Clarify the exact decision problem: TREE-REACHABLE-PE asks whether there exists a matching µ that is (i) reachable from the initial endowment via a finite sequence of allowed adjacent swaps (each swap strictly improves both participants), and (ii) globally Pareto-efficient (no allocation Pareto-dominates µ among all allocations).\n- This is strictly stronger than the “Pareto-efficient w.r.t. the reachable set” problem studied by Gourvès–Lesca–Wilczynski (object-moving model). Their trees/generalized stars case is open; our variant is a priori at least as hard.\n- Make basic complexity placements and give small positive/negative results that can be checked by the verifier. In particular: membership in NP; explicit counterexample that shows the answer can be “No”; simple sufficient-condition algorithm via TTC; tractable special case (stars) by a check on the unique reachable sink produced by a standard greedy.\n\n# Definitions\n\n- Model: Object-moving model on a tree T = (V,E). One agent at each vertex v ∈ V initially holds object h_v. Preferences ≻_v over objects are strict. A swap is allowed only on an edge {u,w} if both u and w strictly prefer what they receive.\n- Reachability: µ is reachable if attainable by a finite sequence of allowed swaps from the initial allocation.\n- Globally Pareto-efficient (PO): no allocation Pareto-dominates µ (no alternative allocation that makes every agent weakly better and at least one strictly better).\n- Problem (TREE-REACHABLE-PE): Given (T, initial endowment, preferences), decide whether there exists a matching µ that is both reachable and globally PO; produce such a µ if it exists.\n\n# Results and Proofs\n\nProposition 1 (Membership in NP). TREE-REACHABLE-PE is in NP.\n\nProof. A succinct certificate is a target matching µ. Verification is polynomial:\n- Global Pareto-optimality can be checked in O(n^2): build the directed graph on agents with an arc i → j if i prefers µ(j) to µ(i). It is folklore (and easy to verify) that µ is PO iff this digraph is acyclic (a directed cycle yields a strictly improving trading cycle; conversely, no cycle implies no Pareto-improving reallocation).\n- Reachability of a given µ from the initial endowment on a tree can be checked in polynomial time (O(n^2)) by the known “good-edge” algorithm for Reachable Matching on trees; see Gourvès–Lesca–Wilczynski (2017) or the proof sketch reproduced in Section 7.1 of the provided paper. Hence the certificate is verifiable in polytime. ∎\n\nProposition 2 (A small “No” instance on a path). There exist path instances where no globally PO allocation is reachable.\n\nExample. Path A—B—C with initial endowment (A:a, B:b, C:c) and preferences\n- A: b ≻ a ≻ c\n- B: c ≻ b ≻ a\n- C: a ≻ c ≻ b.\nThe unique globally PO allocation is (A:b, B:c, C:a) (the 3-cycle). However, initially no adjacent swap is allowed: (A,B) is not allowed because B would receive a which B dislikes; (B,C) is not allowed because C would receive b which C dislikes. Thus the initial matching is a local sink of the swap dynamics but not globally PO. Therefore the answer to TREE-REACHABLE-PE is “No.” ∎\n\nObservation 3 (A necessary condition). Any globally PO matching has no “blocking edge”: for every edge {u,w}, it cannot be that u prefers the object of w and w prefers the object of u. (Otherwise, the two-agent cycle contradicts global PO.) Thus any reachable globally PO must be a sink (no allowed swap).\n\nProposition 4 (Simple sufficient-condition algorithm). If the (unique) TTC outcome µ_TTC is reachable, then µ_TTC is a valid YES-witness. This yields a polynomial-time one-sided test: compute µ_TTC (O(n^2)) and check its reachability on the tree (O(n^2)); if reachable, output it.\n\nRemark: This test is incomplete (there are globally PO matchings other than TTC), but whenever it succeeds it gives a correct certificate.\n\nTheorem 5 (Stars: polynomial-time decision). On stars, TREE-REACHABLE-PE is solvable in O(n^2) time; a candidate can be produced in O(n), then checked in O(n^2).\n\nProof (sketch). On stars, the swap dynamics always terminate and, from a given initial endowment, the standard greedy “serial dictatorship at the center” (pruning leaves that do not want the center, then repeatedly swapping the current center with the best compatible leaf) computes a sink allocation σ (Section 7.2.2 of the provided paper). From any state, a globally PO reachable matching must be a sink (Observation 3); thus if any reachable globally PO exists, it must equal some sink reachable from the initial state. On stars, every maximal sequence of allowed swaps reaches the same sink σ (the proof is standard: once a leaf moves to the center it never moves again, and any deviation can be commuted with the greedy choice without invalidating feasibility). Therefore the decision reduces to: compute σ in O(n), then test in O(n^2) whether σ is globally PO via the directed-cycle test. If yes, return σ; if not, answer “No.” ∎\n\nRemark. The example in Proposition 2 (with B as center) shows that the answer can be “No” on a star; the algorithm detects it by rejecting σ.\n\n# Obstacles\n\n- For general trees (beyond stars/paths), the literature already leaves open the easier problem of computing a matching that is PO within the reachable set (object-moving model). Our problem asks for global PO; it is at least as hard. A full polynomial-time algorithm (or hardness) is currently out of reach.\n- Even on paths, reachable sinks need not be globally PO (Prop. 2). Moreover, different swap orders can lead to different sinks in general trees, so naively checking a single sink is not enough.\n\n# Next steps (concrete, testable)\n\n1) NP-hardness attempt via reduction from Reachable Object on trees (known NP-complete). Sketch: Given (a,b), build a tree gadget so that a reachable matching is globally PO iff agent a ends up with b. The core is to force every global improvement cycle to involve the (a,b) channel; the verifier can test small gadgets with 3–5 agents per edge.\n\n2) Stronger sufficient conditions: characterize when µ_TTC is reachable on trees (beyond generic reachability checking). For example, identify local “orientation” conditions on edges that guarantee the existence of a good-edge elimination sequence to µ_TTC.\n\n3) Fixed-parameter tractability. For trees with a bounded number of branch nodes (degree ≥ 3), try a dynamic program that combines star-solutions along the backbone and filters by the global PO test. Caterpillars with constant-length spine look amenable: enumerate O(n^p) backbone assignments for constant p, solve the attached stars locally, check PO and reachability.\n\n4) Empirical counterexamples. Systematically search small trees (n ≤ 6) to catalog when a globally PO reachable matching exists. This can guide gadget design for hardness reductions or suggest structural lemmas.\n\n# Summary\n\n- TREE-REACHABLE-PE is in NP (certificate = target matching; verify global PO and tree-reachability in polytime).\n- The answer can be “No” (explicit 3-agent path/star example).\n- A simple sufficient-condition test via TTC reachability runs in O(n^2).\n- On stars, the problem is solvable in O(n^2) (compute the unique reachable sink, then check global PO).\n- For general trees, complexity remains open; we outlined reduction and DP directions to pursue next."
}