{
  "summary_md": "Round summary — main progress and open pivot.\n- Problem: TREE-REACHABLE-PE (given a tree, initial endowment and strict preferences, decide/produce a reachable allocation that is globally Pareto-efficient).\n- Proven/implemented: reachable allocations are individually rational; reachability to any fixed target on a tree is decidable in O(n^2) via good-edge scheduling; global Pareto-efficiency (PO) can be checked in O(n^2) by the improvement-digraph (no directed cycle). Hence TREE-REACHABLE-PE ∈ NP (certificate = target allocation). TTC (Top Trading Cycles) is globally PO and thus serves as a one-sided polynomial-time certificate: compute TTC and test tree-reachability.\n- Algorithmic/complexity landscape recorded: Reachable Object and PE on paths (O(n^2)), PE on generalized stars (O(n^2 log n) in the agent-moving model), reachable matching on trees (O(n^2)). NP-completeness / NP-hardness: Reachable Object on cliques NP-complete; Reachable Matching on cliques NP-complete; PE on cliques NP-hard (reductions from 2P1N-SAT).\n- Crucial open pivot: whether every IR + global-PO allocation must equal the TTC outcome. If true, TREE-REACHABLE-PE reduces to checking TTC reachability (polytime); if false, the general tree case remains open.\n\nCitations: papers/paper1.txt (Li, Plaxton, Sinha, arXiv:2103.01394); Research notes (round X).",
  "one_line_summary": "TREE-REACHABLE-PE ∈ NP; TTC reachability suffices if TTC is the unique IR+PO outcome; uniqueness unresolved.",
  "highlights": [
    "TREE-REACHABLE-PE is in NP: verify reachability (O(n^2)) + global PO (O(n^2)).",
    "Any reachable allocation is individually rational (IR).",
    "Fixed-target reachability on trees decidable in O(n^2) (good-edge scheduler).",
    "Global PO test via improvement-digraph (no directed cycle) — O(n^2).",
    "TTC is globally PO and provides a one-sided poly-time certificate (if reachable, return TTC).",
    "Algorithms/hardness: PE/Reachable-Object on paths O(n^2); PE on generalized stars O(n^2 log n); Reachable/PE on cliques NP-hard/complete as shown."
  ],
  "next_questions": [
    "Prove or find a counterexample to the key pivot: does IR + global-PO imply the TTC allocation on trees?",
    "If pivot fails, search small n (exhaustive up to n≤6–8) for IR+PO ≠ TTC and/or implement the FPT treewidth DP to decide TREE-REACHABLE-PE."
  ]
}