{
  "progress_md": "Round 0005 — Parametric, radius-1 rule schemas (directional tokens adopted), B=2 instantiation blueprint, and finite-length canonical contexts\n\nContext and objective\n- We continue the NEXPTIME-hardness program via Succinct 3-Coloring (S3Col) by finalizing DP-auditable, radius-1 rule schemas for: (i) deterministic per-bit boundary probes that separate 2^B canonical vertex types; (ii) per-side color gating; (iii) seam activation via directional tokens Tok→/Tok← with a local verdict enforcing simultaneously EDGE and Eq; and (iv) a bridging policy that either vacuously holds (inactive/mixed) or reduces to the same local seam constraints regardless of repetition z. We also provide a B=2 symbol list and explicit Cout–out fragments sufficient for a DP check.\n- Minor gaps to output.md: (1) Please add a parenthetical note that types E_w(a) are computed with respect to fixed interior inputs (our PORT.RIDbit copies the fixed Σ_in). (2) When feasible functions are used, it helps to define the context set C explicitly as those types realized by w_1 S w_2 with |w_i| ∈ {ℓ_pump, ℓ_pump+1}; hence |C| ≤ ℓ_pump. (We do not edit output.md, only flagging these clarifications.)\n\nA) Per-bit probe (Type-Separation) — explicit radius-1 rules (deterministic, no escape)\nSymbols/tracks used (folded via disjoint roles; sizes add):\n- Roles: {PAD, HEAD, PORT, PROBE, RUN, VERD, ERR, S} × Phase∈[c0] (constant c0).\n- PORT subtracks: Addr∈{1,…,B}, RIDbit∈{0,1}.\n- Probe states per j∈[B]: Start_j, Head_j, Test_j, Accept_j (role=PROBE).\n- Boundary outputs: For the 4 boundary positions, reserve B 4-tuples Q_j. We refer to the second-from-left boundary output as BL2_j for injection.\n- Cin–out: PORT cells have (input b, output RIDbit=b) allowed for b∈{0,1}. Non-PORT roles ignore RIDbit in Cin–out; ERR and PAD accept any input (standard).\n- PORT well-formedness and contiguity: Allowed PORT–PORT Cout–out pairs on interior edges are exactly (P(k,·) → P(k+1,·)) for k=1,…,B−1; no other PORT adjacency allowed. The unique PORT block abuts S.\nCout–out rules (parametric in j):\n- Injection: (BL2_j → Start_j) is the only allowed successor from BL2_j.\n- March: For any non-PORT y, allow (Head_j → Head_j at y); forbid any pairs from {Start_j,Head_j,Test_j,Accept_j} to ERR or to ⊥.\n- At PORT(k,b):\n  • If k≠j: allow (Head_j(prev) → Head_j(curr)), no other successor.\n  • If k=j and b=1: allow (Head_j(prev) → Test_j(curr)), then (Test_j → Accept_j) to the next cell.\n  • If k=j and b=0: no successor listed from Head_j; dead-ends.\n- Accept exit: (Accept_j → PAD) followed by PAD self-plumbing.\nType-Separation claim TS (re-stated, DP-checkable): Fix boundary inputs a⋆. For any canonical left block L(u) with PORT adjacent to S, E_{L(u)}(a⋆)[Q_j] = u_j. Proof sketch: under Q_j, the only legal continuation is the deterministic chain above; it reaches PORT(j, u_j) and continues iff u_j=1; Cin–out ties RIDbit to the input bit. ERR/⊥ are disallowed near PROBE, eliminating alternative completions. Symmetric right probe gives 2^B right-types.\nAlphabet/adjacency budget: PROBE contributes O(B) symbols, PORT contributes O(B), reserved boundary outputs contribute O(B). The adjacency table needs O(B^2) pairs for (Head_j ↔ PORT(k,·)); others are O(1). With disjoint roles, |Σ_out| = Θ(B) and |Cout–out| = O(B^2) + O(β), feasible with β = s^{c1} and B = s^{c0}, c1 ≥ 2c0.\n\nB) Per-side color gating and directional-token seam activation (mixed pairs accept)\nSymbols/tracks:\n- S colors: {S_R, S_G, S_B, S_⊥} (role=S). Only the color field is under f; all other subtracks derive from neighbors.\n- Gate tokens at the interior neighbor of S: GateL (left side canonical), GateR (right side canonical). If absent, neighbor is neutral PAD.\n- Directional tokens on the corridor: Tok→, Tok← ∈ {0,1} carried by RUN/PAD/VERD cells across the bridge wb∘wc. Tokens propagate deterministically; see rules below.\nPer-side gating (purely local):\n- If S’s interior neighbor is Gate•, S may be in {S_R,S_G,S_B,S_⊥}; otherwise S must be S_⊥ (only S_⊥-adjacency pairs are listed to neutral neighbors).\nToken seeding (only when the side is canonical and colored):\n- If (GateL ↔ S_x) with x∈{R,G,B}, the first corridor cell to the right of S1 is forced to Tok→=1 (a special Seed→ state). If S1=S_⊥, no seeding: Tok→=0.\n- Analogously, if (S2_x ↔ GateR) with x∈{R,G,B}, the first corridor cell to the left of S2 is forced to Tok←=1 (Seed←); else Tok←=0.\nToken propagation (radius-1):\n- Along the corridor toward the opposite end, for any consecutive interior edge i→i+1, allowed pairs enforce: Tok→(i)=1 ⇒ Tok→(i+1)=1; Tok←(i+1)=1 ⇒ Tok←(i)=1. (Implement by restricting allowed symbol pairs to those with nonincreasing zeros, i.e., once 1 is present it persists; in practice, corridor symbols carry both bits, and Cout–out allows only pairs with Tok→ nondecreasing left→right and Tok← nondecreasing right→left.) Outside the corridor, tokens are implicitly 0 (no symbols with tokens permitted).\nMust-color and mixed-pair fallback (enforced at S by inspecting opposite token on its neighbor):\n- Let N1 be S1’s interior neighbor; if Tok→(N1)=0, any S1∈{S_R,S_G,S_B,S_⊥} may attach to neutral neighbors; if Tok→(N1)=1 (which occurs only when the right side is canonical and colored), then S1≠S_⊥ is required and the neighbor must be the designated FWD cell (see below). Symmetrically at S2 using Tok←.\n- Consequently, mixed pairs (exactly one side canonical/colored) have no opposite-direction token locally; colored S on the canonical side attaches to a neutral neighbor; the inactive side is S_⊥; PAD plumbing accepts unconditionally. No seam tableau runs.\n\nC) Seam RUN tableau and local verdict (EDGE and Eq simultaneously)\nCorridor layout near S:\n- FWD cell immediately right of S1: records FwdColor ∈ {R,G,B} equal to S1; allowed pairings: (S1_x ↔ FWD(FwdColor=x)) only; if Tok→(FWD)=0, neutral pairs to PAD are also allowed; if Tok→=1, only the FWD pairing is allowed (must-color enforced).\n- VERD cell immediately left of S2: symbol Ver(FwdColor∈{R,G,B}, EDGE∈{0,1}, Eq∈{0,1}).\nRUN tableau enablement:\n- RUN-role symbols (row-by-row U-simulation) are permitted on the corridor only when (Tok→=1 and Tok←=1) on those cells; else only PAD is permitted. ERR is globally available but explicitly disallowed adjacent to RUN/VERD when any token bit is 1 (no escape in active modes).\nU’s task (constant alphabet): read enc(D) in HEAD; read u from left PORT and v from right PORT; compute EDGE=D(u,v) and Eq=[u=v] in poly(s) steps. The last row writes Ver(FwdColor,EDGE,Eq) into the VERD cell next to S2; FwdColor is copied unaltered from the FWD cell via a constant-width forwarder track (enforced by local equalities).\nLocal verdict at S2–VERD edge (radius-1 adjacency list):\n- For each c∈{R,G,B} and bits e,q∈{0,1}, allowed pairs (S2_col, Ver(FwdColor=c,EDGE=e,Eq=q)) are:\n  • If q=1: allow only when S2_col = c (forces equality on u=v). If additionally e=1, this case is unreachable because we ensure D(u,u)=0 in preprocessing (or the seam would be contradictory). If e=0, equality holds; allowed.\n  • If q=0 and e=1: allow only when S2_col ≠ c (forces inequality on edges).\n  • If q=0 and e=0: allow all 3×3 color combinations.\n- Must-color at S2: If Tok←(VERD)=1, forbid S2_⊥; otherwise S2_⊥ is allowed (mixed/inactive pairs).\nCorrectness (active-active): Acceptance iff (EDGE=0 or colors differ) and (Eq=0 or colors equal). Mixed/inactive: tokens absent locally; neutral plumbing accepts unconditionally.\n\nD) Bridging (F2) is vacuous or reduces to local seam\n- For inactive/mixed contexts: S choices are either ⊥ (inactive) or unrestricted on the canonical side with PAD neighbors (mixed); repetitions w_i^z away from S are filled by PAD/⊥ self-loops; Cout–out includes PAD–PAD self-transitions for every interior edge type; thus wz_1 S wz_2 always extends independently of z.\n- For active-active canonical pairs: all constraints are confined to the immediate corridor around S (FWD, RUN rows, and VERD), which has constant width; repeating w_i does not create new constraints across S and does not affect U’s computation (it reads PORTs adjacent to S). Hence feasibility for z=1 implies feasibility for all z ≥ 1. Formally, by Lemma 1 in output.md (periodicity), we may check z up to Z, but here local wiring already makes the outcome z-invariant.\n\nE) B=2 concrete instance (DP-auditable)\nSymbols to enumerate (suggested names):\n- S: S_R, S_G, S_B, S_⊥.\n- PORT: P1^0,P1^1,P2^0,P2^1.\n- PROBE: Start_1,Head_1,Test_1,Accept_1; Start_2,Head_2,Test_2,Accept_2.\n- Boundary outputs: Q_1, Q_2; we treat BL2_1 and BL2_2 as the left second boundary outputs selecting Start_j.\n- Gating: GateL, GateR; otherwise PAD.\n- Corridor bits: tokens Tok→/Tok← ∈ {0,1} carried in symbol variants (we can realize four variants of PAD and RUN cells to encode the two bits; only those pairs consistent with monotone propagation are listed).\n- RUN: a tiny fixed alphabet sufficient to tabulate D on {00,01,10,11} and Eq=[u=v].\n- VERD: Ver(c∈{R,G,B}, e∈{0,1}, q∈{0,1}).\nCin–out (B=2): Allow PORT b-outputs matching the input bit b; all other roles accept any input bit (copy-through or don’t-care). Optionally, forbid ROLE=PORT unless the HEAD/PORT header is present (enforced by Cout–out grammar between HEAD and PORT).\nCout–out key fragments (B=2):\n- Probes: as in A, instantiate k∈{1,2} and j∈{1,2}. Enumerate (Head_j ↔ Port^P(k,·)) march, (Port^P(k≠j,·) → Head_j), (Port^P(j,1) → Test_j → Accept_j), and no successor on (Port^P(j,0) → ·). No ERR/⊥ adjacent to Start/Head/Test/Accept.\n- Gating at S: (GateL ↔ S_color) for color∈{R,G,B,⊥}; (¬GateL ↔ S_⊥) only. Same on the right with GateR.\n- Tokens: (GateL ↔ S_color) forces Seed→(Tok→=1) on the next interior cell; otherwise Tok→=0. Enforce Tok→ nondecreasing left→right and Tok← nondecreasing right→left by allowing only corridor pairs (x,y) with y.Tok→ ≥ x.Tok→ and x.Tok← ≥ y.Tok←.\n- Must-color at S: If N1.Tok→=1 then forbid (S1=⊥ ↔ N1); also require (S1 ↔ FWD) pairing; symmetrically if N2.Tok←=1 require (S2 ↔ VERD).\n- RUN enablement: Only when both token bits are 1 on corridor cells are RUN-row symbols permitted (else PAD). ERR adjacent to RUN or VERD is forbidden in this mode.\n- Verdict adjacency: Explicitly list allowed pairs (S2_col ↔ Ver(c,e,q)) following the cases in C.\nDP audit checks:\n1) Probe: Four left seeds L(00),L(01),L(10),L(11) with contiguous PORT zone next to S. For each u, and boundary outputs Q_1,Q_2 under fixed a⋆, the DP should yield E(u)[Q_1]=u_1 and E(u)[Q_2]=u_2.\n2) Seam: Take D as a 4-cycle on {00,01,10,11} and Eq by equality. Build right seeds R(v). For all 16 ordered pairs (L(u),R(v)), the DP should accept iff (u=v ⇒ colors equal) and (D(u,v)=1 ⇒ colors differ). Mixed pairs (canonical on one side only) accept regardless, with S on inactive side = ⊥.\n\nF) Existence of canonical contexts at lengths ℓ_pump or ℓ_pump+1 (specialized padding lemma)\nLemma CN (canonical contexts exist with prescribed side-length parity). For each index u∈{0,1}^B there is at least one left word w_1 of length in {ℓ_pump, ℓ_pump+1} whose suffix adjacent to S is a well-formed canonical block W_L(u) (HEAD · PORT(B) · RUN prefix) and PAD elsewhere; likewise for right contexts.\n- Proof sketch (uses output.md Lemmas 11–12, 14–15): Start from a seed word U_L(u) = PAD^z · W_L(u) with z≫1 chosen so that Type(PAD^z) stabilizes and replacing PAD^z by any PAD^{z′} with the same type preserves the type of U_L(u). By Lemma 15 (periodicity), select z′ so that |PAD^{z′} · W_L(u)| hits ℓ_pump or ℓ_pump+1. All pumping/replacement happens in PAD outside the seam, so the HEAD/PORT layout and probe/seam interfaces are unaffected. Symmetric for the right.\n\nG) Why (F1)⇔3-coloring and why (F2) imposes no extra burden\n- Completeness: Given χ: {0,1}^B→{R,G,B}, set f(Type(L(u)))=χ(u), f(Type(R(v)))=χ(v), f(others)=⊥. Active-active seam checks EDGE and Eq and enforces inequality on edges and equality on u=v via local verdict; mixed pairs pass via fallback plumbing.\n- Soundness: If f passes (F1), then for each u, both τ^L_u and τ^R_u must be non-⊥ (else some active-active diagonal pair would violate must-color); the diagonal (u,u) has Eq=1, so the colors match, defining χ(u). For any edge (u,v), EDGE=1 forces χ(u)≠χ(v). Thus χ is a proper 3-coloring.\n- Bridging (F2): As argued in D), repeating w_i adds only PAD away from S; in active-active pairs the corridor logic is local-invariant; mixed/inactive are vacuous. Hence any f that satisfies (F1) also satisfies (F2) in this construction.\n\nH) Risks and resolutions (for DP and audit)\n- Probe uniqueness/escape: We explicitly forbid ERR/⊥ adjacent to PROBE states and give each probe state a unique successor; PORT contiguity is enforced by allowing only Addr→Addr+1 across PORT. This makes E(a⋆)[Q_j] a single-bit function of RIDbit[j].\n- Seam activation locality: Tokens are read only one hop from S; must-color is triggered iff the opposite-direction token is present; RUN/VERD are permitted only when both tokens are present. Mixed pairs see no opposite token and thus accept.\n- Verdict consistency: The Eq gate enforces equal colors only on u=v; to avoid Eq∧EDGE contradictions, set D(u,u)=0 in preprocessing of the succinct graph (standard and WLOG for 3-coloring).\n- Alphabet/adjacency budgets: With disjoint-role subalphabets, |Σ_out|=Θ(B) and |Cout–out|=O(B^2)+O(1). Choose β≥c·B^2 to be safe (or β=Θ(B) with careful symbol reuse as in A–C).\n\nNext steps (concrete, auditable)\n1) Produce a machine-readable B=2 instance: enumerate Σ_out symbols listed in E), tabulate Cin–out and the Cout–out fragments for probes, gating, token propagation, RUN enablement, must-color, and verdict adjacency. Run the O(kβ^2) DP to validate the probe bits and seam acceptance on all 16 ordered pairs (L(u),R(v)).\n2) Generalize the parametric tables (Head_j/Port(k,·), Tok monotonicity, S-adjacent constraints, verdict pairs) for arbitrary B and bundle them into the reduction.\n3) Integrate Lemma TS (probes), Lemma RG (gating+tokens), Lemma SG (seam verdict) into the curated output once B=2 validation passes; add Lemma CN (canonical contexts existence) referencing output.md Lemmas 11–12,14–15.\n4) Package the reduction D ↦ P_D formally and state the equivalence (3-colorable ⇔ feasible f), concluding NEXPTIME-hardness of the classification (O(1)/Θ(log* n)/Θ(n)) under the explicit β-normalized, r=1 model.\n"
}