{
  "progress_md": "Round 0005 — Toward a DP-checkable B=2 instance: explicit Cin–out/Cout–out fragments for probes, tokens, gating, and verdict\n\nContext and goal\n- We adopt directional tokens for seam activation (as recommended in verifier.feedback.md) and produce an explicit, radius-1 rule skeleton for B=2 that a DP can check. The focus is on: (i) per-bit boundary probes Q_1, Q_2; (ii) per-side color gating plus mixed-pair fallback (must-color only in active-active); (iii) a seam verdict cell V enforcing both EDGE and Eq via S2↔V local pairs; and (iv) ERR/⊥ discipline in probe/seam modes. We keep disjoint-role subalphabets so sizes add rather than multiply.\n\nSymbols (B=2, disjoint roles)\n- Boundary-reserved outputs (used only on boundary nodes at the four ends for the TS checks): BL1_1, BL2_1, BR2_1, BR1_1 and BL1_2, BL2_2, BR2_2, BR1_2 corresponding to Q_1 and Q_2. (The DP sets boundary outputs to these values; interior neighbors see them through Cout–out.)\n- S-node symbols: S_R, S_G, S_B, S_⊥. (No handshake bits on S; all activation/gating is enforced by the interior neighbors’ symbols.)\n- Interior roles (pairwise disjoint subalphabets):\n  • PAD: Pad.\n  • ERR: Err. (Used only outside probe/seam-active modes.)\n  • PORT (probe-idle): P1^0, P1^1, P2^0, P2^1. (Addr=j and RIDbit=b encoded in the name.)\n  • PORT (probe-active variants): P1p^0, P1p^1, P2p^0, P2p^1. (Same content, different role tag to control adjacency during probes.)\n  • PROBE states (per j): Head_1, Accept_1; Head_2, Accept_2. (Start is injected from the boundary neighbor via BL2_j → Head_j.)\n  • Gating neighbors: GateL, GateR (the unique symbols that may appear immediately inside S1/S2 for canonical sides); NonGate (placeholder representing any other noncanonical neighbor role adjacent to S).\n  • Seam corridor (RUN/PAD aggregate role with token flags): we instantiate four concrete corridor symbols by token bits: Corr_00, Corr_10, Corr_01, Corr_11 where the suffix encodes (Tok→, Tok←) ∈ {(0,0),(1,0),(0,1),(1,1)}. These occur only on the bridge wb∘wc (the two cells immediately adjacent to S and possibly one more cell for B=2; here we use two cells: one next to S1 and one next to S2).\n  • Verdict cell (adjacent to S2 only): Ver(c, e, q) with c∈{R,G,B}, e∈{0,1}, q∈{0,1}. (12 symbols.)\n\nCin–out constraints (B=2)\n- PORT cells tie RIDbit to input bit:\n  • Allowed: (input 0, P1^0), (input 1, P1^1), (input 0, P2^0), (input 1, P2^1).\n  • Same for probe-active variants: (0, P1p^0), (1, P1p^1), (0, P2p^0), (1, P2p^1).\n- Other roles ignore input: for each x∈{Pad, Err, Head_1, Accept_1, Head_2, Accept_2, GateL, GateR, NonGate, Corr_00, Corr_10, Corr_01, Corr_11, Ver(⋅)}, both (0,x) and (1,x) are allowed.\n- S-node symbols: both inputs allowed for S_R, S_G, S_B, S_⊥.\n\nCout–out: PORT zone well-formedness and placement (left canonical block)\n- Adjacent to S1 on its right, the first interior cell of a canonical left block is GateL, followed immediately by the contiguous PORT zone P1, P2 (in this order), then Pad. Allowed pairs inside a canonical left block (rightward orientation):\n  • (GateL, P1^b), (P1^b, P2^{b′}), (P2^{b′}, Pad). (For all b,b′∈{0,1}.)\n- In non-canonical left contexts, the neighbor of S1 is NonGate; from NonGate we only allow PAD onward: (NonGate, Pad), Pad self-loops. (We do not list any pair enabling PORT after NonGate.)\n- Symmetric rules for the canonical right block: immediately left of S2 is GateR; on its left are the contiguous PORT cells P2, P1 in reverse (since the path is oriented left-to-right, the right block’s PORT sits to the left of S2). For simplicity in B=2 we mirror: allowed pairs leftward are expressed via rightward pairs as (P2^b, GateR) and (Pad, P2^b), (P1^{b′}, GateR) as needed; for the DP we will construct rightward lists so that reading from left to right along wb∘wc we encounter …Pad, P1^⋅, P2^⋅, GateR, S2.\n\nPer-bit probe TS (left side; radius-1; deterministic; no escape)\n- Injection from boundary (for j∈{1,2}):\n  • Allowed: (BL1_j, BL2_j), (BL2_j, Head_j).\n  • Disallowed: Any pair (BL2_j, x) with x≠Head_j.\n- Corridor to PORT (we use the probe-active variants at the PORT cells visited during probes):\n  • Before the PORT zone: (Head_j, Head_j) on any corridor Pad stretch prepared for the canonical block. In B=2 we keep this to one step: (Head_j, P1p^b) for the first PORT cell.\n  • Entering PORT: (Head_j, P1p^b) allowed for all b. From P1p^b to the next cell:\n    – If j=1 and b=1: (P1p^1, Accept_1) allowed; if b=0: no successor (DP dead-ends under Q_1).\n    – If j=2: (P1p^b, Head_2) continues the march to the next PORT.\n  • At second PORT: (Head_2, P2p^b) allowed. Then:\n    – If j=2 and b=1: (P2p^1, Accept_2) allowed; if b=0: no successor.\n    – If j=1: this case only arises if Head_1 reached P2p^b; we allow (P2p^b, Head_1) to continue (though for B=2, Head_1 should have halted at P1p already; the pair is harmless if never used in a well-formed block).\n- Accept exits deterministically to Pad: (Accept_j, Pad), (Pad, Pad) self-loop.\n- Probe-mode discipline (no ERR/⊥ escape): We do not list any pairs with Err adjacent to Head_j or Accept_j or any probe-active PORT P⋅p^⋅; similarly, no (Head_j, S_⋅) or (Head_j, GateL/NonGate) pairs.\n- Idle vs probe-active PORT symbols: In probe mode we require P⋅p^⋅ at the PORT positions by listing (Head_j, P⋅p^⋅) and omitting (Head_j, P⋅^⋅). In all non-probe contexts we do not permit P⋅p^⋅; only P⋅^⋅ with standard PAD neighbors are allowed.\n- Type-separation claim (B=2 instance): With the above, for any canonical left word L(u1u2), E_{L(u)}(a⋆)[Q_1] = u1 and E_{L(u)}(a⋆)[Q_2] = u2 (with a⋆ fixed arbitrarily, e.g., 0000). This is DP-checkable.\n\nPer-side color gating at S (local; mixed pairs accept)\n- Allowed S1-adjacent pairs (left side):\n  • If neighbor is GateL: (GateL, S_R), (GateL, S_G), (GateL, S_B), (GateL, S_⊥).\n  • If neighbor is NonGate or Pad: only (NonGate, S_⊥), (Pad, S_⊥). (All (NonGate, S_color) with color∈{R,G,B} omitted.)\n- Symmetrically for S2: if its left neighbor is GateR, then (GateR, S_color) allowed for color∈{R,G,B,⊥}; if neighbor is not GateR, only (NonGate, S_⊥)/(Pad, S_⊥) allowed.\n- This makes mixed pairs vacuous: a canonical side may be colored; a non-canonical side must be ⊥.\n\nDirectional tokens and seam activation (local; must-color only in active-active)\n- Token seeding at the first corridor cells adjacent to S:\n  • When (GateL, S_color) occurs at S1’s edge and the right neighbor cell is the first corridor cell, we allow only (S_color, Corr_10) (Tok→=1) as the successor (and forbid (S_color, Corr_00), (S_color, Corr_01), (S_color, Corr_11)). If S1= S_⊥, we allow only (S_⊥, Corr_00).\n  • When the left neighbor of S2 is GateR and the left corridor cell is adjacent to S2, we enforce Tok←=1 on that corridor cell: the edge immediately to the left of S2 must be (Corr_x1, S_color) for some x (i.e., Tok←=1); if S2= S_⊥ we still permit (Corr_01, S_⊥) in mixed pairs.\n- Token propagation across the two corridor cells (we use exactly two):\n  • Left corridor cell C_L ∈ {Corr_10, Corr_00} sits to the right of S1; right corridor cell C_R ∈ {Corr_01, Corr_00, Corr_11} sits to the left of S2. Allowed pairs:\n    – (Corr_10, Corr_11) (Tok→ continues right; Tok← injected on the next cell if GateR is present), (Corr_10, Corr_10) otherwise is not listed (we force meeting at the second corridor cell).\n    – (Corr_01, Corr_01) (Tok← persists if injected from the right side only).\n    – (Corr_00, Corr_00) for inactive edges.\n    – In active-active, list (Corr_10, Corr_11) and (Corr_11, GateR) (see below).\n- Must-color enforcement (local at S):\n  • If the corridor cell adjacent to S1 has Tok←=1 (i.e., symbol is Corr_01 or Corr_11), then omit pairs (Corr_01, S_⊥) and (Corr_11, S_⊥); only (Corr_01, S_color) and (Corr_11, S_color) with color∈{R,G,B} are allowed. If Tok←=0 (Corr_00 or Corr_10), allow (Corr_⋅0, S_⊥) and (Corr_⋅0, S_color) (mixed/inactive fallback).\n  • Symmetrically at S2: if the corridor cell to its left has Tok→=1 (Corr_10 or Corr_11), omit (S_⊥, Corr_10) and (S_⊥, Corr_11); only (S_color, Corr_10/Corr_11) allowed. If Tok→=0, allow (S_⊥, Corr_00/Corr_01) and (S_color, Corr_00/Corr_01).\n\nVerdict placement and S2↔V local acceptance (EDGE and Eq)\n- Verdict insertion (one-cell): In active-active mode (both tokens present), the right corridor cell adjacent to S2 must be Ver(c,e,q) instead of a Corr_⋅⋅ symbol. We realize this by listing only the pairs (Corr_11, Ver(c,e,q)) for some c,e,q (and omitting (Corr_11, S2) with a corridor symbol). The color c is copied from S1 by permitting (S1_color, Corr_10) only when the Ver’s c equals that S1_color; concretely, we constrain the sequence S1_color → Corr_10 → Corr_11 → Ver(c, e, q) so that c matches S1_color. (For DP, we can simply list (Corr_11, Ver(R,⋅,⋅)), (Corr_11, Ver(G,⋅,⋅)), (Corr_11, Ver(B,⋅,⋅)) and then add S2↔Ver gating below; the color-copy guarantee is optional for the toy B=2 check.)\n- Computation of EDGE and Eq (B=2): For audit we tabulate D(u,v) and Eq[u=v] by constant-width local rules that “read” the PORT bits u and v. An easy way is to require that the left corridor cell Corr_10 sits immediately after P2 (on the left side) so it sees u (two PORT cells back), and the right corridor cell Ver(⋅,e,q) sits immediately before GateR and thus “sees” v; we then list only those (P1^u1,P2^u2, Corr_10) patterns and (Ver(⋅,e,q), P2^v2, P1^v1) local neighborhoods consistent with (EDGE, Eq) for the chosen D (e.g., the 4-cycle). For the DP harness, we can bake the 16 cases into which Ver(⋅,e,q) symbols are allowed given the adjacent PORT values on each side. (This is implementable via radius-1 pairs by expanding a finite number of Corr/Ver variants if needed; for brevity we leave the exact micro-expansion as a checklist item.)\n- S2↔Ver local acceptance table (simultaneous constraints): For each Ver(c,e,q) and S2_color ∈ {R,G,B} we allow S2↔Ver iff both hold: (A) if e=1 then S2_color≠c; (B) if q=1 then S2_color=c. Enumerated allowed pairs:\n  • If (e,q)=(0,0): allow all (S2_color, Ver(c,0,0)).\n  • If (e,q)=(1,0): allow (S2_color≠c, Ver(c,1,0)); forbid (c, Ver(c,1,0)).\n  • If (e,q)=(0,1): allow (c, Ver(c,0,1)); forbid (S2_color≠c, Ver(c,0,1)).\n  • If (e,q)=(1,1): (this case does not arise for D(u,u)=0; to be safe, list none so any accidental appearance dead-ends.)\n- ERR/⊥ disabled near VERD in active modes: We omit all pairs with Err adjacent to Corr_⋅⋅ or Ver(⋅) whenever Tok→ or Tok← is 1. (Outside active-active/mixed, ERR is permitted next to Pad/NonGate.)\n\nMixed-pair fallback\n- If exactly one side is canonical, then one token is present and the other absent. Locally, this permits S_color on the canonical side (GateL/R adjacency), forces S_⊥ on the non-canonical side (NonGate adjacency), allows corridor cells to be Corr_10 or Corr_01 near the canonical side and Corr_00 elsewhere, and crucially allows S↔Corr pairs with S_⊥ (since opposite-direction token is 0). No Ver(⋅) appears (no Corr_11), so the pair accepts unconditionally via PAD/corridor self-loops.\n\nERR discipline outside special modes\n- Outside probes or active seam (i.e., when no Head_j/Accept_j/P⋅p^⋅ or Corr_⋅⋅/Ver(⋅) present), we allow (Pad, Err), (Err, Err), (Err, Pad) to guarantee malformed interiors can always be completed and never constrain f.\n\nB=2 DP audit plan (concrete checklist)\n1) TS probe checks: Build four canonical left seeds L(00), L(01), L(10), L(11) whose interior right of S is GateL, P1^{u1}, P2^{u2}, Pad. Set boundary inputs a⋆ (e.g., 0000). For Q_1: boundary outputs (BL1_1, BL2_1, BR2_1, BR1_1); run the DP and confirm extendibility iff u1=1. Similarly for Q_2 vs u2.\n2) Seam/mixed pairs: Build R(v) symmetrically so that left of S2 is Pad, P2^{v2}, P1^{v1}, GateR. For each pair (u,v), activate corridor tokens as per GateL/GateR presence. Instantiate the toy succinct graph D as the 4-cycle on {00,01,11,10} with D(u,u)=0. Bake the 16 cases into the allowed Ver(⋅,e,q) alongside the local S2↔Ver acceptance table above. Verify:\n   • Mixed pairs (exactly one side canonical) accept for any S_color on the canonical side and S_⊥ on the non-canonical side.\n   • Active-active pairs accept iff (D(u,v)=0 or colors differ) AND (u=v ⇒ colors equal). (Since Eq=1 only for u=v, the latter becomes a requirement.)\n3) ERR/⊥-escape: Confirm via the adjacency that no Head_j, P⋅p^⋅, Corr_⋅⋅, or Ver(⋅) has any outgoing pair to Err; attempts dead-end as intended.\n\nAlphabet/adjacency budget (B=2 instance)\n- Symbols: S(4) + PORT idle(4) + PORT probe(4) + PROBE(4) + Gate*(2) + NonGate(1) + Pad(1) + Err(1) + Corr(4) + Ver(12) + boundary tokens(8) = 45 symbols. Adjacency table lists O(10^2) pairs; well within β for any reasonable β≥64.\n\nGaps in output.md (observations; no edits made)\n- Context set C not explicitly defined in output.md: As used in our reduction and the NEXPTIME upper bound, C denotes types realized by words w_1 S w_2 with |w_i|∈{ℓ_pump, ℓ_pump+1}. It may help to add this remark (|C|≤ℓ_pump), though the main theorems do not depend on it.\n- Finite-Z bound is stated (Cor. 4) with Z≤|T|^2; we use this for (F2) in the upper bound. For hardness we neutralize (F2) via ⊥-plumbing; output.md does not describe this family-specific trick (by design), but our notes rely on it.\n\nObstacles/risks and mitigations\n- Verdict e/q linkage to PORT bits (B=2): We sketched two radius-1 realizations: (i) expand Corr/Ver symbols to encode the (u,v) case and list only consistent pairs; (ii) constrain the corridor placement to sit adjacent to the PORT cells and list only (PORT, Corr)/(Corr, Ver)/(Ver, PORT) pairs consistent with the table of (EDGE,Eq). Either is DP-checkable with a finite list; we propose to use (i) to keep the corridor width at two.\n- “Simultaneous activation” locality: Resolved via tokens. Must-color and the requirement to attach to Ver(⋅) are triggered solely by the presence of the opposite-direction token on the adjacent corridor cell; this is local and symmetric.\n- Probe determinism: We listed the unique successors from BL2_j and from probe-active PORT cells; no pairs to Err/S/Pad are present before Accept_j, preventing escape.\n\nNext steps (auditable deliverables)\n1) Finalize the B=2 machine-readable instance: list the exact symbol set and the Cout–out adjacency pairs as above, plus the 16-case table wiring (u,v)↦(EDGE,Eq) into Corr/Ver pairs. Share with the DP harness.\n2) Run the DP to validate: TS per-bit probes; mixed-pair acceptance; active-active seam behavior for all 16 (u,v) with the S2↔Ver acceptance table; absence of Err/⊥ escape.\n3) Generalize the probe schema to arbitrary B (add Head_j/Accept_j and P_kp^⋅ symbols) and state the O(B^2) adjacency count bound explicitly; verify symbol budgets with β≥c·B^2.\n4) Add a short r=1 padding lemma (or cite Lemmas 11, 14–15) guaranteeing existence of canonical contexts at lengths ℓ_pump and ℓ_pump+1 with the PORT zone abutting S; ensure pumping occurs in PAD only.\n5) After B=2 validation, formalize Lemma TS (type separation), Lemma RG (gating + tokens), and Lemma SG (seam verdict with EDGE/Eq) and integrate into the curated output once vetted.\n"
}