{
  "progress_md": "Round 0006 — Firming up the u_v-based both-good refinement: boundary–label equivalence, conditioning, and a rigorous global inequality; plus minor audits and next steps\n\nAudit of output.md (gaps and clarifications)\n- Good: The anchored-driven refinement (Lemma I, Proposition J, Corollary J1, I.1) is now rigorous and self-contained; Lemma K (uniformity of boundary direction pairs) and Corollary E0.1 provide the needed sampling backbone with explicit finite-n constants.\n- Gap to close: The complementary both-good refinement via u_v (outlined in notes.md and earlier rounds) is still missing from output.md because we had not yet proved that the boundary switch equals the disagreement of the c_v labels when both neighboring Q3’s are good. This round supplies that equivalence and the uniformity-of-conditioning step, enabling a rigorous Proposition (K-type) and its global corollary.\n\nNew lemmas (ready to curate)\n- Lemma L (Boundary–label equivalence for good Q3’s at the shared vertex v). Fix a good Q3(v,w) and Dvořák’s choice f∈{f1,f2}, so the path used inside Q3(v,w) from v to w is (v, f(v,w), f(w,v), w). Define c_v(K) to be the color of the edge (v, f(v,w)) (as in Corollary D). Consider a boundary between two consecutive blocks with shared vertex v where the previous block uses Q3(v′,v) and the next block uses Q3(v,w). Then the color of the incoming edge at v (last edge of the previous block) equals the color of the edge (f(v,w), v) in Q3(v,w) and thus equals c_v of the previous cube’s 3-set; the color of the outgoing edge at v (first edge of the next block) equals the color of (v, f(v,w)) and thus equals c_v of the next cube’s 3-set. Hence, on the both-good event, “switch at the boundary” is exactly the event [c_v(K_prev) ≠ c_v(K_next)].\n  Proof. For the previous block Q3(v′,v), the used path is (v′, f(v′,v), f(v,v′), v). The last edge at v is (f(v,v′), v), which is the same undirected edge as (v, f(v,v′)) whose color defines c_v(K_prev). For the next block Q3(v,w), the first edge at v is (v, f(v,w)), which is exactly the edge whose color defines c_v(K_next). Since edge colors are undirected and f satisfies d(f(w,v), f(v,w))=1, the boundary switch occurs iff these two colors differ. ∎\n\n- Proposition G3 (Both-good conditioning is uniform on disjoint good pairs and E_v[q_v]=a). Fix a boundary index j. Condition on the shared vertex v=v_{3j}. By Lemma K, the ordered pair (K,L) of direction 3-sets is uniform over ordered disjoint pairs and independent of v. Conditioning further on K,L∈G_v (both cubes good at v), (K,L) is uniform over ordered disjoint pairs from G_v. Consequently, with q_v := P[K,L∈G_v | v], we have E_v[q_v] = a, where a is the global both-good probability for neighboring Q3’s.\n  Proof. Uniformity before conditioning is Lemma K. Conditioning on K,L∈G_v restricts to a uniform law on the induced set of disjoint good pairs. Averaging over v (uniform by Proposition G) yields E_v[q_v]=P(both good)=a. ∎\n\nProposition K (Both-good boundary refinement via u_v — rigorous statement and proof)\n- Setup at v. Let G_v⊆C([n],3) be the set of good triples at v, c_v: G_v→{R,B} the label defined in Corollary D, p_v the red fraction, and u_v:=|2p_v−1|.\n- Boundary-level identity. At a fixed boundary j with shared vertex v, on the event that both neighboring Q3’s are good, Lemma L implies\n  P[switch at boundary j | v, both-good] = P[c_v(K)≠c_v(L) | v, K,L∈G_v].\n  By Proposition G3, (K,L) is uniform over ordered disjoint pairs from G_v; hence by Corollary D (pair-sampling under disjointness),\n  P[switch | v, both-good] = 1/2 − u_v^2/2 ± O(1/n).\n- Averaging (using E_v[q_v]=a). Let q_v := P[K,L∈G_v | v]. Then\n  E[1_{both-good}·1_{switch at boundary}] = E_v[q_v·(1/2 − u_v^2/2)] ± O(1/n)\n  = (a/2) − (1/2)·E_v[q_v·u_v^2] ± O(1/n).\n- Global bound. Summing over ≈n/3 boundaries and adding the interior 1 − p/2 per block, we obtain\n  E[switches] ≤ (1/3 + b/12)·n − (1/6)·E_v[q_v·u_v^2]·n + o(n).\n- Unconditional corollary (via the anchored lower bound on q_v). Since anchored triples A_v ⊆ G_v, Lemma E0 with T=A_v gives q_v ≥ P[K,L∈A_v | v] = τ_v^2 ± O(1/n). Therefore\n  E[switches] ≤ (1/3 + b/12)·n − (1/6)·E_v[τ_v^2·u_v^2]·n + o(n)\n  ≤ (1/3 + b/12 − (1/96)·E_v[u_v^2] + o(1))·n,\n  using τ_v ≥ 1/4 − O(1/n).\n- Why useful here. This furnishes a second, independent both-good saving that can be nontrivial even when the degree-variance T_v is tiny but the good-cube label bias u_v has variance. In particular, in highly biased stars (e.g., r_v∈{0,n}), u_v=1 and τ_v=1, and the bound yields the same −1/6 savings per n as the anchored route, matching expectations.\n\nConsistency and non-overcounting\n- The anchored-driven bound (Proposition J) and the u_v-driven bound (Proposition K) both act on the both-good boundary term. They should not be added; instead, one may take their pointwise maximum or pick the stronger one for a given coloring. For the purposes of output.md, we recommend adding Proposition K as an independent refinement and stating the final bound as the minimum of the two right-hand sides; in analysis we can use whichever gives the larger saving.\n\nSmall sanity checks\n- Balanced degrees and balanced labels: If r_v≡n/2 and c_v is balanced (u_v≡0), then Proposition K yields no improvement, as desired. Proposition J also yields no improvement (T_v≡0); we revert to Dvořák’s baseline (1/3 + b/12 + o(1))·n.\n- Extreme bias: If r_v∈{0,n} and (hence) u_v≡1 and τ_v≡1, Proposition K gives a saving (1/6)·n, consistent with Proposition J’s (2/3)·τ_v^2 T_v n = (2/3)·(1)·(1/4)·n = (1/6)·n.\n\nFinite-n remarks\n- Using Corollary E0.1 with T=A_v (anchored set), we can make the inequality q_v ≥ τ_v^2 − 20/(n−12) explicit for n≥20. This yields an explicit finite-n version of the u_v-bound: replace E_v[τ_v^2·u_v^2] by E_v[(τ_v^2 − 20/(n−12))_+·u_v^2], keeping the remainder in the o(n) term.\n\nHow to add to output.md\n- Add Lemma L (boundary–label equivalence) under the “Additional proven results” section.\n- Add Proposition G3 (uniformity under both-good conditioning and E_v[q_v]=a).\n- Add Proposition K with the full proof above, and a Corollary K1 stating the unconditional 1/96 bound via τ_v ≥ 1/4.\n- Optional: include the finite-n explicit slack from Corollary E0.1 in Proposition K’s error term.\n\nObstacles and open points\n- We still lack a universal lower bound on E_v[u_v^2] (and on E_v[T_v]). Thus neither Proposition J nor K alone gives an unconditional δ>0. The remaining bottleneck is the “balanced regime” where both T_v and u_v^2 are tiny; here we must push b ≤ 1/2 − γ.\n- Discrete minimization of H(r,n): still optional; not needed for the current propositions.\n\nNext steps (auditable)\n1) Curate Lemma L, Proposition G3, and Proposition K (with its corollary) into output.md, using Corollary E0.1 to make the finite-n error explicit if desired.\n2) Begin the balanced-regime LP: enumerate marked-Q3 isomorphism classes with a marked vertex; tag good/bad and, for good, the f1-start color at the mark; compute each class’s triple of face-types at the mark. This table feeds the LP variables z_π and linear constraints to star/face marginals.\n3) Implement the first LP relaxation (balanced r_v=n/2) with symmetry reductions and product-approximation for disjoint pairs, including explicit ±20/(n−12) slack. Solve numerically to estimate γ in b ≤ 1/2 − γ.\n4) Optional: prove the discrete minimization of H(r,n) at balance (n≥8) for completeness.\n\nWhy this is progress\n- We resolved the key missing justification for the u_v-based both-good refinement by proving the boundary–label equivalence (Lemma L) and the correct conditioning uniformity (Proposition G3). This enables a fully rigorous Proposition K and a clean global inequality yielding a linear saving proportional to E_v[τ_v^2·u_v^2]. Together with Proposition J, we now have two independent, checkable mechanisms that turn local imbalances (degree or label) into global savings, cleanly isolating the balanced regime for the forthcoming LP attack on b. "
}