{
  "summary_md": "Round 0006 closes the key gap in the both-good (u_v) refinement by proving a boundary-label equivalence (Lemma L) and the required conditioning uniformity (Proposition G3), then using Corollary D/C to derive Proposition K: E[1_{both-good}·1_{switch}] = a/2 − (1/2)·E_v[q_v·u_v^2] ± O(1/n). Summing over boundaries gives the global bound E[switches] ≤ (1/3 + b/12)n − (1/6)·E_v[q_v·u_v^2]·n + o(n). Using anchored triples (q_v ≥ τ_v^2 − O(1/n)) yields the unconditional corollary E[switches] ≤ (1/3 + b/12 − (1/96)·E_v[u_v^2] + o(1))·n. Finite-n slack can be made explicit (≤20/(n−12)). These results complement the anchored (T_v) saving and isolate the remaining “balanced” regime where both T_v and u_v^2 are small; the next attack is an LP over marked-Q3 classes. Citations: prover-01.out.json, prover-02.out.json.",
  "highlights": [
    "Lemma L (boundary-label equivalence): on a both-good boundary the switch indicator equals the disagreement event [c_v(K) ≠ c_v(L)], tying switches to c_v-labels.",
    "Proposition G3 (conditioning uniformity): conditioning on both neighboring Q3's being good makes (K,L) uniform over ordered disjoint pairs in G_v; averaging yields E_v[q_v]=a.",
    "Proposition K (u_v-based both-good refinement): E[1_{both-good}·1_{switch}] = a/2 − (1/2)E_v[q_v·u_v^2] ± O(1/n), hence a global saving −(1/6)·E_v[q_v·u_v^2]·n in E[switches].",
    "Anchored corollary: using q_v ≥ τ_v^2 − O(1/n) gives the explicit bound E[switches] ≤ (1/3 + b/12 − (1/96)E_v[u_v^2] + o(1))·n, providing a second independent vertex-averaged saving.",
    "Finite-n explicitness & LP blueprint: error terms can be bounded (≤20/(n−12)); next concrete task is enumerating marked-Q3 isomorphism classes and building the LP for the balanced regime."
  ],
  "next_questions": [
    "Curate Lemma L, Proposition G3, and Proposition K (with corollary and explicit finite-n error from Corollary E0.1) into output.md.",
    "Enumerate all marked-Q3 isomorphism classes (with a marked vertex), tag good/bad and f1-start color, and compute the face-type triples needed to form LP variables z_π.",
    "Implement and solve the balanced-regime LP (apply symmetry reductions and ±20/(n−12) product-approximation slack) to attempt to prove b ≤ 1/2 − γ or identify remaining obstructions."
  ]
}