{
  "feedback_md": "High-level: Both reports converged on the missing boundary–label equivalence for the both-good refinement, and on a rigorous u_v-based global inequality. This is the right gap to close. With one adjustment to the definition of c_v (align it with the path actually chosen by Dvořák inside each good Q3), the boundary equivalence becomes immediate and the remainder of the argument (uniformity of conditioning, pair-sampling, and global averaging) is sound and compatible with the existing sampling lemmas in output.md. The resulting Proposition K (u_v-based both-good refinement) is ready to curate, together with a corollary giving an explicit 1/96 coefficient when only τ_v ≥ 1/4 is used.\n\nKey corrections/rigor points:\n- Do not rely on “for good cubes f2≡f1.” This is not established and is unnecessary. Instead, define c_v(K) to be the color of the edge (v, f(v,•)) along the actual path chosen by Dvořák inside Q3(v,K). Corollary D (pair-sampling) remains valid for this c_v because it needs only an arbitrary fixed labeling of G_v.\n- Boundary–label equivalence: With the above definition, the last edge of the previous block at v is (f(v, v′), v) and the first edge of the next block is (v, f(v, w)). Their colors are exactly c_v(K_prev) and c_v(K_next). Thus, on the both-good event, boundary switch equals [c_v(K_prev) ≠ c_v(K_next)]. This is local and rigorous.\n- Conditioning uniformity: Lemma K implies (K,L) is uniform over ordered disjoint pairs and independent of v. Conditioning on K,L ∈ G_v restricts to uniform on disjoint good pairs. Averaging over v yields E_v[q_v] = a. All these steps are fully justified by existing lemmas.\n- Anchored-implies-u_v lower bound: The claim u_v ≥ |C(r,3)−C(n−r,3)|/(C(r,3)+C(n−r,3)) is not valid as a pointwise lower bound for u_v on all of G_v; non-anchored good triples can, in principle, cancel the anchored bias. Please do not add this to output.md. Keep anchored-based savings and u_v-based savings as separate refinements.\n\nWhat to curate now:\n1) A “definition alignment” remark updating c_v to be the color of the first edge at v along the actual chosen path in a good Q3. State explicitly that Corollary D remains valid for this labeling.\n2) Lemma L (Boundary–label equivalence at v for good neighboring Q3’s).\n3) Proposition G3 (Both-good conditioning is uniform on disjoint good pairs and E_v[q_v]=a).\n4) Proposition K (u_v-based both-good refinement) with its proof and the global bound E[switches] ≤ (1/3 + b/12)·n − (1/6)·E_v[q_v u_v^2]·n + o(n).\n5) Corollary K1 (unconditional 1/96 via τ_v ≥ 1/4 − O(1/n)). Optionally mention the explicit finite-n slack 20/(n−12) via Corollary E0.1.\n\nNon-overcounting: Emphasize that the anchored-driven (Proposition J) and u_v-driven (Proposition K) savings act on the same both-good boundary term, so they should not be added; in analysis, use the stronger one pointwise.\n\nNext steps:\n- Begin the “balanced-regime” LP: enumerate marked-Q3 classes (good/bad tagging under Dvořák’s filters), record each good class’s f-start color at the mark, and their face-type triples. These give linear maps from class variables to star- and face-marginals.\n- Enforce 4-cycle consistency and the badness filters; include the disjoint-pair product approximation with explicit ±20/(n−12) slack.\n- Explore constraints that relate c_v-labels across triples (e.g., via shared faces/4-cycles) to obtain a lower bound on E_v[u_v^2] in the balanced regime.\n- Optional: quantitative finite-n versions of Proposition K using Corollary E0.1; and a standalone note on E_v[q_v]=a in terms of a.\n",
  "new_notes_md": "Round 0006: Closing the u_v-based both-good refinement; boundary–label equivalence; and a global inequality\n\n- Definition alignment for c_v. For a fixed vertex v, let G_v be the set of triples K such that Q3(v,K) is good in Dvořák’s scheme. Define c_v(K) to be the color of the edge (v, f(v, •)) that Dvořák’s algorithm actually uses as the first step at v inside Q3(v,K) (i.e., along the chosen antipodal 3-edge geodesic for that cube). This replaces the earlier provisional definition using f1 only. Importantly, all pair-sampling statements (Lemma C and Corollary D) remain valid verbatim for this adjusted labeling, since they only require that c_v is a fixed map G_v → {R,B}.\n\n- Boundary–label equivalence (local, both-good). Consider a boundary between two consecutive blocks where the shared vertex is v and both neighboring Q3’s are good. Let the previous block be Q3(v′, v) and the next block be Q3(v, w). By the definition of the modified geodesic, the last edge at v of the previous block is (f(v, v′), v), and the first edge at v of the next block is (v, f(v, w)). By the aligned definition of c_v, these two colors are exactly c_v(K_prev) and c_v(K_next), respectively. Since the edge colors are undirected, a boundary switch occurs if and only if c_v(K_prev) ≠ c_v(K_next).\n\n- Conditioning uniformity and averaging. Fix a boundary index j and condition on v = v_{3j}. By Lemma K, the ordered pair (K,L) of direction triples flanking the boundary is uniform over ordered disjoint pairs and independent of v. Conditioning further on both cubes being good at v (i.e., K,L ∈ G_v), (K,L) is uniform over ordered disjoint pairs in G_v. Writing q_v := P[K,L ∈ G_v | v], we have E_v[q_v] = a by vertex-uniformity (Proposition G) and Lemma K.\n\n- Pair-sampling on G_v and the boundary switch probability. By Corollary D (applied to T=G_v with the aligned c_v), for unordered disjoint pairs from G_v,\n  P[c_v(K) ≠ c_v(L)] = 1/2 − u_v^2/2 ± O(1/n),\n  where u_v := |2p_v − 1| and p_v is the c_v-red fraction in G_v. Ordered vs unordered does not affect the disagreement probability. Combining with the boundary–label equivalence yields, at boundary j and fixed v,\n  E[1_{both-good}·1_{switch} | v] = q_v·(1/2 − u_v^2/2) ± O(1/n).\n  Averaging over v and using E_v[q_v] = a gives the identity\n  E[1_{both-good}·1_{switch}] = a/2 − (1/2)·E_v[q_v u_v^2] ± O(1/n).\n\n- Global u_v-based refinement. Summing over ≈ n/3 boundaries and adding the interior contribution (1 − p/2) per block yields\n  E[switches] ≤ (1/3 + b/12)·n − (1/6)·E_v[q_v u_v^2]·n + o(n).\n  Using anchored ⊆ good and Lemma E0 gives q_v ≥ τ_v^2 − O(1/n), whence the unconditional corollary\n  E[switches] ≤ (1/3 + b/12 − (1/96)·E_v[u_v^2] + o(1))·n.\n  Here τ_v := [C(r_v,3)+C(n−r_v,3)]/C(n,3) ≥ 1/4 − 3/(4n), so τ_v^2 ≥ 1/16 − O(1/n).\n\n- Non-overcounting with anchored refinement. The anchored-driven bound (Proposition J) and the u_v-driven bound above both refine the same both-good boundary term. They should not be added; in analysis one should use the stronger of the two in any given instance.\n\n- Correction to earlier heuristic. A previously stated inequality claiming u_v ≥ |C(r_v,3) − C(n−r_v,3)|/(C(r_v,3)+C(n−r_v,3)) is not valid as a pointwise lower bound on u_v over all of G_v, because labels on non-anchored good triples can, in principle, cancel the anchored bias. We therefore do not use this inequality.\n\n- Finite-n notes. By Corollary E0.1, the product-approximation error for q_v can be made explicit: q_v ≥ τ_v^2 − 20/(n−12) for n ≥ 20. A similar explicit O(1/n) bound applies to the pair-sampling error in Corollary D when T=G_v (since |S_K| = O(n^2) and |G_v| = Θ(n^3)).\n\n- Path forward (balanced regime). The remaining obstruction to a uniform improvement is the near-balanced regime where both the degree variance T_v and u_v^2 are tiny. Proceed with the marked-Q3 enumeration (good/bad classification; the chosen start edge color at the mark; and face-type triples), set up the LP with 4-cycle consistency, Dvořák’s badness filters, symmetry reductions, and disjoint-pair product approximation (±20/(n−12) slack), and maximize b_v. Any universal optimum < 1/2 (for large n) gives b ≤ 1/2 − γ and improves 3/8.\n",
  "new_notes_append": "True",
  "new_outputs_md": "Remark D.1 (Definition alignment for c_v)\nFor a fixed vertex v and K ∈ G_v (the set of triples such that Q3(v,K) is good), redefine c_v(K) to be the color of the edge (v, f(v, •)) that Dvořák’s algorithm actually uses as the first step at v inside the chosen antipodal 3-edge path across Q3(v,K). This replaces the provisional definition via f1 only. Corollary D (pair-sampling stability) and all results that use it remain valid verbatim for this aligned c_v, since those results apply to an arbitrary fixed labeling c_v: G_v → {R,B}.\n\nLemma L (Boundary–label equivalence for good Q3’s at the shared vertex)\nStatement. Consider two consecutive blocks in Dvořák’s modified geodesic with shared boundary vertex v, and suppose both neighboring 3-cubes are good. Let K_prev and K_next be their 3-sets of directions (ordered, disjoint). Then, with c_v as in Remark D.1,\n  1{switch at the boundary} = 1[ c_v(K_prev) ≠ c_v(K_next) ].\nProof. The path used inside a block Q3(x,y) has the form (x, f(x,y), f(y,x), y), where f is the deterministic rule chosen by Dvořák for that cube. At the boundary between Q3(v′,v) and Q3(v,w), the last edge of the previous block is (f(v, v′), v) and the first edge of the next block is (v, f(v, w)). By definition of c_v, the colors of these edges are exactly c_v(K_prev) and c_v(K_next), respectively. Edge colors are undirected, so the boundary switch occurs if and only if these two colors differ. ∎\n\nProposition G3 (Both-good conditioning is uniform on disjoint good pairs and E_v[q_v]=a)\nStatement. Fix a boundary index j and condition on v = v_{3j}. Let (K,L) be the ordered pair of direction 3-sets flanking the boundary. Let G_v ⊆ C([n],3) be the set of triples for which Q3(v,K) is good, and define q_v := P[K,L ∈ G_v | v]. Then:\n- (K,L) is uniform over ordered disjoint pairs of 3-sets and independent of v.\n- Conditional on K,L ∈ G_v, the law of (K,L) is uniform over ordered disjoint pairs drawn from G_v.\n- Averaging over v (uniform by Proposition G) yields E_v[q_v] = a, where a is the global probability that two neighboring Q3’s are both good.\nProof. The first two items follow from Lemma K by restriction to the event {K,L ∈ G_v}. The last item holds because the unconditional probability that both neighboring cubes are good equals the average over v of the corresponding conditional probabilities, and v_{3j} is uniform (Proposition G). ∎\n\nProposition K (Both-good boundary refinement via u_v)\nSetup. For a vertex v, let G_v ⊆ C([n],3) be the set of good triples, let t_v = |G_v|, and let c_v: G_v → {R,B} be as in Remark D.1. Let p_v := |{K∈G_v : c_v(K)=R}|/t_v and u_v := |2p_v − 1|. For a boundary with shared vertex v, write q_v := P[K,L ∈ G_v | v] as in Proposition G3.\n\nStatement. At a fixed boundary index j,\n  E[ 1_{both-good at boundary} · 1_{switch at boundary} ] = a/2 − (1/2)·E_v[q_v · u_v^2] ± O(1/n).\nConsequently,\n  E[switches] ≤ (1/3 + b/12)·n − (1/6)·E_v[q_v · u_v^2]·n + o(n).\n\nProof. Condition on the shared vertex v = v_{3j}. By Lemma L, on {K,L ∈ G_v} the boundary switch event equals [c_v(K) ≠ c_v(L)]. By Lemma K and Proposition G3, conditional on {K,L ∈ G_v}, (K,L) is uniform over ordered disjoint pairs from G_v. By Corollary D (pair-sampling on T=G_v with labeling c_v),\n  P[c_v(K) ≠ c_v(L) | v, K,L ∈ G_v] = 1/2 − u_v^2/2 ± O(1/n),\nwhere the error is O(1/n) since t_v = Θ(n^3). Therefore,\n  E[ 1_{both-good} · 1_{switch} | v ] = q_v · (1/2 − u_v^2/2) ± O(1/n).\nAveraging over v (Proposition G) and using E_v[q_v] = a gives the displayed identity. Summing over ≈ n/3 boundaries and adding the interior contribution (1 − p/2) per block (with p = a + b/2) yields the global inequality. ∎\n\nCorollary K1 (Unconditional coefficient via τ_v ≥ 1/4)\nStatement. With τ_v := [C(r_v,3)+C(n−r_v,3)]/C(n,3) and r_v the red degree at v, anchored ⊆ good implies q_v ≥ τ_v^2 − O(1/n). Hence\n  E[switches] ≤ (1/3 + b/12)·n − (1/6)·E_v[ (τ_v^2 − O(1/n)) · u_v^2 ]·n + o(n)\n  ≤ (1/3 + b/12 − (1/96)·E_v[u_v^2] + o(1))·n,\nusing τ_v ≥ 1/4 − 3/(4n). For n ≥ 20 one may replace O(1/n) in q_v by the explicit 20/(n−12) from Corollary E0.1.\n\nRemark (Non-overcounting). The anchored-driven refinement (Proposition J) and the u_v-driven refinement (Proposition K) both act on the both-good boundary contribution. They should not be added; in applications one uses the stronger of the two bounds pointwise.\n",
  "new_outputs_append": "True",
  "verdict": "partial success"
}