{
  "progress_md": "# Ideas\n- Formalize an IRV “ε-winner” certificate as a finite set of linear inequalities with slack that can be preserved after adding ε mass of appropriately chosen ballots. This yields a path-wise certification criterion for the natural algorithm (run IRV on the sample; use its elimination path and measured slacks to certify robustness).\n- Start with K=3 to validate the mechanism concretely, then state the general K claim and identify the exact class of linear forms and its cardinality to derive uniform concentration bounds.\n\n# Definitions and notation\n- Let P be the true distribution over the K! rankings; S be the empirical distribution on m sampled ballots (with replacement).\n- For a subset A ⊆ [K], define score_x(P; A) := probability that, under P, the top-ranked candidate among A on a random ballot is x. This is linear in P with coefficients in {0,1}.\n- For a fixed elimination order σ = (e_1, e_2, …, e_{K-1}, w) (where e_r is eliminated at round r and w is the last remaining), define A_r := [K] \\ {e_1,…,e_{r-1}}.\n- For each round r and y ∈ A_r \\ {e_r}, define the linear functional (inequality margin):\n  d_{r,y}(P) := score_y(P; A_r) − score_{e_r}(P; A_r).\n- The elimination order σ is feasible under P iff d_{r,y}(P) ≥ 0 for all r and all such y, with ties handled by the fixed rule consistent with σ.\n\n# Proposition (K = 3: sample-to-true ε-winner certificate)\nClaim: Suppose K=3 and the IRV winner on the sample S is c with elimination order (e, other, c). If, in S, both inequalities hold with slack ≥ 2ε:\n- First-choice elimination: score_e(S; {a,b,c}) ≤ min(score_a(S; {a,b,c}), score_b(S; {a,b,c})) − 2ε.\n- Final pairwise: m_{c,other}(S) := Pr_S[c ≻ other] − Pr_S[other ≻ c] ≥ 2ε.\nIf additionally the empirical deviations for these statistics satisfy |score_x(S; [3]) − score_x(P; [3])| ≤ ε and |m_{c,other}(S) − m_{c,other}(P)| ≤ ε, then c is an ε-winner for P.\n\nWhy useful here: Gives a concrete m via Hoeffding to ensure with high probability that the sample winner is an ε-winner for K=3.\n\nSketch proof: Under the deviation bounds, in P we have score_e ≤ min(score_a, score_b) − ε and m_{c,other} ≥ ε. Consider adding ε mass of ballots all ranking c ≻ other ≻ e. In the mixed profile P' = (1−ε)P + εQ, the elimination gap against e for at least one of {a,b} increases by ε, others are unchanged but remain ≥ (1−ε)ε > 0; the pairwise margin becomes m'_{c,other} = (1−ε)m_{c,other}(P) + ε ≥ (1−ε)ε + ε > 0. Thus the elimination order and final majority persist, and c wins in P'. Therefore c is an ε-winner.\n\nConcentration: There are O(1) statistics here. Hoeffding yields m ≥ C (log(1/δ))/ε^2 suffices.\n\n# General K: path-wise certificate and concentration\nClaim (Certificate): Let σ be the elimination order produced by running IRV on S, with winner w. For every round r and every y ∈ A_r \\ {e_r}, suppose the margins in S satisfy d_{r,y}(S) ≥ 2ε. If for all these linear forms |d_{r,y}(S) − d_{r,y}(P)| ≤ ε, then w is an ε-winner for P.\n\nWhy useful here: Reduces the success of the natural algorithm to uniform concentration of a finite family of linear forms; yields a clean sample complexity bound once we bound the family’s size.\n\nProof sketch: Under the deviation bounds, d_{r,y}(P) ≥ ε for all needed (r,y). Let Q place all ε mass on the single ranking that orders candidates according to σ (w at top, then e_{K-1}, …, with e_1 last). In P' = (1−ε)P + εQ, each inequality evolves as\n- d_{r,y}(P') = (1−ε)d_{r,y}(P) + ε d_{r,y}(Q), where d_{r,y}(Q) ∈ {0,1} since e_r is never top among A_r under Q and exactly one y_r (the highest in A_r per σ) has d_{r,y_r}(Q) = 1, all other y have 0. Hence all inequalities remain ≥ (1−ε)ε ≥ 0, and for y_r they receive an extra +ε. Therefore all constraints hold in P', making σ a valid elimination path and w the winner. So w is an ε-winner.\n\nUniform concentration: Each d_{r,y} is the difference of two indicators of the form “top among A equals x,” so its range is in [−1,1]. The family of such differences, over all subsets A and ordered pairs (y, x) ∈ A×A with y ≠ x, has cardinality\nU = Σ_{s=2}^K binom(K,s) s(s−1) = K(K−1) 2^{K−2} (identity via moments of (1+x)^K).\nThus by a union bound plus Hoeffding, with m ≥ C (log U + log(1/δ))/ε^2 = C' (K + log(1/δ))/ε^2, we have |d_{r,y}(S) − d_{r,y}(P)| ≤ ε simultaneously for all such forms with probability ≥ 1−δ. Consequently, on this event, whenever the sample path σ has margins ≥ 2ε, the sample winner is an ε-winner.\n\nRemark on adaptivity: The above uniform bound controls all d_{r,y} for all A, removing dependence on the random, sample-determined A_r.\n\n# Lower bounds (initial)\n- Even for K=3, any algorithm (hence the natural one) needs m = Ω((log(1/δ))/ε^2) to ensure that, with probability ≥ 1−δ, the output is an ε-winner. This follows by a two-point method on instances differing by pairwise margin 2ε while keeping the first-round elimination unchanged; distinguishing these requires Ω(1/ε^2) samples by Hoeffding/Le Cam.\n- K dependence: At least Ω((log K)/ε^2) samples are necessary for the natural algorithm by hiding the critical constraint among Θ(K) (or Θ(K^2)) possible comparisons and applying a union bound adversarially. A formal construction will be provided; intuitively, with m too small, some constraint along the sample’s elimination path will have empirical slack inflated by ≈ε, producing a non-ε-winner with constant probability.\n\n# Examples / sanity checks\n- K=3 toy profile: First-choice shares: e: 0.29, other: 0.35, c: 0.36; pairwise m_{c,other}(P) = 0.02 = ε. With ε-additions all ranking c ≻ other ≻ e, c wins; our condition captures this.\n- K=4: If S has all d_{r,y}(S) ≥ 2ε and m large enough for uniform ε accuracy, then setting Q to σ-order ballots suffices to preserve all inequalities in P'. Try to break: pick a round r and a y ≠ y_r; d_{r,y}(Q)=0, so P must carry the inequality unaided; but we ensured d_{r,y}(P) ≥ ε, which scales to (1−ε)ε > 0, so not broken.\n\n# Obstacles / gaps\n- Tightness of the K factor in the upper bound: we used log U = Θ(K) to get m = O((K + log 1/δ)/ε^2), but we did not supply a matching Ω(K/ε^2) lower bound. Constructing such a lower bound for the natural algorithm remains open here.\n- The certificate requires that the sample margins along its own path are ≥ 2ε. The natural algorithm might sometimes produce small margins; then the guarantee is vacuous though the algorithm could still succeed. Deriving a bound that does not condition on empirical slack could be possible via stability parameters of P, but is not yet developed here.\n\n# Next steps\n- Formalize and write a complete proof for the general K certificate (with explicit algebra for d_{r,y}(P') and the choice of Q), and the concentration bound using U = K(K−1)2^{K−2}.\n- Prove a K=3 lower bound instance rigorously via Le Cam’s method to pin down the constant in Ω((log 1/δ)/ε^2).\n- Attempt a general lower bound Ω((log K + log 1/δ)/ε^2) for the natural algorithm by constructing a hard family in which exactly one round’s critical inequality is within ε and is uniformly hidden among Θ(K) options.\n- Explore whether the log U argument can be sharpened (e.g., via symmetrization or chaining) to replace K by log K in the upper bound, or prove that Θ(K) is necessary.\n\n# Gaps relative to “Current Output”\n- No output.md exists yet; the above provides concrete, testable propositions for K=3 and a general certificate, plus a clean sample complexity upper bound m = O((K + log 1/δ)/ε^2) under an empirical slack condition.\n"
}