{
  "summary_md": "This round analyzed sample complexity and certificates for finding an ε-winner under IRV. Main positive result: for K=3, running IRV on m ≥ (2/ε^2)·ln(18/δ) i.i.d. ballots yields the sample winner ĉ which is an ε-winner with probability ≥1−δ (Hoeffding + union bound over 9 top-of-set events). We proved a correct uniform sufficient certificate: if for every S⊇{c}, p_c(S) ≥ min_{a∈S\\{c}} p_a(S) − ε then c is an ε-winner. We also found the previously proposed single-chain certificate is unsound for K≥4 (the elimination path after augmentation can visit sets off the chosen chain). Lower bounds: K=2 requires m = Ω((1/ε^2)·log(1/δ)); a Fano-type construction suggests m = Ω((log K)/ε^2) to identify a unique ε-winner among K (to be formalized). Two practical approaches were proposed—(i) one-phase uniform control (union bound over K·2^{K−1} top-of-set indicators, computationally exponential but adds only Θ(K) in the log factor of m), and (ii) a two-phase holdout max-deficit certificate (correct but computationally heavy). Citations: Research Notes; Current Proofs.",
  "highlights": [
    "K=3 upper bound: sample-and-run IRV succeeds with m ≥ (2/ε^2)·ln(18/δ) (Hoeffding + union bound over 9 events).",
    "Uniform sufficient certificate: ∀S⊇{c}, p_c(S) ≥ min_{a∈S\\{c}} p_a(S) − ε implies c is an ε-winner.",
    "Single-chain certificate (checking only one elimination chain) is not sound for K≥4; counterexamples/paths can escape the chain.",
    "Controlling all top-of-set frequencies requires union bound over K·2^{K−1} indicators—exponential computation, but sample-size penalty is Θ(K) via the log.",
    "Lower bounds: K=2 needs m = Ω((1/ε^2)·log(1/δ)); Fano suggests m = Ω((log K)/ε^2) for distinguishing a unique ε-winner.",
    "Two-phase holdout (max-deficit over S) gives a verifiable certificate but may be computationally expensive."
  ],
  "next_questions": [
    "Provide an explicit minimal counterexample showing failure of the single-chain certificate for K≥4 (or identify sufficient extra conditions to make it sound).",
    "Finalize the K=3 theorem: handle tie-breaking, precise constants, and a fully rigorous statement and proof.",
    "Formalize the Fano lower bound for general K and tighten upper bounds for the natural algorithm (analyze one-phase uniform control vs two-phase holdout)."
  ]
}