{
  "summary_md": "Round X (last round) — concise summary\n- Problem: decide/produce a reachable allocation on a tree that is globally Pareto-efficient (TREE-REACHABLE-PE).\n- Proven building blocks: any reachable allocation is individually rational (IR); reachability to a fixed target on a tree is decidable in O(n^2) (good-edge scheduler) and produces a witness; global PO of an allocation is testable in O(n^2) via the improvement-digraph (PO ⇔ no directed cycle). Hence TREE-REACHABLE-PE ∈ NP (certificate = target allocation).\n- TTC (Top Trading Cycles) is globally PO, so testing TTC reachability gives a one-sided polynomial certificate (if reachable, YES). However a 3-agent counterexample shows PO ≠ core, so TTC is not guaranteed to be the unique IR+PO outcome — the critical claim “IR+PO ⇒ TTC” remains unproven and is the decisive open pivot.\nNext actions: prove or refute IR+PO⇒TTC (or find small counterexamples), run small-instance enumeration (n≤6), and/or develop a treewidth DP (FPT) or other parameterized algorithm.\nCitations: papers/paper1.txt; research notes (round X).",
  "one_line_summary": "TREE-REACHABLE-PE ∈ NP; TTC gives a one-sided certificate but IR+PO⇒TTC is unresolved.",
  "highlights": [
    "Reachable ⇒ individually rational (IR).",
    "Target reachability on trees decidable in O(n^2) with witness (good-edge scheduler).",
    "Global PO test via improvement-digraph (cycle detection) in O(n^2).",
    "Hence TREE-REACHABLE-PE is in NP (certificate = target allocation).",
    "TTC is globally PO and a one-sided poly-time certificate if reachable, but PO≠core (counterexample), so TTC need not be the unique IR+PO allocation.",
    "Parametric/algorithmic notes: naive 'k movers' enumeration is XP (O(n^k·k!·poly(n))); promising directions are FPT-by-treewidth DP or small-instance search for counterexamples."
  ],
  "next_questions": [
    "Prove or find a counterexample to the key pivot: does IR + global-PO imply the TTC outcome on trees?",
    "Exhaustively search small instances (n≤6–7) for reachable IR+PO allocations ≠ TTC and for structural patterns.",
    "If pivot remains unresolved, implement a DP over a nice tree decomposition (store partial injections + reachability/PO flags) to obtain an FPT algorithm in treewidth."
  ]
}