{
  "content": "New, auditable contributions toward Conjectures 1 and 2\n\nClaims recorded here are self-contained and ready to be curated into notes/proofs.\n\nA) π-transfer and Baire status for the unrooted space (Conj. 1)\n\n- Lemma A1 (π is continuous, open, surjective; Y is Baire).\nLet X=𝔾_{\\bullet,D} with the Benjamini–Schramm topology τ_• and Y the unrooted space with the rootless-local topology τ₀ generated by cylinders U_F^Y={G∈Y: ∃v, B_r(G,v)≅F}. The forgetful map π:X→Y, π(G,ρ)=G, satisfies: π is continuous (π^{-1}(U_F^Y)=⋃_{rootings F′ of F} 𝔾_{\\bullet}^{F′} open), open (π maps rooted cylinders onto rootless cylinders), and surjective. Since X is Baire (indeed compact metric), Y is Baire as a continuous open image of a Baire space (Oxtoby).\n- Proposition A2 (Root-invariance via π).\nFor any A⊆Y, A is nowhere dense in (Y,τ₀) iff π^{-1}(A) is nowhere dense in (X,τ_•). If A has the Baire property (e.g., Borel/analytic), then A is meagre in Y iff π^{-1}(A) is meagre in X.\nReason: continuity+openness yield int(cl(π^{-1}(A)))⊆π^{-1}(int(cl(A))). Meagreness transfers via dense G_δ witnesses and openness.\nUse: Resolves Conjecture 1 for nowhere denseness (all A) and meagreness for BP sets.\n\nB) Finite pinning frameworks (FLP/FPP) and gadgets (Conj. 2 no-go)\n\n- Definitions.\nFLP (finite-lens property): every nonempty open O contains a multi-ball cylinder W(M) that pins the radius-r neighborhoods of finitely many marked vertices. FPP (finite pinning property): every nonempty open O contains some FLP-cylinder W(M)⊆O.\n- Theorem B1 (Bridgeless nowhere dense under FLP; ≤D and =D odd).\nFor D≥3, in any FLP metric on 𝔾_{\\bullet,≤D}, BrFree is nowhere dense by pinning a leaf z at a boundary vertex b with residual capacity, forcing bz to be a bridge in all completions. For 𝔾_{\\bullet,=D} with odd D, use the explicit pinned seed S: take K_{D+2} with vertices x,a,b,W (|W|=D−1), delete xa,xb and a perfect matching on W. Then deg_S(x)=D−1, others D, S connected. Pin all radius-1 neighborhoods of S far from any marks. In any D-regular completion exactly one cross edge must attach to x, hence that edge is a bridge. Thus BrFree is nowhere dense.\n- Proposition B2 (Even-D regular: NoCut nowhere dense under FLP/FPP).\nFor even D≥4, pin S′: start from K_{D,D} on A∪B, pick x∈A and y₁,y₂∈B; delete x−y₁,x−y₂ and add y₁−y₂. Then deg_{S′}(x)=D−2, others D, and S′ connected. Pin radius-1 neighborhoods. In any D-regular completion all cross edges are forced through x; removing x disconnects, so “no cut vertex” is nowhere dense.\n- Proposition B3 (Refinement monotonicity).\nIf τ₂ refines τ₁ and S is nowhere dense in (X,τ₁), then S is nowhere dense in (X,τ₂). Thus no finer metric can make BrFree typical.\n\nC) Unrooted space Y: bridgeless remains small; occurrence pullbacks (Conj. 2, extended no-go)\n\n- Proposition C1 (BrFree is nowhere dense in Y for ≤D and =D odd).\nGiven any nonempty rootless cylinder U_F^Y, refine to U_{F′}^Y by embedding the same finite pinned gadgets entirely inside F′ (far from the center), ensuring a bridge in every completion. Hence BrFree is nowhere dense in (Y,τ₀).\n- Corollary C2 (Occurrence-pullback topologies on X).\nFor τ_occ generated by Occ(F)=π^{-1}(U_F^Y), BrFree is nowhere dense; thus any root-insensitive occurrence-based metric cannot make BrFree typical.\n\nD) Even-regular classification: bridgeless is typical (new crisp theorem)\n\n- Theorem D1 (Even D-regular, D≥4: BrFree is comeagre in X and Y).\nIn 𝔾_{\\bullet,=D} with even D≥4, 1-way infinite bridges are parity-forbidden (a finite side S would give |δ(S)|≡D|S| (mod 2)=0, contradicting |δ(S)|=1). By Theorem 16, graphs with a 2-way infinite bridge form a meagre (but not nowhere dense) subset. Therefore the complement BrFree is comeagre in both the rooted space X and the unrooted space Y (by π-transfer for BP sets and Y’s Baire property).\n\nE) Bridgeless vs. 2-way bridges: technique underlying Theorem 16 (supporting lemma)\n\n- Lemma E1 (Eliminating bridges near the root by 2-edge-connected replacements).\nFix k and D>2. For any cylinder 𝔾_{\\bullet}^{F}, refine to 𝔾_{\\bullet}^{F′} by replacing each edge of the k-ball by a 2-edge-connected Θ-gadget (three internally disjoint length-≥2 paths) whose attachments preserve degrees (use internal degree-regularization within the gadget). Then no edge within distance ≤k is a bridge in any completion, and the refinement remains nonempty. Hence “has a 2-way infinite bridge at distance ≤k” is nowhere dense; meagreness follows by a countable union over k.\nWhy useful: Canonical method to prove Theorem 16’s “nowhere dense per k” step while respecting degree bounds.\n\nF) Bounded re-rooting invariance for section metrics (robustness)\n\n- Lemma F1 (Uniformly bounded re-rooting gives homeomorphic section metrics).\nIf root selectors s,t:Y→X satisfy dist_G(s(G),t(G))≤K uniformly, then id:(Y,d_s)→(Y,d_t) is a homeomorphism; indeed d_t≤2^{K}d_s and d_s≤2^{K}d_t. Thus typicality is invariant under bounded root changes.\n\nExamples\n\n- D=3 (odd): Take K_5 with vertices x,a,b,w₁,w₂; delete xa, xb, and w₁w₂. Pin radius-1. Only x has residual capacity, forcing exactly one cross edge and hence a bridge in every 3-regular completion.\n- D=4 (even): In K_{4,4} with parts A,B, pick x∈A and y₁,y₂∈B; delete x−y₁,x−y₂; add y₁−y₂; pin radius-1. Only x can accept external edges; removing x disconnects → cut vertex.\n\nObstacles and cautions\n\n- Meagreness equivalence via π requires BP; we avoid claims for arbitrary A⊆Y.\n- Any metric/topology with FPP/FLP (and any finer topology) cannot make BrFree typical. A positive answer to Conjecture 2 would require a natural, Baire, non-FPP metric.\n\nNext steps\n\n- Move Lemma A1 and Proposition A2 to proofs.md (settles Conjecture 1 in the intended scope).\n- Add Theorem D1 (even-regular: BrFree comeagre) to proofs.md and output.md.\n- Include detailed pinning proofs of Theorem B1 and Proposition B2 (explicit gadgets with degree checks) and Lemma E1 (Θ-replacement scheme) in proofs.md.\n- Explore non-FPP, Baire metrics (e.g., end-structure/topological end-refinement) and test the category of BrFree therein; either produce a candidate where BrFree is comeagre or extend the no-go.\n"
}