{
  "content": "Ideas\n- Establish an upper bound h(G) ≤ pw(G)+1 via a coupling to classical node-search. This yields immediate n^{O(1)} recognition for fixed k on graphs with pathwidth ≤ k−1, and more generally an FPT acceptance test in k.\n- Strengthen bounds for sparse classes: prove that every cactus graph satisfies h(G) ≤ 3 by a constructive DFS-style schedule using two “anchors” plus one sweeper. This improves over the generic fvs+1 bound when the number of cycles is large.\n- Formalize the least-fixpoint characterization of “winnable” state sets and prove downward-closure; this supports DP designs (over decompositions) that carry only antichains of boundary states.\n\nFixpoint view and downward-closure\nDefine the one-step successor operator on subsets R⊆V by Succ_k(R):={ N(R)\\S : S⊆V, |S|≤k }. Let Good_k be the least set family containing ∅ and closed under the rule X∈Good_k if ∃S with |S|≤k and N(X)\\S ∈ Good_k. Equivalently, Good_k = ⋃_{t≥0} G_t where G_0={∅} and G_{t+1}={ X : ∃S, |S|≤k, N(X)\\S ∈ G_t }.\n- Lemma 1 (Downward-closure). Good_k is downward-closed: if X∈Good_k and Y⊆X then Y∈Good_k.\nProof. By induction on the level t where X∈G_t. For t=0, X=∅ and the claim is trivial. For t>0, X∈G_t means ∃S s.t. N(X)\\S ∈ G_{t−1}. For Y⊆X we have N(Y)⊆N(X), so N(Y)\\S ⊆ N(X)\\S. By IH and downward-closure of G_{t−1}, N(Y)\\S ∈ G_{t−1}, hence Y∈G_t. ∎\n- Observation. h(G)≤k iff V∈Good_k.\nThis recasts decision into membership of V in the least fixpoint of a monotone operator; the downward-closure supports antichain-based DP representations on decompositions (next steps).\n\nUpper bound via node-search and pathwidth\nWe use the classical invisible fast robber node-search game: at each discrete time i, a set S_i of occupied vertices is chosen (|S_i| bounded by s), and the robber, moving arbitrarily fast along paths avoiding S_i, must eventually be placed upon by a searcher. Let C_i be the set of vertices the robber might occupy at time i under schedule S_1,…,S_i. One standard formulation yields C_1=V\\S_1 and C_{i+1} = reach_{G\\S_{i+1}}(C_i), where reach takes the union of connected components intersecting C_i.\n- Lemma 2 (Coupling). Given any node-search schedule (S_i) with |S_i|≤s and C_T=∅, the same sequence (S_i) is a winning hunters schedule with k=s: defining R_1=V\\S_1 and R_{i+1}=N(R_i)\\S_{i+1}, we have R_i⊆C_i for all i, hence R_T=∅.\nProof. Induction: R_1=C_1. If R_i⊆C_i, then R_{i+1}=N(R_i)\\S_{i+1} ⊆ N(C_i)\\S_{i+1} ⊆ reach_{G\\S_{i+1}}(C_i)=C_{i+1}. ∎\n- Theorem 3 (Pathwidth bound). h(G) ≤ pw(G)+1.\nProof. It is known that the node-search number equals pw(G)+1 and that there is a monotone capturing schedule with s=pw(G)+1 searchers (see, e.g., Kinnersley (1992), Fomin–Thilikos (2008)). Apply Lemma 2. ∎\nCorollaries.\n- Series–parallel graphs (tw≤2 ⇒ pw≤2): h(G) ≤ 3. Outerplanar graphs also have pw≤2, hence h≤3.\n- For fixed k, deciding h(G)≤k is polynomial-time on the class pw(G)≤k−1 (use any FPT test for pw≤k−1 and accept).\n\nCactus graphs: a constructive 3-hunter strategy\nLet G be a connected cactus graph (each block is a cycle or an edge; blocks form a tree via articulation vertices).\n- Theorem 4. h(G) ≤ 3.\nProof (constructive; invariant-based). Root the block–cut tree at an arbitrary articulation r. We maintain a DFS invariant: at any time we keep two “anchors” a,b (both shot every round), which are articulation vertices lying in the current block B on the DFS path (for the root, set a=r and choose b an articulation of the root block; if the root block is an edge {r,b}, pick its other endpoint). The third hunter (the sweeper) operates within B\\{a,b} and possibly within child subtrees when descending. We use two primitives:\n(1) Block cleaning. For an edge-block B={x,y}, if {x,y} are the two anchors, nothing remains to clean. For a cycle-block B containing anchors a,b, the subgraph B\\{a,b} is a disjoint union of two paths P_1,P_2 whose endpoints are a,b. Keeping a and b permanently shot, the third hunter performs a 1-hunter sweep on P_1 then on P_2 (forests admit 1-hunter capture). During this, any evasion flow between B’s “parent side” and “child sides” must traverse a or b, which are blocked each round, preventing recontamination across these cuts.\n(2) Anchor handover. Suppose B has been cleaned. To descend into a child block B′ attached at articulation b, pick an articulation b′∈B′ adjacent to b (if B′ is an edge, take its other endpoint; if B′ is a cycle, pick any neighbor of b along the cycle). In the next rounds, we switch anchors from {a,b} to {b,b′}: since b lies on every path from below B′ to above a, maintaining b blocked preserves separation; therefore releasing a is safe once b′ is established as the second anchor. The sweeper is idle during the single round when anchors change; no contamination can bypass b.\nProceed by DFS: at each block, perform (1); then for each child block, perform (2) to descend, and recurse. On backtracking from a child subtree rooted at b′, reverse the handover to re-establish anchors {a,b} in B (again safe by the same separator argument). Since the block–cut tree is finite, this process terminates; at leaves, after block cleaning no child remains, and recursive returns propagate. Because at every stage any movement between already processed parts and unprocessed parts is cut by currently shot anchors, no recontamination reaches cleaned areas. Eventually the sweeper clears the unique subtree containing the evader, and capture occurs. ∎\nRemarks. The proof makes essential use of the cactus property (blocks are cycles/edges; separators are single articulations). We do not claim tightness of 3; whether all cactus graphs satisfy h(G)=2 remains open. The DFS scheme above immediately yields h(G)≤3·cc(BCT) in schedule length O(n).\n\nCut-vertex composition (tight bounds)\nLet a be a cut vertex of G and C_1,…,C_m the vertex sets of the components of G−a.\n- Lemma 5. max_i h(G[C_i∪{a}]) ≤ h(G) ≤ 1 + max_i h(G[C_i∪{a}]).\nProof. Lower bound by subgraph monotonicity. Upper bound: permanently shoot a and run, component by component, a winning schedule inside G[C_i] (1-hunter suffices for trees; use appropriate k for general), which is independent across components since a blocks traversal. ∎\n\nExamples\n- Series–parallel ladder L_n: pw(L_n)=2, hence h(L_n)≤3. Degeneracy=2, so 2≤h(L_n)≤3.\n- “Dumbbell” C_ℓ—P_m—C_r: By Theorem 3, h≤3. Our 2-hunter attempt with a moving anchor may recontaminate; enumerating minimal obstructions for h≤2 on small n will clarify whether some dumbbells require 3.\n\nObstacles\n- Exact DP for h≤k on general tw-bounded graphs: while Good_k is downward-closed and amenable to antichain compression on a bag, we still need a clean interface condition to compose subgraphs across introduce/forget/join nodes. A precise state, likely a family of “locally winnable” boundary subsets closed under one-step Pre_k, must be designed and its width bounded by a function of (k,tw).\n- Tightness on cactus and outerplanar graphs: whether h≤2 always (or characterize when h=3) remains unsettled.\n\nNext steps\n1) Promote Theorem 3 (h≤pw+1) and Lemma 2 (coupling) to proofs.md with citations; add corollaries for pw≤2 classes.\n2) Formalize Theorem 4’s DFS invariant with explicit R-evolution inequalities at handover rounds, and test on generated cactus instances up to n=14; search for a cactus with h=3 to probe tightness.\n3) Design a DP state for nice tree decompositions: per bag B, carry an antichain F_B⊆2^B such that X∈F_B iff X is “good” for the partial graph with boundary B under k; derive introduce/forget/join transitions using the Good_k one-step rule and prove F_B sizes bounded by f(k,|B|).\n4) Enumerate minimal obstructions for h≤2 up to n=10 via the 2^V-state BFS to guide cactus/outerplanar conjectures.\n\nSummary of new rigor\n- Good_k fixpoint with downward-closure (Lemma 1).\n- Coupling to node-search implies h(G) ≤ pw(G)+1 (Theorem 3) and yields polynomial-time recognition for fixed k on pw≤k−1 classes.\n- Constructive schedule showing every cactus graph satisfies h(G)≤3 (Theorem 4) via two permanent anchors plus a 1-hunter sweeper and safe anchor handovers.\n- Cut-vertex composition bounds (Lemma 5) provide tight local reductions and support a block–cut DP agenda."
}