{
  "feedback_md": "Highlights: we now have solid, reusable tools (permanent blockers; disjoint-union law; separator/cut-vertex composition), exact solutions for cycles and unicyclic graphs (h=2), and strong structural upper bounds (h ≤ pw+1). The periodic time-lift criterion is correct and useful for verifying families of schedules. For cacti, a full h=2 classification remains unproven; a 3-hunter constructive strategy on general cacti is plausible and consistent with node-search bounds, but needs a fully formal invariant. Below are targeted critiques and next steps.\n\nProver 1: Targeted funneling on trees is consistent with the proven k=1 forest result and is likely correct. Anchor-transfer Lemma needs a missing precondition: at transfer time i, require a ∉ R_i (i.e., the old anchor is shot at time i); otherwise neighbors of a outside H may enter R_{i+1}. With this fix, the “necklace” (block–cut path of cycles) theorem is credible. The periodic-lift criterion is correct. Next: formalize the corrected anchor-transfer lemma and provide a complete necklace proof with explicit invariants; implement a linear-time schedule constructor.\n\nProver 2: The vertex-expansion bound “ι(G) ≥ k ⇒ h ≥ k+1” is valid but does not strengthen the minimum-degree lower bound (since ι ≤ δ−1). Keep it as a NO-filter but correct the remark. The periodic schedule criterion and FVS-based constructive bound (h ≤ fvs+1) are sound. The separator composition lemma is useful; formalize it carefully (no U–W edges, shoot S each round). Next: pursue bounds on the period p as a function of k (even for k=2) to enable n^{O(k)} search via the lift.\n\nProver 3: The Good_k least-fixpoint and downward-closure are correct and valuable for DP design. The coupling to node-search implies h ≤ pw+1; this is rigorous, with standard citations (Kinnersley; Fomin–Thilikos). The constructive 3-hunter schedule for cacti is promising; tighten the proof by specifying the anchor handover round(s) and verifying R-evolution inequalities at each step. Next: promote h ≤ pw+1 to proofs.md and refine the cactus proof to publication-level detail or extract a minimal 3-hunter-needed cactus.\n\nProver 4: The cactus h=2 elimination-by-leaf-block phases is flawed: once you stop shooting the attachment vertex a, previously “cleared” blocks can be recontaminated via a in later phases. To fix, maintain a global barrier invariant (as in the necklace proof) or use two permanent anchors plus a sweeper (yielding h ≤ 3). Your pendant-tree and leaf-cycle elimination lemmas are correct as schedule segments but require barrier maintenance to prevent recontamination. Next: either adopt the two-anchor framework or restrict to necklaces where a single anchor suffices.\n\nGlobal next steps: (1) Add to proofs.md the periodic-lift criterion, h ≤ pw+1 via node-search, and the separator composition lemma. (2) Finish a fully formal necklace h=2 proof. (3) For general cacti, either prove h=2 with a robust anchor-transfer invariant or settle for a rigorous h ≤ 3 with two anchors + sweeper. (4) Build an n^{O(k)} YES-procedure on fvs ≤ k−1 and implement it. (5) Investigate period bounds p=f(k) to turn the time-lift into an XP algorithm for fixed k.",
  "summary_md": "We consolidated core tools, proved h(C_n)=2 and h(unicyclic)=2 via permanent blockers, and added a separator composition rule. We validated a periodic time-lift criterion and established h(G) ≤ pw(G)+1 via coupling to node-search. A claimed h=2 for all cacti is not yet correct; recontamination must be prevented. A 3-hunter constructive strategy on cacti appears feasible. Next: formalize necklace h=2, add periodic-lift and h ≤ pw+1 to proofs.md, implement an n^{O(k)} YES-procedure for fvs ≤ k−1, and pursue cactus (h=2 or h≤3) and period bounds.",
  "verdict": "uncertain",
  "blocking_issues": [
    "No general n^{O(k)} recognition algorithm or hardness for fixed k≥2",
    "Cactus h=2 claim requires a correct global barrier invariant; current leaf-elimination proof recontaminates",
    "Anchor-transfer lemma needs the precondition a ∉ R_i at transfer time",
    "Period bound p=f(k) for periodic schedules is unknown; without it, time-lift yields no general XP algorithm",
    "Vertex-expansion remark overstated; bound is weaker than min-degree and needs correction in presentation"
  ],
  "per_prover": [
    {
      "prover_id": "01",
      "brief_feedback": "Good: periodic-lift, necklace strategy, and tree funneling. Fix the anchor-transfer lemma by requiring the old anchor is absent (shot) at transfer time; then fully formalize the necklace proof with invariants.",
      "score": "promising"
    },
    {
      "prover_id": "02",
      "brief_feedback": "Valid periodic-lift and FVS schedule; correct the claim that expansion strengthens min-degree (it does not). Pursue period bounds and small-FVS recognizers.",
      "score": "promising"
    },
    {
      "prover_id": "03",
      "brief_feedback": "Strong: h ≤ pw+1 via node-search and fixpoint downward-closure. Cactus h≤3 plan is plausible; formalize anchor handovers and R-evolution rigorously.",
      "score": "promising"
    },
    {
      "prover_id": "04",
      "brief_feedback": "Leaf-block elimination with two hunters allows recontamination once the anchor is released; h=2 for all cacti is not established. Rework with persistent barriers (two anchors) or restrict to necklaces.",
      "score": "uncertain"
    }
  ],
  "notes_update": {
    "action": "append",
    "content": "New tools and results\n- Periodic schedules: A period-p schedule (S_1,…,S_p) repeated is winning iff the time-lift L_p on V×[p], after removing layer-shot vertices, is acyclic. If acyclic, capture occurs within ≤ p·|V| rounds. This enables verification of periodic strategies by finite DAG checks.\n- Pathwidth upper bound: h(G) ≤ pw(G)+1, via coupling to classical node-search (Kinnersley 1992; Fomin–Thilikos 2008). Consequently, for classes with pw≤k−1 we can accept h≤k in polytime.\n- Separator composition: If V=U⊔W⊔S with no U–W edges, then h(G) ≤ |S| + max{h(G[U∪S]), h(G[W∪S])} by permanently shooting S. This generalizes the cut-vertex reduction.\n- Cacti: Necklaces (block–cut path of cycles with pendant trees) are plausibly 2-hunter via a maintained anchor and safe transfers; general cacti admit a constructive 3-hunter strategy using two permanent anchors plus one sweeper; whether all cacti have h=2 remains open.\n\nCorrections and cautions\n- Vertex-expansion lower bound: ι(G):=min_{∅≠X}(|N(X)|−|X|). The implication ι(G)≥k ⇒ h(G)≥k+1 is valid, but it does not strengthen the min-degree bound since ι≤δ−1. Use it as a NO-filter only.\n- Anchor transfer: To transfer an anchor from a to b across a cut, require a ∉ R_i at the transfer time i. Otherwise neighbors of a outside the intended side may enter R_{i+1}.\n- Cactus h=2 by leaf-block pruning fails without persistent barriers: releasing the attachment vertex later can reintroduce cleared blocks. Maintain a global barrier invariant (e.g., a current anchor) as in the necklace setup, or use two anchors + one sweeper (h≤3).\n\nNext steps\n- Formalize and prove: periodic-lift criterion; h ≤ pw+1; corrected anchor-transfer lemma; necklace h=2. \n- Implement n^{O(k)} YES-recognizer for graphs with fvs≤k−1 (enumerate blockers; run forest schedule), and a block–cut DP prototype.\n- Investigate period bounds p=f(k) and cactus tightness (h=2 vs h=3) via small counterexample search."
  },
  "proofs_update": {
    "action": "append",
    "content": "Lemma (Periodic time-lift criterion). Fix p≥1 and a sequence (S_1,…,S_p) with |S_i|≤k, extended periodically by S_{i+p}=S_i. Build the directed graph L_p with vertex set V×[p] and arcs (u,i)→(v,i+1 mod p) for each edge uv∈E(G). Delete all nodes (v,i) with v∈S_i. Then the periodic schedule is winning (i.e., R_T=∅ for some T) if and only if the remaining digraph is acyclic. Moreover, if acyclic then T≤p·|V|.\nProof. If a directed cycle exists, its projection yields an infinite walk in G avoiding shots, contradicting winning. If acyclic, topologically order L_p; at each round the maximum topological level attained by any member of R strictly decreases modulo p, so within at most |V|·p rounds R becomes empty. ∎\n\nLemma (Separator composition). Let V=U⊔W⊔S with no edges between U and W. Then h(G) ≤ |S| + max{h(G[U∪S]), h(G[W∪S])}.\nProof. Permanently shoot S using |S| hunters. Any avoiding walk stays entirely in U∪S or entirely in W∪S. With the remaining hunters (at most k−|S|), run a winning schedule on the side with larger evasion number while the other side uses empty shots; then switch sides if needed. By the disjoint-union law, this captures all walks. ∎\n\nTheorem (Pathwidth bound). For every graph G, h(G) ≤ pw(G)+1.\nProof. In the invisible fast robber node-search game, there exists a monotone capturing schedule with s=pw(G)+1 searchers (Kinnersley 1992; see also Fomin–Thilikos 2008). Let C_i denote the robber’s possible positions: C_1=V\\S_1 and C_{i+1}=reach_{G\\S_{i+1}}(C_i). For the hunters’ R-evolution R_1=V\\S_1 and R_{i+1}=N(R_i)\\S_{i+1}, we have R_i⊆C_i by induction: R_{i+1}⊆N(C_i)\\S_{i+1}⊆reach_{G\\S_{i+1}}(C_i)=C_{i+1}. Thus if C_T=∅ then R_T=∅, proving that the same sequence (S_i) is a winning hunters schedule with k=s. Hence h(G)≤pw(G)+1. ∎"
  },
  "output_update": null
}