{
  "content": "New, testable progress on Conjectures 1 and 2\n\nOverview\n\n- We finalize rigorous transfer tools for Conjecture 1 via the forgetful map π and record a short proof that the unrooted space Y is Baire.\n- We strengthen the no‑go region for Conjecture 2 to all ball‑local topologies by giving explicit, degree‑respecting gadgets (odd‑D bridge forcing; even‑D cut‑vertex forcing).\n- We correct and formalize the “local exclusion” step used in Theorem 16 (nowhere denseness of “2‑way infinite bridge at distance ≤ k”) via edge‑replacement 2‑terminal gadgets (works in both ≤D and =D cases).\n\nA. Forgetful map, Baire property, and meagre/nowhere‑dense transfer (Conjecture 1)\n\nSpaces and map.\n- X=G_{\\bullet,D}: rooted, countably infinite, connected graphs with maximum degree ≤D or =D, under the Benjamini–Schramm topology generated by cylinders G_\\bullet^F.\n- Y=G_{\\varnothing,D}: unrooted counterpart with rootless‑local topology generated by U_F^Y={G: ∃v B_r(G,v)≅F}.\n- π:X→Y given by π(G,ρ)=G.\n\nLemma A1. π is continuous, open, and surjective, with π(G_\\bullet^F)=U_F^Y and π^{-1}(U_F^Y)=G_\\bullet^F.\n\nLemma A2 (closure/interior commute with π^{-1}). For all A⊆Y: cl_X π^{-1}(A)=π^{-1}(cl_Y A) and int_X π^{-1}(A)=π^{-1}(int_Y A).\nProof. As in prior rounds; openness of π gives the reverse inclusion in closures by a standard neighborhood‑lifting argument; interiors follow by complementing.\n\nProposition A3 (nowhere denseness equivalence). For any A⊆Y, A is nowhere dense in Y iff π^{-1}(A) is nowhere dense in X.\nProof. Use int cl identities and surjectivity.\n\nProposition A4 (meagre equivalence for Baire‑property sets). If A⊆Y has the Baire property, then A is meagre in Y iff π^{-1}(A) is meagre in X.\nProof. “⇒” by A3 and countable unions. For “⇐”, if π^{-1}(A) is meagre but A is not, there exists nonempty open V⊂Y with A comeagre in V; then π^{-1}(V) is nonempty open in X and π^{-1}(A) is comeagre in π^{-1}(V), contradiction in Baire X.\n\nLemma A5 (Y is Baire). X is compact (hence Baire) for bounded degree (standard in local convergence theory). Since π is open, continuous, onto, Y is Baire: if Y=⋃_n N_n with N_n nowhere dense, then X=⋃_n π^{-1}(N_n) is meagre, impossible.\n\nCorollary A6 (Conjecture 1). For any unrooted property P and S_P=π^{-1}(T_P), smallness is root‑invariant: S_P nowhere dense in X iff T_P nowhere dense in Y; and if T_P has the Baire property (in particular Borel/analytic), S_P meagre in X iff T_P meagre in Y.\n\nRemark. Natural properties (bridges, cut vertices, chromatic constraints) are analytic/Borel as they are definable by countable Boolean combinations of cylinder conditions and thus have the Baire property.\n\nB. No‑go for ball‑local topologies (Conjecture 2)\n\nDefinition B1. A topology τ on X is ball‑local if {G_\\bullet^F} is a base for τ.\n\nTheorem B2. In any ball‑local topology on X, the conclusions of Theorems 14–17 persist. In particular, bridgeless graphs remain nowhere dense and cannot be typical in any ball‑local metric.\nProof. All proofs proceed by cylinder refinement F↦F′ that forces a local obstruction in every extension. Such refinements depend only on the extension poset of rooted finite balls and therefore work verbatim for any τ with the same base.\n\nC. Odd‑D regular: a compact parity gadget forcing a unique external edge\n\nFor a finite connected F, write S(F)=∑_{v∈V(F)}(D−deg_F(v))=D|V(F)|−2|E(F)|; in any D‑regular completion H⊇F, |δ_H(V(F))|=S(F). For odd D, S(F)≡|V(F)| mod 2.\n\nProposition C1. Let D odd ≥3 and let F=B_r(G,ρ) be any rooted r‑ball occurring in a D‑regular graph (as in G_{\\bullet,=D}). There exists r′>r and F′ (an r′‑ball), with max degree ≤D, such that S(F′)=1. Consequently, any D‑regular extension of F′ has exactly one edge leaving V(F′), which is a 1‑way infinite bridge.\nProof. Let L be the boundary of F, c=∑_{v∈L}(D−deg_F(v))≥|L|. Add a new layer W of t vertices at distance r+1; connect each v∈L to D−deg_F(v) distinct vertices in W (total c edges). Add e_W internal edges on W so that e_W=(Dt−c−1)/2; choose t≥c with t≡c+1 (mod 2) to make e_W integer and feasible within degree bounds (greedy construction yields simple graphs with prescribed e_W and degrees ≤D). Then S(F′)=Dt−(c+2e_W)=1; all vertices at distance ≤ r have degree D in F′, so F′ is an (r+1)‑ball. In any D‑regular completion H, exactly one edge leaves V(F′), a bridge with finite side V(F′). ∎\n\nD. Even‑D regular: an explicit cut‑vertex forcing gadget\n\nProposition D1. Let D even ≥4 and F=B_r(G,ρ) occur in some D‑regular graph. There exists a refinement F′ (an r′‑ball) with max degree ≤D and a vertex u∈V(F′) such that: (i) deg_{F′}(u)=D−2 and all other vertices in F′ have degree D; (ii) F′−u is connected. Consequently, in any D‑regular extension H⊇F′, both external edges of F′ attach to u, and u is a cut vertex of H.\n\nProof. Start with K_{D+2} and delete a fixed perfect matching M_1, obtaining a D‑regular connected graph R. Pick a vertex x; choose y,z so that yz∈M_1 (hence yz∉E(R)). Remove the edges xy,xz from R to obtain degrees deg(x)=D−2, deg(y)=deg(z)=D−1. Add the edge yz (previously absent in R) to restore deg(y)=deg(z)=D. All other vertices remain at degree D. Denote the resulting graph by R*. It is connected, and R*−x is connected. Now graft R* disjointly onto F at distance ≥r+1, and saturate all vertices within distance ≤r′ to preserve that all vertices in F′ except u:=x have degree D (routine: keep attachments strictly outside the chosen ball). Then S(F′)=2, so every D‑regular completion H adds exactly two external edges and they both must hit u. Removing u then disconnects H into (F′−u) and the outside, so u is a cut vertex. ∎\n\nE. Theorem 16: “2‑way infinite bridge within distance ≤k” is nowhere dense via edge‑replacement gadgets\n\nFor k∈\\mathbb{N}, let A_k be the set of rooted graphs (G,ρ) in X such that there exists a 2‑way infinite bridge at graph distance ≤k from ρ.\n\nProposition E1. Each A_k is nowhere dense in any ball‑local topology on X; consequently T_{2wb}=⋃_k A_k is meagre.\n\nProof. Fix a cylinder C=G_\\bullet^F and k. Let E_k be the set of edges of F with both endpoints at distance ≤k from the root. For each e=uv∈E_k, replace e inside F by a fixed 2‑terminal, 2‑edge‑connected gadget Θ as follows: delete uv; introduce a small gadget with two designated terminals s,t, and connect u to s and v to t (one edge each). Choose Θ so that (a) every edge of Θ lies on a cycle (e.g., two internally disjoint s–t paths), (b) internal degrees ≤3≤D (since D>2), and (c) the connections u–s and v–t are the only incidences with original vertices, preserving deg(u),deg(v). Do this simultaneously for all e∈E_k using pairwise disjoint gadgets placed beyond distance ≤k but within radius r′. The resulting refined r′‑ball F′ defines a cylinder C′⊂C. In any extension of F′, every edge originally at distance ≤k from the root has been replaced by edges of Θ that lie on cycles within Θ, hence cannot be bridges. Thus no 2‑way infinite bridge exists at distance ≤k. Therefore C′∩A_k=∅, proving A_k is nowhere dense. ∎\n\nRemark. The key correction is to replace edges by 2‑terminal gadgets rather than attach additional edges to saturated vertices; this preserves degrees of interior vertices while ensuring non‑bridgeness of all edges within distance ≤k in any extension.\n\nF. Bounded re‑rooting equivalence for section metrics\n\nLemma F1. If s,t:Y→X are sections with sup_G dist_G(s(G),t(G))≤R, then the identity (Y,d_s)→(Y,d_t) is a homeomorphism. In particular, typicality is invariant across such section metrics.\n\nProof. If B_r(G,s(G))≅B_r(H,s(H)), then B_{r−R}(G,t(G))≅B_{r−R}(H,t(H)) by moving roots at most R; this gives mutual continuity and inverse continuity.\n\nG. Notes toward Conjecture 2 under root‑insensitive topologies\n\n- The previously proposed re‑rooting pseudometric d_any does capture density phenomena (both bridgeful and bridgeless sets dense), but we have not yet established the triangle inequality nor Baire‑ness of the induced quotient. We therefore refrain from asserting metric properties here.\n- A promising alternative is the “occurrence pattern” topology on Y obtained by embedding G↦(1_{F occurs in G})_{F∈∪_r T_r}∈{0,1}^{∪_r T_r}, where T_r is the finite set of rooted r‑balls (degree‑bounded). This yields a compact, zero‑dimensional space; understanding the image subspace (closedness; Baire) and typicality of bridges there is a concrete next step. Caution: density results may fail for highly homogeneous graphs (e.g., D‑regular tree), since adding a 1‑way bridge may introduce new small ball types.\n\nExamples and checks\n\n- Odd D parity gadget C1 instantiated: D=3, take F any 3‑regular cylinder; choose t=c+1 (c=S(F)), then e_W=(3(c+1)−c−1)/2=c. Build W with t vertices and e_W=c edges so that degrees ≤3; possible for t large enough by a standard pairing argument.\n- Even D cut‑vertex gadget D1 instantiated: D=4, work inside K_6 minus one perfect matching to obtain a 4‑regular R. Choose x and y,z matched in the deleted matching; remove xy,xz and add yz to get deg(x)=2, others 4. Grafting yields a cylinder F′ whose every 4‑regular extension has a cut vertex u=x.\n\nNext steps\n\n- Move A3–A5 proofs to proofs.md to seal Conjecture 1 for all natural (Borel/analytic) properties.\n- Write the gadget‑based proofs C1, D1, and E1 formally with explicit Θ gadgets (e.g., two disjoint s–t paths of lengths 2 and 3), and degree checks for both ≤D and =D cases.\n- Choose an explicit root‑insensitive topology (occurrence pattern or a refined variant) and decide its Baire status. If Baire and both bridgeful and bridgeless sets are dense, neither can be comeagre, yielding a negative instance for “bridgeless typicality” under that topology. If non‑Baire, adjust to a complete metric variant.\n- For Conjecture 2 positive direction: seek a topology where bridgeless is comeagre by enforcing 2‑edge‑connectivity at all scales via basic opens; argue whether such a topology is too coarse (i.e., not Hausdorff) or fails to be natural.\n"
}