{
  "content": "Ideas\n\n- Conjecture 1: Close the loop with π:X→Y (forgetting the root). Prove Y is Baire via π being continuous and open and apply a direct category argument. This gives root‑invariance for nowhere denseness and, for Baire‑property sets, for meagreness.\n- Odd‑D gadget: Provide a fully layer‑respecting construction that forces a unique cross edge S(H)=1 and certify H is actually a rooted ball. This removes the remaining parity/regularity gaps.\n- Conjecture 2: Build a concrete, compact metric d_new on X that mixes the rooted local metric with a global “occurrence” component. Show that under d_new, bridgeless graphs are dense (hence not nowhere dense), while they are nowhere dense under d_•. This already exhibits a change in the nowhere‑dense collection; typicality (comeagre vs not) under d_new remains open. On the unrooted side, in the occurrence topology both “has a 1‑way bridge” and “bridgeless” are dense; since the space is Baire (by π), neither is typical there.\n\nUnrooted space, forgetful map, and Baire property\n\nLet X:=𝔾_{•,D} with Δ≤D (or =D) under d_•. Let Y be the unrooted space with the rootless local topology generated by U_Y(F):={G: ∃v B_r(G,v)≅F}. Define π:X→Y by π(G,ρ)=G.\n\nLemma A (π is continuous, open, surjective). For any rooted ball F, π(𝔾_{•}^F)=U_Y(F) and π^{-1}(U_Y(F))=𝔾_{•}^F.\n\nLemma B (X is compact metric; Y is Baire). X is compact (standard diagonal argument on rooted balls). π is continuous, open, surjective. If Y=⋃_n N_n with N_n nowhere dense, then X=⋃_n π^{-1}(N_n) is a countable union of nowhere dense sets in X (by the same equivalence used below), contradicting that X is Baire. Hence Y is Baire. (This uses that open continuous surjective images of Baire spaces are Baire.)\n\nProposition C (Transfer of nowhere denseness). For A⊆Y, A is nowhere dense in Y iff π^{-1}(A) is nowhere dense in X. Proof: As in earlier rounds—openness of π gives one direction; continuity and surjectivity give the other.\n\nProposition D (Meagreness for Baire‑property sets). If A⊆Y has the Baire property, then A is meagre in Y iff π^{-1}(A) is meagre in X. Proof: Pull back a nowhere‑dense cover; conversely, write A=UΔM with U open and M meagre; if π^{-1}(A) is meagre then π^{-1}(U) is meagre; X Baire ⇒ π^{-1}(U)=∅ ⇒ U=∅.\n\nCorollary E (Conjecture 1). For any Borel/analytic unrooted property P, the smallness (nowhere dense, meagre) of S_P=π^{-1}(T_P) is root‑independent.\n\nOdd‑D bridge forcing: fully pinned cylinder refinement\n\nNotation. For a finite connected rooted subgraph H (intended as a refined ball around the given root), define S(H):=∑_{v∈V(H)}(D−deg_H(v)). In any D‑regular extension, |δ(V(H))|=S(H). For odd D, S(H)≡|V(H)| (mod 2).\n\nGadgets.\n- Port creation: For a boundary vertex x (one with some neighbor outside H), attach d_x:=D−deg_H(x) disjoint 2‑edge paths x–a–b (new vertices), and then saturate a and b to degree D using only new edges within the layer outside H. This moves one unit of deficit from x to a new port b at distance +2, without changing S(H).\n- Pair closure: Given two ports b_i,b_j, embed them as the two degree‑(D−1) vertices of a copy of K_{D+1}−e placed entirely outside the current layer and add the missing edge inside the gadget. This consumes two units of deficit and saturates all new vertices to degree D; net effect S decreases by 2.\n- Parity flipper (odd D): Attach a new vertex z adjacent to two boundary vertices x,y; then saturate z to degree D with new edges placed outward. Net effect ΔS=D−4 is odd when D is odd.\n\nLemma F (Reduction to S=1 while preserving the ball structure). Let F be any rooted r‑ball occurring in a D‑regular graph with odd D>2. There exists a finite connected extension H⊇F built by outward gadgets such that S(H)=1 and H is itself a rooted r′‑ball (for some r′>r) of any D‑regular extension.\nProof. Start with H_0:=F. If S(H_0) is even, apply the parity flipper once. Repeatedly: port‑create at each boundary vertex until all original boundary vertices are saturated; while S>1, pair‑close two ports via disjoint copies of K_{D+1}−e placed in the next layer. All insertions attach only to the current boundary, hence no shortcuts to the root are created; distances of new vertices are strictly larger than the current boundary radius, so the outward boundary advances by a bounded amount each step. The process terminates with S=1 and all interior vertices saturated. The outward‑only wiring guarantees that H is a ball of some radius r′.\n\nProposition G (Odd‑D bridge forcing). In 𝔾_{•,=D} with odd D>2, given any cylinder 𝔾_{•}^F there is a refinement cylinder 𝔾_{•}^{F′} such that every D‑regular extension of F′ contains a (1‑way infinite) bridge. Proof. Take H from Lemma F, let F′ be its rooted ball. Any extension has |δ(V(H))|=1, so the unique cross edge is a bridge.\n\nEven‑D regular: cut vertex forcing\n\nLemma H (Even‑D cut‑vertex forcing). In 𝔾_{•,=D} with even D>2, given any cylinder 𝔾_{•}^F there is a refinement 𝔾_{•}^{F′} such that every D‑regular extension of F′ has a cut vertex. Proof sketch. As in the odd case, outwardly port‑create and pair‑close to saturate all boundary vertices except a designated c on the boundary. Route all remaining deficit to c by creating outward trees and saturating intermediate vertices so that all cross edges must be incident to c. Inside H, ensure removing c disconnects H into at least two nonempty blocks (prepare two 2‑edge‑connected blobs attached only to c). Then in any extension, removing c disconnects G. Layer‑respecting insertion guarantees F′ is a rooted ball.\n\nOccurrence topology on Y and density of bridges/bridgeless\n\nDefine Occ:Y→2^{𝔽} by Occ(G):={F∈𝔽: F occurs somewhere in G}. Equip 2^{𝔽} with the product discrete topology (Cantor space). Let 𝒯_occ be the pullback topology on Y via Occ, i.e., subbasic opens are “F occurs somewhere”. This is exactly the quotient topology from π (since π(𝔾_{•}^F)=U_Y(F)), hence 𝒯_occ is the rootless local topology. By Lemma B, (Y,𝒯_occ) is Baire.\n\nLemma I (Density of 1‑way bridges in (Y,𝒯_occ) for Δ≤D). Fix a nonempty basic open W=⋂_{i∈I}U_Y(F_i)⋂⋂_{j∈J}(Y\\U_Y(F′_j)). Let R be the maximum radius among F_i,F′_j. There exists G∈W with Δ≤D that has a 1‑way infinite bridge.\nProof (construction). Build a finite connected core C that realizes all F_i disjointly and avoids all F′_j within radius R around every vertex: choose C with girth >2R and design degrees ≤D, then embed the rooted patterns F_i into C far apart (this is possible since patterns and R are finite; use fresh vertices and local fillers to keep degrees ≤D; large girth ensures no F′_j appears). Choose a vertex y∈C with deg(y)<D (always possible since we control C). Construct a finite 2‑edge‑connected block S with girth >2R and degrees ≤D that also avoids all F′_j within radius R. Join S to C by a single new edge e=ys. Let K be any infinite Δ≤D extension glued to the rest of C (disjoint from S) that preserves avoidance of F′_j up to radius R (e.g., a large‑girth 2‑edge‑connected infinite backbone), and connect C to K far from y by one edge to ensure overall connectivity. The edge e is a bridge; one component (S and its interior) is finite, so e is 1‑way infinite. Occurrences of F_i persist, and by girth >2R no F′_j is created anywhere. Thus G∈W and has a 1‑way infinite bridge.\n\nLemma J (Density of bridgeless graphs in (Y,𝒯_occ) for Δ≤D). With W and R as above, there exists G∈W that is infinite, connected, bridgeless, with Δ≤D.\nProof (construction). Build C as in Lemma I to realize F_i and avoid F′_j up to radius R. Attach an infinite 2‑edge‑connected backbone B of girth >2R and degrees ≤D (e.g., an infinite ladder‑of‑ladders of maximum degree 3, then augment degrees by bounded local 2‑edge‑connected gadgets to meet any target ≤D), and connect C to B by two edge‑disjoint paths from distinct vertices of C with spare degree. The result is connected and bridgeless. Large girth ensures no F′_j appears; F_i persist by design.\n\nCorollary K. In (Y,𝒯_occ) both the sets B_1 (has a 1‑way infinite bridge) and B_0 (bridgeless) are dense. Since Y is Baire, neither is comeagre; thus bridgeless is not typical in 𝒯_occ.\n\nA compact alternative metric on X mixing local and occurrence information\n\nLet Z:=Occ(Y)⊆2^{𝔽} with the Cantor metric d_C (Z is compact metric). Define Φ:=Occ∘π:X→Z. Fix ε∈(0,1). Define a metric on X by\nd_new(x,y):= d_C(Φ(x),Φ(y)) + ε·d_•(x,y).\nThen (X,d_new) is compact (x↦(Φ(x),x) embeds X into Z×X; product is compact, sum metric induces subspace topology). In d_new, a neighborhood base at x is given by sets of the form V = π^{-1}(O_Z) ∩ U_{•}, where O_Z is a Cantor cylinder (finitely many occurrence/non‑occurrence constraints) and U_{•} is a small d_•‑ball.\n\nProposition L (Bridgeless is dense in (X,d_new) for Δ≤D). For any nonempty open V=π^{-1}(O_Z)∩U_{•}, there exists (G,ρ)∈V that is bridgeless.\nProof. Choose any unrooted G_Z∈Y with Occ(G_Z)∈O_Z satisfying the conclusion of Lemma J (this is possible since O_Z projects to a nonempty basic open in Y). Choose a root ρ in a region unaffected by the surgery (outside the finite d_• core used to define U_{•}) so that d_•‑closeness to the center point holds. Then (G_Z,ρ)∈V and G_Z is bridgeless.\n\nProposition M (Graphs with a 1‑way infinite bridge are dense in (X,d_new)). Analogous to Proposition L via Lemma I.\n\nRemarks.\n- Under d_•, bridgeless is nowhere dense (Theorem 14). Under d_new, it is dense (Proposition L), so the nowhere‑dense classification differs across these metrics. We leave open whether bridgeless is meagre or non‑meagre (and thus whether “typical” collections differ in the comeagre sense) under d_new; X is compact Baire under d_new.\n- The same constructions adapt to the D‑regular odd setting by using the parity/deficit gadgets inside the d_• core and placing the global modifications outward while keeping degrees exactly D via local fillers. For even D‑regular, replace “1‑way bridge” by forcing a cut vertex in the densification and use Lemma H to ensure the no‑cut‑vertex set remains nowhere dense in any cylinder‑based topology.\n\nExamples\n\n- D=3, odd‑D gadget: Starting from any r‑ball F, parity flipper changes S by 1; ports move deficits outward; repeated pair‑closures reduce S→1, yielding a unique cross edge in any 3‑regular extension. The whole construction sits outside B_r, so the refined object is a rooted ball.\n- Occurrence constraints with forbidden patterns: If F′_1,…,F′_m forbid degree‑1 rooted balls up to radius R, then the block S (or the backbone B) can be chosen 2‑edge‑connected with girth >2R, so no forbidden rooted ball appears in the modified region; the single bridge in Lemma I need not create any degree‑1 vertex.\n\nObstacles\n\n- Even‑D cut‑vertex forcing (Lemma H) is given as a sketch; a fully explicit layering and degree bookkeeping write‑up remains to be added (but it closely mirrors the odd‑D port/closure machinery, with routing of all deficit to one vertex c).\n- In propositions L–M, we implicitly used that O_Z imposes finitely many (positive/negative) occurrence constraints; the constructions respect negatives via high‑girth design. A formal parameter selection (girth thresholds versus the radii in O_Z and U_{•}) should be spelled out.\n\nNext steps\n\n- Move Lemmas A–B, Propositions C–D to proofs.md to finalize Conjecture 1.\n- Write detailed proofs of Lemma F and Proposition G with explicit layering radii and a termination measure; add the full even‑D Lemma H.\n- For Conjecture 2, analyze (X,d_new): decide whether B_0 or B_1 is meagre/comeagre. A viable plan is to produce a countable family of dense open sets whose intersection forces an infinite 2‑edge‑connected backbone (or, conversely, forces the presence of 1‑way bridges), and check whether these form a G_δ that is dense.\n- Consider an impossibility meta‑theorem: identify a broad “finite‑core invariance” axiom for topologies on X that implies both bridgeless and 1‑way‑bridge sets are dense (hence neither typical if the space is Baire), thereby expanding the no‑go region for Conjecture 2 beyond cylinder‑based metrics."
}