{
  "content": "Ideas\n\n- Consolidate Conjecture 1 by recording the forgetful-map (π) transfer and adding that the unrooted space Y (rootless-local topology) is Baire. This clarifies meagreness/comeagreness decisions at the unrooted level.\n- Strengthen the Conjecture 2 “no-go” region by proving that bridgeless graphs are nowhere dense also in the unrooted space Y; consequently, the pullback (occurrence) topology on rooted graphs still cannot make bridgeless typical. Together with the finite-lens property (FLP) results, this isolates the search to genuinely nonlocal metrics.\n- Provide clean, explicit odd-D and even-D gadgets and a uniform “finite pinning property” (FPP) criterion under which the nowhere-denseness proofs go through.\n\nLemmas and proofs\n\n- Setup. X=𝔾_{\\bullet,D} with Benjamini–Schramm topology τ_•. Y=unrooted connected countable graphs with Δ≤D (or =D) with the rootless-local topology τ₀ generated by U_F^Y={G∈Y: ∃v with B_r(G,v)≅F} for rooted r-balls F.\n\nLemma 1 (π is continuous, open, surjective; Y is Baire).\nLet π:X→Y be π(G,ρ)=G. Then π is continuous since π^{-1}(U_F^Y)=⋃_{F′ rootings of F} 𝔾_{\\bullet}^{F′} is open in τ_•; π is open because π(𝔾_{\\bullet}^{F′})=U_F^Y and extends by unions. Since (X,τ_•) is Baire, Y is Baire as the continuous open image of a Baire space (e.g., Oxtoby’s theorem).\nWhy useful: Establishes a robust ambient Baire framework for unrooted typicality.\n\nProposition 2 (Root-invariance via π-transfer).\nFor any A⊆Y, A is nowhere dense in (Y,τ₀) iff π^{-1}(A) is nowhere dense in (X,τ_•). If A has the Baire property (BP) in τ₀ (e.g., Borel/analytic), then A is meagre in Y iff π^{-1}(A) is meagre in X.\nProof sketch: Continuity/openness of π yield int(cl(π^{-1}(A)))⊆π^{-1}(int(cl(A))). For meagreness, use dense G_δ witness sets and π’s openness.\nWhy useful: Resolves Conjecture 1 for nowhere denseness (all A) and meagreness (BP sets).\n\nDefinition (FLP and FPP on X).\n- FLP (finite-lens property): every open O contains a multi-ball cylinder W(M) pinning radius-r neighborhoods around finitely many marked vertices.\n- FPP (finite pinning property): every open O contains some FLP-cylinder W(M) with W(M)⊆O.\nThese cover Benjamini–Schramm, k-lens, and finite-intersection-of-cylinders metrics.\n\nTheorem 3 (Bridgeless nowhere dense under FLP; ≤D and =D odd).\nLet D≥3. In any FLP metric on 𝔾_{\\bullet,≤D}, BrFree is nowhere dense. In any FLP metric on 𝔾_{\\bullet,=D} with odd D, BrFree is nowhere dense.\nProof (≤D): Inside any W(M), pick a boundary vertex b with residual capacity and pin a new leaf z adjacent only to b (all within the pinned finite region). Then bz is a bridge in every completion, so W(M) contains an open subset disjoint from BrFree.\nProof (=D odd): Use the explicit finite seed S: start from K_{D+2} with vertices x,a,b,W (|W|=D−1). Delete xa,xb and a perfect matching on W. Then deg_S(x)=D−1, others D. Pin the full radius-1 neighborhoods of S far from the marks. In any D-regular completion, only x has residual capacity, forcing exactly one cross edge incident with x; hence that edge is a bridge. Thus BrFree is nowhere dense.\n\nProposition 4 (Even-D regular: NoCut nowhere dense under FLP/FPP).\nFor even D≥4, in any FLP (hence FPP) metric on 𝔾_{\\bullet,=D}, the set NoCut (graphs without a cut vertex) is nowhere dense. Explicit gadget: from K_{D,D} on A∪B, select x∈A,y₁,y₂∈B; remove x−y₁,x−y₂ and add y₁−y₂. Pin radius-1 neighborhoods. Only x has deficit 2; in any completion all cross edges attach to x, making x a cut vertex.\nWhy useful: Complements Theorem 3 in the even-regular regime.\n\nProposition 5 (Unrooted: BrFree is nowhere dense in Y for ≤D and =D odd).\nIn (Y,τ₀) with Δ≤D, BrFree is nowhere dense; likewise in Δ= D with odd D.\nProof. Given U_F^Y, refine to U_{F′}^Y by embedding the same pinned gadgets wholly inside the r′-ball F′, far from its center, ensuring the presence of a bridge in every completion. This does not depend on the root, so the rooted arguments transfer to Y.\nCorollary 5.1. In the occurrence pullback topology τ_occ on X generated by sets Occ(F)=π^{-1}(U_F^Y), BrFree is nowhere dense; hence no such “occurrence-based” coarser natural metric can make BrFree typical.\n\nLemma 6 (Bounded re-rooting invariance for section metrics).\nIf s,t:Y→X are root selectors with dist_G(s(G),t(G))≤K uniformly, then id:(Y,d_s)→(Y,d_t) is a homeomorphism and typicality is preserved.\nWhy useful: Robustness across canonical root choices.\n\nExamples\n\n- Odd D=3, seed S: In K_5 with vertices x,a,b,w₁,w₂, remove xa,xb,w₁w₂. Pinning S forces exactly one external edge at x in any 3-regular completion, hence a bridge.\n- Even D=4, cut-vertex gadget: In K_{4,4}, remove x−y₁,x−y₂, add y₁−y₂. Pin. All external edges must attach at x, making x a cut vertex.\n\nConsequences and no-go region (for Conjecture 2)\n\n- Under any topology on X with FPP (in particular, all cylinder-based and finite-lens metrics), BrFree is nowhere dense in ≤D and in =D with odd D; for even D regular, NoCut is nowhere dense. Thus typicality cannot flip within this broad local class. By refinement monotonicity, any finer metric also preserves nowhere-denseness.\n- At the unrooted level (Y,τ₀), BrFree is nowhere dense and Y is Baire. Pullbacks (τ_occ) inherit the obstruction.\n\nObstacles and cautions\n\n- A metric making BrFree typical must be strictly outside FPP/FLP and cannot be finer than Benjamini–Schramm. Constructing such a “natural” metric on rooted graphs that remains Baire is nontrivial.\n- While graphs with a 1-way infinite bridge are dense in τ₀ (easy local surgery away from a prescribed finite ball), we did not claim bridgeless density in τ₀ because cylinders can be refined to force S(F′)=1, precluding bridgeless completions.\n\nNext steps\n\n- Promote Lemma 1, Propositions 2, 5 to proofs.md, settling Conjecture 1 (ND for all sets; meagre for BP sets) and extending nowhere-denseness of BrFree to unrooted Y.\n- Record Theorem 3 and Proposition 4 with explicit pinning (radius-1) and degree-capacity arguments; include the parity check that |δ(S)|=1 in the odd-D gadget.\n- Identify candidate non-FPP metrics on rooted graphs that remain Baire (e.g., occurrence-frequency or end-structure metrics), and test whether BrFree can be comeagre there; provide either constructions or impossibility lemmas.\n- For even D regular, complement NoCut with an explicit analysis of 2-way infinite bridges’ category under FLP/FPP at the unrooted level, paralleling Theorem 16.\n"
}