{
  "content": "Status\nWe treat 3-coloring of circle graphs as open in general. I consolidate and tighten structural lemmas, give a clean path-decomposition perspective yielding a standard DP (k-colorability FPT in the circular ply), prove a new small structural fact (ply ≤ 2 implies acyclic), and correct the double-neighborhood claim.\n\nIdeas\n- Overlap model: Fix a circle representation and cut at a point between endpoints. Each chord x becomes an open interval (s(x), t(x)) on a line with s(x) < t(x). Adjacency is overlap without containment: x∼y iff s(x)<s(y)<t(x)<t(y) or s(y)<s(x)<t(y)<t(x).\n- Circular ply w: the maximum number of intervals covering any elementary segment between consecutive endpoints.\n\nLemma 1 (Neighborhoods are permutation graphs)\nFor any vertex/chord x, the induced subgraph G[N(x)] is a permutation graph.\nProof. The endpoints of x split the circle into two arcs L,R. Each y∈N(x) has one endpoint on L and the other on R. Adjacency among N(x) is determined by whether the relative orders on L and R are inverted, which is exactly the permutation graph model. ∎\n\nCorollary 1 (Double neighborhoods are permutation)\nFor any x,y, the subgraph G[N(x)∩N(y)] is a permutation graph. Proof: permutation graphs are hereditary, and N(x)∩N(y) induces a subgraph of G[N(x)]. ∎\n\nPath decomposition by the sweep (and a separator view)\n- For each elementary segment σ between consecutive endpoints in the linearized order, let B(σ) be the set of intervals covering σ (i.e., active at σ). Then |B(σ)| ≤ w by definition.\n- Separator: For any σ, B(σ) separates the set of intervals that have already ended from those that have not yet started; hence bags B(σ) naturally yield a path decomposition.\n\nLemma 2 (Path decomposition of width ≤ w−1)\nThe sequence of bags B(σ) over elementary segments σ (in their linear order) is a path decomposition of the overlap (circle) graph G of width at most w−1.\nProof. (i) Vertex contiguity: For any interval x, the set of segments σ⊂(s(x),t(x)) it covers is a contiguous block; hence x appears in a contiguous block of bags. (ii) Edge coverage: If x∼y with s(x)<s(y)<t(x)<t(y), then any σ chosen with s(y)<σ<t(x) is covered by both x and y, so both appear in B(σ). (iii) Width bound follows from |B(σ)| ≤ w. ∎\n\nTheorem 1 (k-colorability FPT in circular ply)\nGiven a circle representation of G with circular ply w, k-colorability (in particular, 3-colorability) can be decided in time O(n·k^w) and space O(k^w) via DP over the path decomposition {B(σ)}.\nProof (sketch, standard DP on path decompositions). Traverse bags in order; maintain for the current bag all proper colorings of vertices in the bag that extend to the already-processed part. At a bag transition, vertices are introduced/forgotten by at most one per step (refining to a nice path decomposition if desired). Since each bag has size ≤ w, the state space is ≤ k^w, transitions are O(k^w), and correctness follows from the path decomposition properties. ∎\n\nRemark. Recognizing circle graphs and constructing a representation is polynomial-time (classical), so the overall running time is f(w)·poly(n) when the representation is part of the input or computed upfront. This generalizes the previously stated O(n·w·k^w) sweep DP.\n\nNew structural bound for tiny ply\nProposition 1 (Ply ≤ 2 implies acyclic)\nIf the circular ply w ≤ 2, then the overlap (circle) graph G is a forest (hence bipartite and trivially 3-colorable).\nProof. Suppose G contains a cycle C and choose an interval v1 on C whose right endpoint t(v1) is minimal among the cycle vertices. Its two cycle neighbors v2 and vm must satisfy s(v1) < s(v2) < t(v1) < t(v2) and s(v1) < s(vm) < t(v1) < t(vm) (the alternative s(vm) < s(v1) < t(vm) < t(v1) would contradict minimality of t(v1)). Pick any point p with max{s(v2), s(vm)} < p < t(v1). Then v1, v2, vm all cover p, so three intervals cover p, contradicting w ≤ 2. Thus no cycle exists. ∎\n\nExamples / sanity checks\n- C5 requires w ≥ 3 by Proposition 1. The path-decomposition DP correctly determines that C5 is 3-colorable.\n- Triangles also force w ≥ 3 (same argument with a 3-cycle).\n\nObstacles and one failed compression attempt\n- It is tempting to compress DP states by keeping, for the active intervals sorted by end-time, only the sets U_r of colors used in the first r positions (equivalently, the first-appearance ranks of each color). This suffices to decide which colors are forbidden for a newly introduced interval. However, at forget steps (when the earliest-ending active interval leaves the bag), we must know its color to update U_r; without tracking the full assignment on the bag, we cannot update these sets correctly. Hence such compression is unsound; exponential-in-w states (k^w) appear necessary for exact DP over this path decomposition.\n\nConsequences and corrections\n- Replace the earlier “double neighborhood is trapezoid” remark by Corollary 1 (permutation, hereditary), which is tighter and simpler.\n- The separator view clarifies why the sweep DP is a standard pathwidth DP; it also provides a reusable interface for other problems.\n\nNext steps\n- Implementation: DP on the explicit path decomposition {B(σ)}; benchmark typical w on random/canonical instances.\n- Structural: Explore whether small w beyond 2 yields additional constraints (e.g., characterize cycle structure for w=3) and whether these enable faster specialized algorithms.\n- Decomposition: Investigate whether two-pivot cuts (bags restricted to chords intersecting one of two fixed chords) yield useful bounded-width decompositions in practice.\n- Hardness: Design 3-coloring gadgets within circle graphs (with a fixed triangle as a palette); formalize a wire and equality gadget realizable by chords, aiming towards NP-hardness for K4-free instances.\n\nSummary of concrete, checkable contributions this round\n- Lemma 2 and Theorem 1: explicit path decomposition of width ≤ w−1 and an FPT DP for k-colorability in O(n·k^w) time, clarifying and unifying the sweep algorithm with standard pathwidth DP.\n- Proposition 1: If w ≤ 2 then G is a forest (new small structural fact, with proof).\n- Correction: N(x)∩N(y) is permutation (hereditary); drop the trapezoid claim unless a complete construction is given."
}