{
  "content": "Ideas\n- Formalize a class of “strongly local” (cylinder‑rich) topologies on X=G_{\\bullet,D} under which local forcing arguments go through, and prove that bridgeless graphs are not typical there (≤D for all D>2; =D for odd D>2).\n- Give clean, verifiable constructions: (i) a saturated finite bubble forcing a 1‑way infinite bridge in ≤D and in odd D‑regular; (ii) a D‑regular completion lemma ensuring the refined ball admits an infinite regular extension; (iii) a complete proof that “has a 2‑way infinite bridge at distance ≤k” is nowhere dense, hence 2‑way bridges are meagre; consequently, in even D‑regular, bridgeless is already comeagre under d_•.\n- Catalog natural alternative metrics that are cylinder‑rich (weighted local, FO‑local), concluding no change in typicality there.\n\nDefinitions\n- Cylinder sets: for a rooted r‑ball F, C(F):=G_\\bullet^F={ (G,\\rho): B_r(G,\\rho)\\cong F }.\n- A topology \\tau on X is cylinder‑rich if for every x\\in X and every \\tau‑open U\\ni x there exists r with C(B_r(x))\\subseteq U.\nRemarks: The local (Benjamini–Schramm) topology \\tau_\\mathrm{loc} is cylinder‑rich with base {C(F)}. Any metric that declares closeness by matching finitely many rooted balls (possibly with positive weights) is cylinder‑rich; see Lemma A below.\n\nLemma A (weighted local metrics are cylinder‑rich and topologically equivalent to d_•).\nFix weights (a_r)_{r\\ge0} with a_r>0, \\sum_r a_r<\\infty, and set\n d_a\\big((G,\\rho),(H,\\sigma)\\big)=\\sum_{r\\ge0} a_r\\, \\mathbf 1\\{B_r(G,\\rho)\\not\\cong B_r(H,\\sigma)\\}.\nThen the topology of d_a is exactly \\tau_\\mathrm{loc}. In particular, it is cylinder‑rich.\nProof. If B_R match then d_a\\le\\sum_{r>R}a_r, so C(B_R(x)) is open. Conversely, if B_R do not match for all R\\ge R_0, then d_a\\ge\\sum_{r\\le R_0}a_r>0, so every d_a‑neighborhood contains some cylinder C(B_R) with R large. Hence the generated open sets coincide with unions of cylinders.\n\nLemma B (FO‑local metrics are cylinder‑rich).\nDefine metric d_\\mathrm{FO,k} by d_\\mathrm{FO,k}(x,y)=2^{-t} where t is the largest quantifier rank \\le k such that x,y satisfy the same rooted FO sentences of rank ≤ t. On degree‑bounded classes, Gaifman locality implies agreement on FO sentences of rank t entails agreement on r‑balls for r=c(D)\\cdot 2^t. Hence the topology refines \\tau_\\mathrm{loc} and is cylinder‑rich.\n\nBridge forcing by a saturated bubble\nWe first give a uniform gadget for ≤D and odd D‑regular that forces a 1‑way infinite bridge in any completion.\n\nLemma 1 (saturated bubble forcing, ≤D).\nLet D>2 and let U=C(F) be any nonempty cylinder in \\mathbf G_{\\bullet,\\le D}. There exists a larger ball F' with C(F')\\subseteq U such that every (G,\\rho)\\in C(F') has a bridge.\nProof. Let r be the radius of F and pick a boundary vertex b\\in L_r(F) with \\deg_F(b)<D (exists since F has infinite extensions). Build a finite connected graph H with a designated vertex z and with all vertices in H of degree D except z of degree D−1 (this is easy: take any finite tree, add internal edges until every vertex but one reaches degree D−1; then attach one more leaf to z later). Extend F to radius r+3 by: (i) adjoining a new vertex y with edge by to the ball, (ii) attaching H by identifying z with a fresh neighbor of y so that yz is the unique edge from H to the rest of the ball, and (iii) ensure all vertices of H are saturated to degree D within the ball (z’s Dth edge is yz). Do not add any further edge between H and the old part of F. Denote by S the vertex set H\\cup\\{y\\}. Then within the ball, the only edge leaving S is e=by. In any completion respecting \\Delta\\le D, no vertex of S can receive new edges (already at degree D), hence e remains the unique edge crossing \\delta(S). Since S is finite and the graph is connected, e is a 1‑way infinite bridge. Leave some other boundary vertices untouched so the cylinder remains nonempty. This yields F' with the stated property.\n\nOdd D‑regular forcing and completion\nWe now adapt to \\mathbf G_{\\bullet,=D} for odd D>2.\n\nLemma 2 (odd‑regular bubble gadget).\nLet D=2t+1\\ge3. There exists a finite connected simple graph H with a vertex z such that all vertices in H\\setminus\\{z\\} have degree D and z has degree D−1.\nConstruction. Start with any finite D‑regular graph R. Pick t disjoint edges E_0=\\{u_iv_i\\}_{i=1}^t so that R−E_0 is connected (e.g., on a big cycle, take every other edge). Form H by removing E_0 and adding a new vertex z adjacent to all 2t endpoints of E_0. Then \\deg_H(z)=2t=D−1 and all other vertices regain degree D. H is connected because R−E_0 is.\n\nLemma 3 (forcing a bridge in odd D‑regular cylinders).\nLet D be odd. For any nonempty cylinder U=C(F) in \\mathbf G_{\\bullet,=D}, there exists F' with C(F')\\subseteq U such that every (G,\\rho)\\in C(F') has a bridge.\nProof. Let r be the radius of F and choose b\\in L_r(F) with \\deg_F(b)<D (every D‑regular completion needs boundary slack). Extend F to radius r+3 by adding a path b–y–z and attach the gadget H of Lemma 2 at z, as in Lemma 1. Within the extended ball, all vertices of H\\setminus\\{z\\} have degree D, z attains degree D after adding yz, and y has degree 2 within the ball; we complete y to degree D by adding D−2 neighbors inside the ball and saturating them by internal edges (a small D‑regular filler). No other edge joins H to the old part of F besides by. Let S=V(H)\\cup\\{y\\}. Then \\delta(S)=\\{by\\} within the ball, and all vertices in S have degree D already in the ball, so no completion in \\mathbf G_{\\bullet,=D} can add edges incident to S. Thus by is a bridge in every completion.\n\nLemma 4 (D‑regular completion lemma, odd D).\nWith notation as in Lemma 3, there exists an infinite connected D‑regular simple graph extending F'.\nProof. Let m be the number of boundary stubs (sum of residual degrees over boundary vertices) after the modification; m is finite and positive. Take an infinite D‑regular tree T=T_D. Choose 2m distinct vertices W=\\{w_1,\\dots,w_{2m}\\} in T far apart. For each i, delete one incident edge of w_i so that all w_i now have degree D−1 and T splits into at most 2m components. Partition W into A\\cup B with |A|=|B|=m. Add a perfect matching on B by inserting edges between appropriately chosen B‑pairs from different components; this produces a connected graph T' in which vertices of B are back to degree D and all w\\in A have degree D−1, all others still degree D. Now biject boundary stubs of F' with vertices of A and add edges to connect each stub to its matched A‑vertex. The result is a connected infinite D‑regular simple graph extending F'. (We chose W pairwise distant to avoid parallel edges and ensured connectivity by pairing across components.)\n\nConsequences for typicality under cylinder‑rich topologies\nThe key meta‑principle is: in any cylinder‑rich topology \\tau, to prove S is nowhere dense it suffices to show that for every nonempty cylinder C(F) there exists a refined cylinder C(F')\\subseteq C(F) with C(F')\\cap S=\\varnothing.\n\nTheorem 5 (no‑go under cylinder‑rich topologies).\nLet \\tau be any cylinder‑rich topology on \\mathbf G_{\\bullet,\\le D} with D>2. Then the bridgeless set is nowhere dense in (\\mathbf G_{\\bullet,\\le D},\\tau). If D is odd, the same holds in (\\mathbf G_{\\bullet,=D},\\tau).\nProof. Apply Lemma 1 (≤D) or Lemma 3 (odd =D) inside any cylinder contained in a given \\tau‑open set.\n\nMeagreness of 2‑way infinite bridges; even‑regular comeagreness of bridgeless\nFor k\\in\\mathbb N let P_k be the set of rooted graphs having a 2‑way infinite bridge at distance ≤k from the root.\n\nLemma 6 (cycle shielding; P_k nowhere dense in ≤D).\nFix D>2 and k. For any cylinder C(F) with radius r≥k, there exists a cylinder C(F')\\subseteq C(F) such that every graph in C(F') has no 2‑way infinite bridge at distance ≤k.\nProof. Let E_k be the finite set of edges of F whose midpoint distance to the root is ≤k. For e\\in E_k, let A_e and B_e be the two components of F−e. If at least one of A_e,B_e has no boundary vertex v\\in L_r(F) with \\deg_F(v)<D, then in any extension of C(F), that side cannot become infinite; thus e cannot be a 2‑way infinite bridge—we ignore such e. For the remaining e, pick boundary vertices v_A\\in A_e\\cap L_r(F), v_B\\in B_e\\cap L_r(F) with \\deg_F(v_A),\\deg_F(v_B)<D. Enlarge the ball to radius r+2 by, for each such e, adding fresh vertices s_A^e,s_B^e at distance r+1 adjacent to v_A,v_B, respectively, and a fresh vertex c_e at distance r+2 adjacent to s_A^e and s_B^e. All these attachments for different e are made pairwise disjoint. This creates, for each e, a cycle that contains e (the unique path in F between v_A and v_B passes through e). No further degree exceeds D. Let F' be the resulting (r+2)‑ball. In any completion of C(F'), each e\\in E_k above lies on a cycle, hence cannot be a bridge; thus P_k is avoided.\n\nLemma 7 (P_k nowhere dense in =D).\nThe same conclusion holds in \\mathbf G_{\\bullet,=D}. For each used boundary vertex v in Lemma 6, we additionally saturate v to degree D inside the enlarged ball by attaching a local D‑regular filler (e.g., K_{D+1}−e gadgets chained so that the new vertices also reach degree D within the ball). The disjointness ensures feasibility. Therefore no 2‑way bridge at distance ≤k can occur in any D‑regular completion of the refined cylinder.\n\nProposition 8 (2‑way bridges are meagre but dense).\nFor D>2, the set P=\\bigcup_k P_k is meagre in \\mathbf G_{\\bullet,D}. It is dense as well.\nProof. Meagre: countable union of nowhere dense sets by Lemmas 6–7. Dense: given any cylinder, attach far outside a double ray and link its two sides by a single edge (keeping degrees ≤D by using spare degree at a distant boundary vertex); this creates a 2‑way infinite bridge arbitrarily far from the root without affecting the inner ball.\n\nCorollary 9 (even‑regular comeagre bridgeless).\nIn \\mathbf G_{\\bullet,=D} with even D>2, every bridge is 2‑way infinite (degree parity argument). Hence the set of bridged graphs equals P, which is meagre by Proposition 8. Therefore bridgeless graphs are comeagre under d_• (and any topologically equivalent cylinder‑rich metric).\n\nExamples\n- D=3 odd‑regular forcing: Let R be any 3‑regular finite graph (e.g., a prism). Remove one edge uv and add z adjacent to u,v; now \\deg(z)=2, others stay 3. Attach as in Lemma 3 to force a bridge in every 3‑regular completion while preserving extendability by Lemma 4.\n- D=4 even‑regular: By Corollary 9, bridgeless is already comeagre; no alternative metric is needed to flip typicality.\n\nObstacles and clarifications\n- “Nowhere dense is preserved under refinement” is false in general. We avoid this by working within cylinder‑rich topologies, where forcing is executed inside cylinders contained in arbitrary open sets.\n- For even D‑regular, saturated bubbles creating 1‑way bridges are impossible (finite component parity). Our meagreness proof for 2‑way bridges fills the gap.\n- The D‑regular completion Lemma 4 is tailored to odd D forcing; it is constructive and avoids multi‑edges by choosing distant vertices in T_D.\n\nNatural alternative metrics\n- Weighted local metrics and FO‑local metrics are cylinder‑rich (Lemmas A–B); hence typicality of bridgeless is the same as under d_•.\n- Any metric whose open sets admit cylinders as a local base falls into this class. Therefore, within this broad and natural family, there is no metric making bridgeless typical on \\mathbf G_{\\bullet,\\le D} (D>2) or on \\mathbf G_{\\bullet,=D} for odd D.\n\nNext steps\n- Formalize a broader “tame” class with basic opens A(F,\\Pi) (finite ball plus finite boundary budget/forbiddance data), prove it is Polish/Baire, and verify that common coding/logical metrics belong to it.\n- Extend Lemma 4 to an explicit “reservoir” completion scheme in full generality (handling simplicity and connectivity systematically).\n- Explore genuinely nonlocal, end‑aware inverse‑limit topologies: define basic clopens by fixing an r‑ball together with the number of rays exiting each boundary vertex. Prove Baire/metrizability and test whether “no 1‑edge cut across finite S” is comeagre there (which would kill 1‑way bridges). Assess the status of 2‑way bridges in that topology.\n\nSummary\n- In any cylinder‑rich (strongly local) topology, bridgeless graphs are nowhere dense in \\mathbf G_{\\bullet,\\le D} (D>2) and in \\mathbf G_{\\bullet,=D} for odd D. For even D‑regular, bridgeless is already comeagre under the usual local topology (2‑way bridges are meagre). Weighted local and FO‑local metrics do not change these conclusions. A change of typicality for bridges would require a genuinely nonlocal topology; candidates are proposed but remain to be analyzed for Baire properties and density arguments."
}