{
  "content": "Corrections and scope\n- Parity obstruction (new). The “sealed bubble via degree saturation” forcing works as stated for odd D, but it cannot work for even D in the ≤D space: if a finite set T is sealed by saturating every v∈T to degG(v)=D and the only cross-edge to V(G)\\T is a single edge e, then 2|E(T)|=∑v∈T degG(v)−|∂T|=D|T|−1, which is impossible when D is even (LHS is even). Hence, for even D one cannot force a 1-edge cut by saturating a finite side in ≤D using only degree bounds. This invalidates the “leaf” forcing and shows the degree‑saturation bridge forcing must be confined to odd D (or to richer topologies that can encode forbid‑adjacency constraints).\n- Robustness class. We adopt strongly local metrics d on X=G_{\\bullet,D}: there is ψ:(0,1]→\\mathbb{N} with d(x,y)<ε ⇒ B_{ψ(ε)}(x)≅B_{ψ(ε)}(y). Weighted local metrics d_w(x,y)=∑_r w_r·1_{B_r(x)\\not\\cong B_r(y)} (w_r↘0, ∑w_r<∞) are strongly local and Polish.\n\nLemma 1 (robust nowhere-denseness under strongly local metrics)\nLet d be strongly local on X and S⊂X satisfy: for every finite r-ball F with C(F)≠∅ there exists an extension r′-ball F′ extending F with C(F′)≠∅ and C(F′)⊆X\\S. Then S is nowhere dense in (X,d).\nProof. Let U be a nonempty d-open set, pick x∈U and ε>0 with B_d(x,ε)⊂U. Put r=ψ(ε). Then B_d(x,ε)⊂C(B_r(x)). By hypothesis, pick r′≥r and F′ extending B_r(x) with C(F′) nonempty and C(F′)⊆X\\S. Choose y∈C(F′). Take δ>0 with ψ(δ)≥r′. Then B_d(y,δ)⊂C(F′)⊂X\\S. Hence every nonempty d-open set contains a nonempty d-open subset disjoint from S; equivalently, int_d(\\overline{S}^d)=∅.\n\nForcing a bridge for odd D (≤D and =D)\nWe implement the hypothesis of Lemma 1 with S=“bridgeless graphs” when D is odd.\n\nLemma 2 (odd D sealed bubble). Let D≥3 be odd. There exists n≥D+2 (odd) such that the graphic degree sequence (D−1,D,D,…,D) of length n can be realized by a connected simple graph T. Pick any boundary vertex u in a cylinder C(F) with deg_F(u)<D. Let F′ be obtained by adjoining a disjoint copy of T and a single edge e=ut_0, where t_0 is the unique vertex of degree D−1 in T. Then every extension of F′ in X=G_{\\bullet,≤D} or X=G_{\\bullet,=D} (odd D) contains e as a 1‑way infinite bridge.\nProof (existence of T). Fix any odd n≥D+2 and consider d=(D,…,D,D−1) with n terms. Erdős–Gallai inequalities hold:\n- Sum parity: ∑ d_i=Dn−1 is even since D and n are odd.\n- For 1≤k≤n−1, write ∑_{i=1}^k d_i = Dk (except when k=n, trivial). EG requires Dk ≤ k(k−1)+∑_{i=k+1}^n min(D,k) = k(k−1)+(n−k)min(D,k). If k≤D this is Dk ≤ k(k−1)+(n−k)k = kn−k, i.e. D ≤ n−1, true as n≥D+2. If k≥D+1 then min(D,k)=D and the inequality reduces to 0 ≤ k^2 − (1+2D)k + nD, which is minimized at k=D+1 with value D(n−D−1) ≥ D > 0 (since n≥D+2). Thus d is graphic. Connectivity can be enforced by a standard edge‑switch: if the realized graph is disconnected, pick edges ab, cd from two components and replace them by ac, bd (avoiding parallel edges), which preserves degrees and decreases the component count; iterate.\nSealing and the bridge. In F′, every vertex of T has degree D (counting e at t_0), hence in any extension in ≤D or =D (odd) no additional edges incident to T can be added. The only edge between T and its complement is e; thus deleting e separates T (finite) from the rest (infinite), so e is a 1‑way infinite bridge in every extension.\nNonemptiness of C(F′). Leave at least one boundary vertex w∈B_r(F) outside u with residual capacity; attach any infinite locally finite tail (≤D) or a D‑regular tail (=D odd) beyond the radius to realize an infinite extension. A standard completion is to graft a rooted (D−1)‑ary tree to each residual stub and then locally cap degrees to D by finite patching; details are routine and can be done disjointly from T.\n\nCorollary 3 (odd D robustness). For D odd ≥3, in both X=G_{\\bullet,≤D} and X=G_{\\bullet,=D}, the bridgeless set is nowhere dense (hence meagre) under any strongly local metric. By Lemma 1 and Lemma 2.\n\nEven D: obstruction and what remains true\n- Obstruction (formal). Let D be even and let K be any finite vertex set all of whose vertices have degree D in the final graph. Then |∂K| ≡ D|K| (mod 2) is even. Hence a sealed bubble with a unique cross-edge cannot exist for even D. In particular, the degree‑saturation bridge forcing cannot work in ≤D for even D (and of course not in =D).\n- Consequences. To force a bridge uniformly inside a cylinder without using additional constraints (like forbid‑adjacency), one needs a sealed finite side with a single cross-edge. The parity lemma rules this out for even D, so a different idea is required. This explains why the naive “attach a leaf” sketch is invalid for forcing and why a degree‑saturated gadget must fail for even D.\n- What is still robust. For every fixed k, the set S_k = {graphs having a 2‑way infinite bridge meeting B_k} is nowhere dense under any strongly local metric: inside any cylinder, augment near radius ≈k by adding a short cycle through each edge within distance ≤k (when a boundary vertex has residual capacity, add one new neighbor and connect these new neighbors into a cycle just outside the radius), thereby ensuring all such edges lie on cycles in every extension. Hence S_2way = ⋃_{k≥0} S_k is meagre (and dense). In =D with even D, 1‑way bridges are impossible by parity, so bridgeless graphs are comeagre already under d_\\bullet and remain so under any strongly local metric.\n\nTypicality versus metric changes\n- Negative result (within strongly local metrics). The meagreness of “bridgeless” is invariant in X=G_{\\bullet,≤D} and X=G_{\\bullet,=D} for odd D, and “bridgeless” is comeagre for even D in =D; strongly local alternative metrics (weighted multi‑radius, FO‑local, decorated local signatures) do not alter this.\n- Nonlocal attempts. Metrics augmented with global bridge profiles H_r or end‑data render the “has a bridge” indicator nearly clopen and risk losing completeness/Baire; moreover, they tend to give the bridge set interior (so not meagre). These are unlikely to be acceptable “natural” alternatives if Baire category is the yardstick.\n\nExamples and sanity checks\n- Weighted local metrics d_w are Polish and strongly local; Lemma 1 applies. FO‑local metrics induced by the vector of FO‑types up to quantifier depth m with weights w_m are strongly local by Gaifman locality.\n- Even D counter‑gadget: any attempt to realize a finite sealed T with a single cross-edge violates the parity identity 2|E(T)|=D|T|−|∂T| when D is even.\n\nNext steps\n1) Provide a complete, local completion lemma for =D odd: given a finite preball F′ with some vertices saturated to D and others with residual stubs, construct an infinite D‑regular extension outside radius r′. A constructive scheme via attaching rooted (D−1)‑ary trees and a bounded‑degree patching of remaining deficits would finish the proof fully rigorously.\n2) Catalogue natural strongly local metrics (weighted local, ultrametrics from decorated balls, FO‑local) and record that they are Polish, hence Baire.\n3) Even D in ≤D: either (i) find a genuinely different forcing that circumvents the parity obstruction (very unlikely without forbid‑adjacency), or (ii) settle that “bridgeless is nowhere dense” fails in ≤D for even D under pure cylinder topologies, correcting the claim from the sketch. A precise impossibility statement would be: no cylinder refinement can force a bridge for even D.\n4) If one broadens to “tame” topologies allowing explicit finite forbid‑adjacency data Π (as in the notes), re‑run the sealed‑bubble forcing for all D (parity no longer binds because forbiddances, not degrees, block new cross‑edges), and check Polishness/Baire to preserve the analytic framework.\n\nSummary\n- We established an invariance scheme (Lemma 1) for strongly local metrics and implemented a correct bridge‑forcing gadget for odd D (Lemma 2), yielding meagreness of “bridgeless” that is robust across many natural alternative metrics. We also identified and proved a parity obstruction that forbids the degree‑saturation bridge forcing for even D in ≤D, clarifying a gap in earlier sketches. For even D in =D, bridgeless is already comeagre and remains so under strongly local metrics. The open technical items (regular completion lemma for odd D and the even‑D ≤D case) are now crisply delineated."
}