{
  "progress_md": "## Round 0005 — Firming up boundary sampling; explicit constants in the disjointness error; and a concrete LP blueprint for the balanced regime\n\n### Quick audit of output.md (minor gaps and clarifications)\n- Proposition J (global anchored savings) is sound. One minor sampling detail worth adding explicitly: at a random boundary, the ordered pair of 3-sets of directions flanking the boundary is uniform over all ordered disjoint pairs. This is implicitly used when applying Lemma E0; it is true by symmetry of the random permutation and block partition. I state this as Lemma K below for completeness.\n- Lemma E0 (membership under disjointness) is used with an O(1/n) term. We can make the constant explicit by computing |S_K| exactly (see “Explicit constants for Lemma E0”). This will clarify error bookkeeping in Proposition J and Corollary J1.\n- The present anchored-driven bound is already optimal in the sense that the coefficient 2 in Lemma I cannot be globally improved (as noted). Thus the only remaining obstruction to beating 3/8 unconditionally is the near-balanced regime where E_v[T_v]≈0. The LP/SDP program for b is the most promising next step.\n\n### New, small, checkable lemmas and refinements\n\n1) Lemma K (Uniformity of boundary 3-set pairs)\n- Statement. Under Dvořák’s scheme with a uniform random permutation π of [n], partition [n] into contiguous 3-blocks B_1,…,B_k with B_j={π_{3j-2},π_{3j-1},π_{3j}}. Choose boundary j uniformly from {1,…,k−1}. Then the ordered pair (K,L):=(B_j,B_{j+1}) is uniformly distributed over all ordered pairs of disjoint 3-sets of [n].\n- Proof idea. A random partition into k ordered blocks of size 3 is generated by the random permutation. Conditional on the partition, each B_j is a uniform 3-subset; conditioning further on B_j=K, the next block B_{j+1} is a uniform 3-subset of the remaining [n] \\ K. Hence (K,L) is uniform among ordered disjoint pairs.\n- Why useful here. It justifies the use of Lemma E0 (and Lemma F) at boundaries without additional averaging arguments.\n\n2) Explicit constants for Lemma E0 (tight O(1/n) bound)\n- Exact |S_K|. For a fixed 3-set K⊆[n], the number of 3-sets intersecting K equals |S_K| = C(n,3) − C(n−3,3) = (9n^2 − 45n + 60)/6 = (3/2)n^2 − (15/2)n + 10.\n- Consequently, for any T⊆C([n],3) with |T|=τ·C(n,3) and a uniformly random ordered pair (K,L) of disjoint triples,\n  |P[K∈T,L∈T] − τ^2| ≤ max_K |ε(K)| ≤ |S_K|/C(n−3,3)\n  = (9n^2 − 45n + 60)/(n^3 − 12n^2 + 47n − 60) ≤ 10/(n−12) for all n≥20.\n- Practical corollary. One may replace the O(1/n) in Lemma E0, Proposition J, and Corollary J1 by a concrete ≤ 10/(n−12), making all constants explicit (useful if we later optimize finite-n constants).\n\n3) Finite-n constant in Proposition J (explicit c(n))\n- Using Lemma B exactly, for even n we have τ_min = 2·C(n/2,3)/C(n,3); for odd n, τ_min = [C((n−1)/2,3)+C((n+1)/2,3)]/C(n,3).\n- Hence Proposition J yields\n  E[switches] ≤ (1/3 + b/12)·n − c(n)·E_v[T_v]·n + O(1),\n  with c(n) = (2/3)·(τ_min)^2. In particular, c(n) → 1/24 as n→∞ and c(n) ≥ (1/24)·(1 − O(1/n)). This sharpens Corollary J1’s asymptotic statement to a finite‑n bound with an explicit coefficient.\n\n### Discrete minimization of H(r,n) (status and plan)\n- Claim (to be proved). For all n≥8, H(r,n) from Lemma F is minimized at r∈{⌊n/2⌋,⌈n/2⌉}.\n- Sketch of approach. Write A(m)=C(m,3), and note H’s numerator equals A(r)A(r−3) + 2A(r)A(n−r) + A(n−r)A(n−r−3). Consider Δ(r)=Num(r+1)−Num(r) and show it changes sign exactly once at ⌊n/2⌋. The leading terms form a convex, symmetric polynomial in r (by asymptotics A(r)≈r^3/6), and small lower‑order corrections (the ±3 shifts) do not alter the location of the discrete minimizer for n≥8. I will carry out the exact discrete difference algebra next round.\n- Why still useful. While Proposition J no longer relies on H(r,n), the minimization of H underpins optional anchored‑mass refinements and serves as an internal consistency check for our anchored estimates.\n\n### Toward the balanced‑degree regime: an LP blueprint for bounding b\nWe now formalize a tractable LP in the symmetric (balanced-degree) regime r_v≡n/2, isolating local statistics at a fixed vertex v. The objective is to upper‑bound b_v (fraction of mixed edges across the cut (G_v, its complement) in KG(n,3)) under local consistency and Dvořák-style “badness” constraints; then average over v to bound b.\n\n- Variables (at a fixed v):\n  1) Star-type frequencies on 3-sets K: s_{3R}, s_{2R1B}, s_{1R2B}, s_{3B}. Balanced degrees impose s_{3R}=s_{3B}=τ (fixed by Lemma B) and s_{2R1B}=s_{1R2B}=(1−2τ)/2.\n  2) 4-cycle-type frequencies y_t over unordered pairs {i,j}, where t∈{mono, two-adjacent, two-opposite, alternating}. Marginals must match the color-pair distribution at v: in the balanced case,\n     y_mono + y_adjacent = P[RR]+P[BB] = C(n/2,2)/C(n,2) + C(n/2,2)/C(n,2) = 1/2,\n     y_opposite + y_alternating = P[RB] = 1/2.\n  3) Marked-Q3 pattern frequencies z_π over 2-colored Q3’s with a marked vertex v (up to Aut(Q3) with a mark), tagged as good/bad (per Dvořák) and, for good, the color chosen by f1 on the first edge at v. Each class π has an integer triple (a_π,b_π,c_π) counting how many of the three faces at v fall into each 4-cycle type; these induce linear constraints linking {z_π} to {y_t} and to the star types s_{·}.\n  4) Pair variables for disjoint triples (K,L) that are v-neighbors. As in Lemma C/E0, the law over disjoint pairs is within O(1/n) of the product of the marginals. We thus linearize b_v by approximating the disjoint-pair distribution with the product distribution over K and L, adding a conservative ±O(1/n) slack in the constraints to absorb the dependency.\n\n- Constraints:\n  • Normalization: ∑_π z_π = 1; star/face marginals of the z_π equal s_{·}, y_{·}.\n  • Dvořák badness filter: z_π=0 for patterns π violating Lemma 9’s characterization (i.e., bad Q3’s must admit antipodal geodesics from v with exactly one color change with prescribed endpoint colors; anchored classes are good by Lemma 8).\n  • Symmetry under color swap: coupled with balance, this halves the variable set (e.g., s_{3R}=s_{3B}, s_{2R1B}=s_{1R2B}; likewise for z_π in color-swapped pairs).\n  • Disjoint-pair linearization: the mixed mass b_v is a linear form in pair frequencies over (π,σ); we enforce upper bounds using the product-approximation and add an explicit O(1/n) slack (from Lemma E0) so the LP upper bound remains valid for finite n.\n\n- Objective: Maximize b_v subject to the above constraints. Any universal optimum strictly below 1/2 (for n large) gives the desired γ>0 in b ≤ 1/2 − γ, certifying a constant improvement over 3/8 in the balanced regime.\n\n- Why plausible: The inclusion of all anchored classes in “good”, together with 4-cycle consistency across the three faces at v in each Q3, should constrain the cut (G_v, ¯G_v) well below the vertexwise spectral MAX-CUT bound (which ignores such structure). Even a modest LP margin γ≈10^{-3} would suffice.\n\n- Enumerative input (next deliverable): Provide the list of marked-Q3 isomorphism classes, their good/bad status, and (for good) the f1-start color at v. For each class, tabulate the triple (a_π,b_π,c_π) of face-types at v. This table pins down the linear map z_π ↦ (s_{·}, y_{·}).\n\n### Small examples and sanity checks\n- “One-direction dictatorial” Q3 (bad): all edges in one direction red, the other two directions blue. At any v, the star has type 1R2B or 2R1B depending on which of the three directions incident to v is the “red” one. Its three faces at v are: one monochrome (from the blue–blue pair), and two alternating (from the red–blue pairs). This pattern exactly matches Lemma 9’s behavior and will be an extremal bad class in the enumeration.\n- Balanced-degree vertex: star-type frequencies over K computed directly are s_{3R}=s_{3B}=1/4 + O(1/n) and s_{2R1B}=s_{1R2B}=3/8 + O(1/n), consistent with Lemma B. The pair-of-edges at v over unordered {i,j} satisfy P[RR]=P[BB]=1/4, P[RB]=1/2, thus y_mono + y_adj=1/2 and y_alt + y_opposite=1/2 must hold in any feasible assignment.\n\n### Obstacles and why previous routes fail here\n- Anchored refinement cannot help in the balanced regime: τ_v hits its minimum and T_v≈0, so Proposition J yields no gain. Any further both-good refinement via u_v must overcome the adversary’s freedom to balance c_v within good classes, which may be possible in pathological colorings.\n- Vertexwise Kneser-G cut bounds alone cannot beat 1/2: The spectral MAX-CUT gives b_v ≤ 1/2 + O(1/n), and without injecting cube-specific structure (anchored inclusion, 4-cycle consistency, badness filter) no universal γ>0 emerges.\n\n### Concrete next steps (auditable)\n1) Add Lemma K to output.md (uniformity of boundary 3-set pairs), with the short proof above.\n2) Replace the O(1/n) in Lemma E0, Proposition J, and related corollaries by the explicit bound ≤ 10/(n−12), citing the exact |S_K| and C(n−3,3) formulae. This makes all finite‑n constants explicit.\n3) Complete the discrete proof that H(r,n) is minimized at r≈n/2 for n≥8 (sign change of Δ(r)=Num(r+1)−Num(r)). Although not needed for Proposition J, it settles a standing claim from earlier rounds and may be reused in anchored‑mass refinements.\n4) Begin the LP in the balanced regime:\n   - Enumerate marked-Q3 classes up to Aut(Q3) with a mark; classify good/bad; for good, record f1-start color at v.\n   - For each class, compute the triple (a_π,b_π,c_π) of face types at v among {mono, adj, opp, alt}.\n   - Encode the LP (z_π variables; constraints to (s_{·}, y_{·}); product-linearization for b_v with ±10/(n−12) slack) and solve numerically for large n (treating asymptotic constraints). Any γ>0 will guide the ensuing combinatorial proof.\n\n### Why this advances the program\n- The new Lemma K closes a small but real sampling gap in Proposition J’s proof. The explicit constants for Lemma E0 strengthen all o(1) terms into precise O(1/n) with known coefficients, improving auditability.\n- The LP blueprint isolates exactly which local statistics must be controlled to push b below 1/2 in the balanced regime. This is the remaining obstruction to a universal improvement below 3/8; each ingredient is finite, computable, and checkable.\n\n### Explicitly flagged gaps (to be addressed)\n- output.md does not yet contain Lemma K; add it.\n- The finite‑n constant c(n) in Proposition J is not yet stated explicitly; add the formula c(n)=(2/3)·(τ_min)^2 with τ_min from Lemma B.\n- The discrete minimization of H(r,n) remains unproven; I will supply a complete discrete argument next round.\n"
}