{
  "progress_md": "## Round 0005 — Complementary both-good refinement via u_v; boundary pair uniformity; and a sharper expression for the anchored drop\n\nAudit of output.md (gaps/clarifications)\n- The newly curated Lemma I and Proposition J look correct; the anchored-drop inequality is exact and the global integration is sound. The “tie-breaking” remark is no longer needed in anchored cubes (as noted in verifier feedback and also in notes.md): in an anchored Q3, all three edges at the shared vertex have the star color, so the boundary switch occurs iff the two star colors at the shared vertex differ, independently of how the minimal-change geodesics are fixed within each cube. No action needed beyond perhaps a clarifying sentence (already reflected in notes.md).\n- One small-but-useful missing ingredient: an explicit statement that, at any fixed boundary j, the ordered pair of 3-sets (K_j,K_{j+1}) of directions defining the two neighbor Q3’s is uniform over all ordered disjoint 3-sets and independent of the shared boundary vertex v_{3j}. This uniformity is implicitly used when invoking Lemma E0/Lemma C at boundaries. I provide a clean proposition and proof below; adding it would make the conditioning steps in J/D-level refinements fully transparent.\n- Opportunity for a complementary both-good refinement (beyond anchored): we can use Corollary D’s u_v-parameter directly for the both-good case at the boundary. This yields an independent and rigorous saving term ≥ (1/6)·E_v[τ_v^2·u_v^2]·n, which in turn gives a very clean corollary ≥ (1/96)·E_v[u_v^2]·n using τ_v ≥ 1/4 − O(1/n). This covers regimes where degree variance T_v is small but u_v retains variance due to non-anchored good cubes.\n\nNew, checkable propositions/lemmas (to add)\n\n1) Proposition G2 (Uniform pair-of-block directions at a boundary and independence from v)\n- Statement. In Dvořák’s random-permutation model, fix j∈{1,…,⌊n/3⌋−1}. Then the ordered pair (K_j,K_{j+1}) of 3-sets of directions used in blocks j and j+1 is uniformly distributed over all ordered disjoint pairs from C([n],3), and is independent of the shared boundary vertex v_{3j}.\n- Proof. Let π be a uniform random permutation of [n], decomposed into 3-blocks (K_1,…,K_k) of consecutive 3 positions. For any ordered disjoint pair (A,B) of 3-sets, the number of π with K_j=A and K_{j+1}=B equals 3!·3!·(n−6)! (arrangements of A and B inside the 6 fixed slots, and permutations of remaining coordinates), independent of (A,B), hence (K_j,K_{j+1}) is uniform among ordered disjoint pairs. The boundary vertex v_{3j}=v_0⊕(⊕_{i≤3j}e_{π(i)}) depends only on v_0 and the earlier blocks (K_1,…,K_{j−1}), while (K_j,K_{j+1}) depends only on positions 3j−2,…,3j+3 in π. Under a uniform permutation, these parts are independent; v_0 is also independent. Hence (K_j,K_{j+1}) is independent of v_{3j}. ∎\n\n2) Proposition K (Both-good boundary refinement via u_v)\n- Setup. For a vertex v, let G_v⊆C([n],3) be good triples; define c_v:G_v→{R,B} as in Corollary D (first-edge color at v under f1 in a good Q3). Let u_v:=|2p_v−1| with p_v the c_v-red fraction. Let q_v be the boundary-level probability (under Dvořák’s random geodesic) that the two neighboring Q3’s at a boundary share vertex v and are both good.\n- Statement. In Dvořák’s scheme, the both-good contribution at a boundary satisfies\n  E[1_{both-good}·1_{switch at boundary}] = (a/2) − (1/2)·E_v[q_v·u_v^2] ± o(1).\n  Consequently,\n  E[switches] ≤ (1/3 + b/12)·n − (1/6)·E_v[q_v·u_v^2]·n + o(n).\n  In particular, since q_v ≥ τ_v^2 − O(1/n) (anchored ⇒ good and Lemma E0),\n  E[switches] ≤ (1/3 + b/12)·n − (1/6)·E_v[τ_v^2·u_v^2]·n + o(n)\n  ≤ (1/3 + b/12 − (1/96)·E_v[u_v^2] + o(1))·n.\n- Proof. Fix a boundary j and condition on the shared vertex v=v_{3j}. By Proposition G2, the ordered pair (K,L) of direction-sets is uniform over ordered disjoint pairs and independent of v. Condition further on “both good at v”: then (K,L) is uniform over ordered disjoint pairs in G_v. By Lemma C with T=G_v, we have P[c_v(K)≠c_v(L)] = 1/2 − u_v^2/2 ± O(1/n). Thus, conditioning on v, the both-good boundary switch probability equals q_v·(1/2 − u_v^2/2) ± O(1/n). Averaging v uniformly (Proposition G) and using E_v[q_v]=a (definition of a) yields the first displayed equality. Summing over ≈n/3 boundaries and adding the interior contribution 1 − p/2 per block gives the global inequality. The bound q_v ≥ τ_v^2 − O(1/n) follows since “anchored at v ⇒ good” and the probability of both anchored equals τ_v^2 ± O(1/n) by Lemma E0. Using τ_v ≥ 1/4 − O(1/n) gives the explicit 1/96 constant in the final corollary. ∎\n- Why useful here. This yields a second, independent source of both-good savings that applies even when T_v is tiny. It converts vertex-level imbalance among preferred colors inside good Q3’s (u_v) into a linear-in-n gain.\n\n3) Exact closed form and piecewise improvements for the anchored drop\n- Exact expression. With T=(r_v/n − 1/2)^2 and R(x) as in Lemma I, one can write\n  1/2 − R(x) = 2T · (9 + 24T + 16T^2)/(1 + 24T + 144T^2).\n  Proof. Compute Q(T):=(1/4+3T)^2 − 4(1/4−T)^3 = (1/4)·T·(9 + 24T + 16T^2) and divide by 2(1/4+3T)^2.\n- Consequences (auditable polynomial bounds):\n  • Uniform inequality (Lemma I) re-proved: since (9 + 24T + 16T^2) ≥ (1 + 24T + 144T^2) for T∈[0,1/4], the ratio ≥1, giving 1/2 − R(x) ≥ 2T.\n  • Small-T amplification. For any c∈(2,18), the inequality 1/2 − R(x) ≥ c·T holds for all T in [0,T_c], where T_c is the smallest positive root of (9 + 24T + 16T^2) − c(1 + 24T + 144T^2) ≥ 0. Two explicit instances:\n    – c=6: inequality holds for T ≤ T_6 = (−24 + √3072)/416 ≈ 0.0755.\n    – c=10: inequality holds for T ≤ T_10 = (−96 + √20480)/1408 ≈ 0.0335.\n  These piecewise bounds can slightly improve constants in regimes with very small degree variance at many vertices.\n\nHow these pieces fit the overall plan\n- We now have two rigorous, vertex-averaged savings for the both-good boundary term:\n  • Anchored route (Proposition J): saving ≥ (2/3)·E_v[τ_v^2·T_v]·n.\n  • u_v route (Proposition K): saving ≥ (1/6)·E_v[τ_v^2·u_v^2]·n.\n  Either bound applies; in analysis we may take their maximum to get the strongest available improvement in a given instance. The anchored route is effective when degree variance is present; the u_v route can kick in even when degrees are nearly balanced but the good-Q3 preferred-color labels exhibit variance.\n- The remaining hard regime remains: both T_v and u_v^2 concentrated near 0. There we must drive b ≤ 1/2 − γ by local consistency across 4-cycles and Q3-types.\n\nBalanced-regime program for b (LP/SDP next steps, concrete)\n- Variables at a vertex v with r_v=n/2 (symmetric case):\n  1) 4-cycle type frequencies y_t (four isomorphism classes: monochromatic; two-adjacent; two-opposite; alternating).\n  2) Marked-Q3 type frequencies z_π over isomorphism classes of 2-colored Q3 with a marked vertex v, tagged as good/bad (by Dvořák’s definition), and for good classes, the f1-start color at v.\n  3) Pair variables for disjoint triples at v (linearized via standard product-to-new-variable trick), to express b_v.\n- Constraints:\n  • Normalization and marginalization from z_π to y_t and to star types at v.\n  • 4-cycle consistency across the four marked Q3’s sharing a fixed 4-cycle through v.\n  • Badness filters (Lemma 9) enforced at v and the opposite vertex of the marked cube.\n  • Symmetry under color swap and S_n on coordinates; balanced degree r_v=n/2.\n- Objective: maximize b_v (good–bad fraction among disjoint pairs). Any universal optimum < 1/2 yields γ>0. Enumerating the marked-Q3 classes is a finite task; a small script can produce the table of classes, their good/bad status, and f1-start colors.\n\nExamples and sanity checks\n- Random coloring (each edge red w.p. 1/2): heuristically u_v≈0 and T_v≈0, so both anchored- and u_v-routes give negligible savings, matching the intuition that average-case colorings are not the obstruction.\n- Degree-biased coloring with x_v≡1/2+0.1 over a positive fraction of vertices: T_v=0.01; anchored drop per boundary ≥ 2T_v=0.02, scaled by τ_v^2≈(1/4)^2 gives ≳0.00125 per boundary, i.e., ≳0.00042·n total saving—consistent with Proposition J.\n\nNext steps (auditable deliverables)\n1) Curate Proposition G2 and Proposition K (with their short proofs) into output.md. They are self-contained and rely on already-curated Lemma C/E0 and Proposition G.\n2) Optionally add the exact closed form 1/2 − R(x) = 2T·(9 + 24T + 16T^2)/(1 + 24T + 144T^2) with the two small-T corollaries.\n3) Begin the balanced-regime LP: enumerate marked-Q3 2-coloring classes, tag good/bad and f1-start color at the mark; encode constraints and solve numerically. Report either a positive gap γ or an extremal local distribution to analyze combinatorially.\n\nExplicitly flagged open points\n- We still lack a universal lower bound on E_v[u_v^2] or E_v[T_v]. The only remaining route to a constant δ is to show b ≤ 1/2 − γ in the near-balanced regime via the LP/SDP or new structural lemmas.\n- Discrete minimization of H(r,n) (anchored–anchored mass) at r≈n/2 is no longer needed for the core bounds (we use Lemma E0 and τ_v), but it may be added for completeness. A direct sign analysis of H(r+1,n)−H(r,n), using F(m)=C(m,3)C(m−3,3), should work; I can supply a proof if desired."
}