{
  "progress_md": "Round 0003 — audit, tightenings, and small new lemmas/examples\n\nQuick audit of output.md (what’s solid, what to tighten)\n- Theorem A (complementary two-layer tile) is correct: it yields two singleton tilings with periods (1,α) and (1,α+1/2) and a clean irreducibility proof via the singleton/gcd criterion. The non-column proof is valid in the |J_0|=1/2 case by the “component-length” obstruction.\n- Proposition G generalizes Theorem A to 1/q-periodic J_0 and shows q distinct incommensurable periods; the boundary obstruction gives a simple non-column criterion when |J_0|∉{1/m: m∈N}.\n- Proposition H completes the K={0,1,2} two-order mechanism with a simple non-column boundary argument; the “Supplement to Proposition D” fills the computational gap.\n- Minor presentational gap: Lemma B (irreducibility for singleton tilings) is given “as sketched.” For completeness, we should include the short closure argument explicitly (see below).\n- Small streamlining opportunity: Theorem A can be reframed without |J_0|=1/2 by appealing to Corollary F (pick |J_0|∉{1/m}), while still producing the two tilings with slopes α and α+1/2 (using J_0+1/2=J_0). The current version is correct; a remark could point out this simplification.\n\nNew, small, checkable additions\n1) Necessity of gcd condition for irreducibility (complements Lemma B)\n- Lemma (reducibility when gcd>1). Let H:=⟨K−K⟩≤Z. If H≠Z (i.e., g:=gcd{ k_i−k_j } >1), then every tiling A+T of Z×S^1 is reducible by splitting T into g classes T^{(r)} according to the anchor’s first coordinate modulo g and letting X_r:=gZ+r. Then A+T^{(r)}=X_r×S^1 a.e., and the union is disjoint. Why useful: records the converse to Lemma B and clarifies that H=Z is necessary for irreducibility in any regime, not only singleton.\n- Sketch proof. Any translate (z,θ) of A contributes only to rows z+k_i, which are all ≡ z (mod g). Therefore, contributions from anchors in residue class r (mod g) cover exactly the rows in X_r, and different residue classes never interact; hence a nontrivial decomposition exists whenever g>1.\n\n2) Explicit closure step for Lemma B (singleton irreducibility)\n- Detail to add. If T=T_1⊔T_2 and Z=X_1⊔X_2 with A+T_i=X_i×S^1, then for any m∈X_1 the row m must be fully covered by T_1. In the singleton regime row m uses precisely the anchors at indices m−k_i, i=1,…,ℓ; hence m−k_i∈X_1 for all i. Now take any i,j. If m∈X_1 then m−k_i∈X_1; if m+(k_j−k_i)∉X_1, then row m+(k_j−k_i) is in X_2 and must be covered solely by T_2, which requires (m+(k_j−k_i))−k_j=m−k_i∈X_2—contradiction. Thus X_1 is closed under addition by all differences k_j−k_i. Hence X_1 is a union of cosets of H=⟨K−K⟩. If H=Z then X_1 is either ∅ or Z, proving irreducibility.\n\n3) General “rational shift” incommensurability lemma (used implicitly several times)\n- Lemma. If α∉Q and r∈Q\\{0}, then α/(α+r)∉Q. Proof: α/(α+r)=p/q ⇒ α = (pr)/(q−p) ∈ Q unless p=q (which would force r=0). Why useful: it packages the incommensurability step used in Theorem A (r=1/2) and Proposition H (r=c_1 rational) into a one-liner.\n\nConcrete examples for testing\n- Theorem A numeric instance. Take U=[0,0.2]∪[0.3,0.35], α=√2/10. Then J_0:=U∪(U+1/2), J_1:=S^1\\(J_0+α), and A=({0}×J_0)∪({1}×J_1). The two tilings T_α and T_{α+1/2} exist; both are singleton and hence irreducible. The periods are incommensurable by the lemma above. Non-column follows by the component-length mismatch (U has component lengths {0.2,0.05} while its complement in [0,1/2) has {0.1,0.15}).\n- Proposition H numeric instance. Let c_1=c_3=2/5, c_2=1/5; pick β=√2/10 and set a_1=0, a_2≡a_1+c_1+β, a_3≡a_1+c_1+c_2+2β. Then the σ=(1→2→3→1) and σ′=(1→3→2→1) congruences both hold, with slopes β and β′≡β−2/5 (mod 1). The tile is not a column by Lemma E (1/c_1=5/2∉N). Periods are incommensurable since β∉Q and c_1∈Q.\n\nOptional alternative non-column tool (recorded for future use)\n- Fourier complement obstruction (already noted in notes.md). If E+δ=S^1\\E a.e., then e^{2π i t δ} = −1 for every t with \\hat{1_E}(t)≠0. Choosing J_0 so that at least two even Fourier modes are nonzero (e.g., t=2,4) forbids such δ. This is particularly handy if one insists on |J_0|=1/2 (where the boundary lemma alone does not rule out “2-fold tiling” at the boundary).\n\nGaps or clarifications suggested for output.md\n- Add the explicit closure argument to Lemma B (as above). This removes any ambiguity in the “sketch.”\n- Consider adding the gcd-necessity lemma for irreducibility (above) to clarify that H=Z is not just sufficient but necessary for irreducibility. It is short and strengthens the structural picture.\n- Theorem A could include a remark that the |J_0|=1/2 hypothesis is not needed for the existence of the two tilings; any J_0 with J_0+1/2=J_0 works. If one also chooses |J_0|∉{1/m}, non-column follows immediately by Corollary F, avoiding the component-length hypothesis.\n\nNext steps (auditable targets)\n- Rigidity for complementary two-layer tiles. Attempt to show that for A=({0}×J_0)∪({1}×(S^1\\(J_0+α))) with J_0+1/q=J_0 and |J_0|∉{1/m}, every tiling is necessarily singleton (d_n≡1). Plan: use row-by-row complementarity and a boundary bootstrap to rule out d_n≥2 by propagating a contradiction across rows. Start with the q=2 case.\n- m-fold partition obstruction. For |J_0|=1/m, develop a clean criterion (Fourier or component-length) that forbids S^1 being a.e. a disjoint union of m translates of J_0. This would close the remaining corner cases for non-columnity under periodicity.\n- Expand the “two orders” mechanism to K of larger span (e.g., K={0,1,3}). Using Lemma C, classify when two distinct orders are simultaneously compatible and extract the induced affine relations among slopes; then apply a boundary lemma to ensure non-column.\n"
}