{
  "content": "Ideas\n- Formalize and prove a multi-core cohesive existence theorem (a blockwise extension of the cohesive-core result), correcting the best-response marginal bound and handling ties. This yields a new PNE-guaranteeing class assembled from several cohesive unsigned/balanced cores plus a residual S-subgame admitting a PNE.\n- Derive a BR-path existence and a length bound under these cohesive conditions, by exploiting dominance of the core margins and monotone BR paths in unsigned parts.\n- Provide a small working example and discuss when strictness yields BR-invariance of the core part.\n\nTheorem (Multi-core cohesive existence)\nLet V be partitioned as V = (⊔_{t=1}^m R^t) ⊔ S. For each t∈{1,…,m}, assume there exists τ^{(t)}∈{±1}^{R^t} such that\nτ_i^{(t)} W_{ij} τ_j^{(t)} ≥ 0,  for all i,j∈R^t.\nLet σ∈{±1}^V be defined by σ_{R^t}=τ^{(t)} for all t and σ_S=1. Denote the gauge-transformed data by W^{[σ]}=[σ]W[σ] and h^{[σ]}=[σ]h. For a subset B⊆V, define w_i^{B} := ∑_{j∈B} |W^{[σ]}_{ij}|.\nAssume\n(A) w_i^{R^t} + h_i^{[σ]} ≥ w_i^{V\\R^t}, for all i∈R^t and all t.\n(B) The S-restricted game with the core frozen at y_R := 1 (i.e., with external field f_S := h_S^{[σ]} + W^{[σ]}_{S,R} 1) admits a PNE z^*∈{±1}^S.\nThen x^* := [σ](1_R, z^*) is a pure Nash equilibrium of the original SNC game.\nProof. Work in the transformed coordinates. Consider the profile x^{[σ]}=(1_R,z^*). For i∈R^t,\nΔ_i := u_i^{[σ]}(+1, x^{[σ]}_{-i}) − u_i^{[σ]}(−1, x^{[σ]}_{-i}) = 2( h_i^{[σ]} + ∑_{j∈V} W^{[σ]}_{ij} x^{[σ]}_j ).\nSplit V into R^t and its complement:\n∑_{j∈V} W^{[σ]}_{ij} x^{[σ]}_j = ∑_{j∈R^t} W^{[σ]}_{ij}·1 + ∑_{j∉R^t} W^{[σ]}_{ij} x^{[σ]}_j.\nUsing |∑_{j∉R^t} W^{[σ]}_{ij} x^{[σ]}_j| ≤ ∑_{j∉R^t} |W^{[σ]}_{ij}| = w_i^{V\\R^t} and ∑_{j∈R^t} W^{[σ]}_{ij} ≥ − ∑_{j∈R^t} |W^{[σ]}_{ij}| = − w_i^{R^t} (since W^{[σ]}_{R^tR^t} ≥ 0),\nwe get\nΔ_i ≥ 2( h_i^{[σ]} − w_i^{V\\R^t} + ∑_{j∈R^t} W^{[σ]}_{ij} ) ≥ 2( h_i^{[σ]} − w_i^{V\\R^t} − w_i^{R^t} ).\nEquivalently,\nΔ_i ≥ 2( h_i^{[σ]} + w_i^{R^t} − w_i^{V\\R^t} ) ≥ 0,\nby (A). Hence +1 is a best response for every i∈R^t (ties allowed when Δ_i=0). By (B), z^* is a PNE of the S-restricted game with y_R≡1, so every j∈S is best-responding to x^{[σ]} as well. Therefore x^{[σ]} is a PNE of the transformed game, and x^*=[σ]x^{[σ]} is a PNE of the original game (gauge equivalence of best responses). ∎\nRemarks.\n- If the inequalities in (A) are strict for all i∈R^t, then every core player in R plays a strict best response in x^*, which is useful for BR-invariance of the core part.\n- Condition (B) holds if, for instance, G_S is undirected (exact potential) or structurally balanced (after a local gauge, unsigned; supermodular): in both cases the S-subgame admits a PNE for any external field.\n\nCorollary (BR-path existence and length bound)\nUnder the assumptions of the theorem, suppose further that the PNE set of the S-restricted game with y_R≡1 is globally BR-reachable (e.g., S undirected or structurally balanced). Then there exists a BR-path in the full game from any initial profile to some PNE of the form x^*=[σ](1_R,z^*). Moreover:\n- For each i∈R, +1 is a best response in the transformed coordinates for any values of the other coordinates, by (A). Hence, from any initial profile, one can flip each core vertex in R to +1 in at most |R| best-response steps (ties allowed), yielding (1_R, z_0) for some z_0∈{±1}^S.\n- Then follow a BR-path of the S-restricted game from z_0 to z^* (length L_S), keeping y_R≡1. Concatenation yields a BR-path of length ≤ |R| + L_S.\nIf the S-subgame is unsigned (after a gauge), a monotone BR path exists of length L_S ≤ |S|, thus a total bound ≤ |V|.\n\nExample\nLet V={1,2,3,4,5}, R^1={1,2}, R^2={3,4}, S={5}, h=0. Take internal weights W_{12}=W_{21}=2 and W_{34}=W_{43}=2 (already unsigned on R^1,R^2, so τ^{(1)}=τ^{(2)}=1). Let cross weights (arbitrary signs) satisfy for each i∈R, ∑_{j∉R^t}|W_{ij}| ≤ 1. Then w_i^{R^t}=2 and w_i^{V\\R^t} ≤ 1, so (A) holds. The S-subgame has only one node (5), hence (B) holds trivially. Therefore there is a PNE with x_{R^1}=x_{R^2}=+1; x_5 is chosen as a best response to R (either ±1 if indifferent). A BR-path of length ≤5 exists: flip nodes in R to +1 (at most 4 steps), then set x_5.\n\nDiscussion and strictness\n- If w_i^{R^t} + h_i^{[σ]} > w_i^{V\\R^t} for all i∈R, then in the profile x^* the core actions are strict best responses, so any BR move must come from S. If, in addition, the S-subgame admits a BR-stable PNE set (e.g., S undirected), then the set of resulting global equilibria with x_R fixed is BR-invariant.\n\nObstacles\n- The multi-core theorem is sufficient, not necessary. It may fail when (A) does not hold, yet a PNE exists (e.g., due to favorable biases). Identifying necessary conditions remains open.\n\nNext steps\n- Integrate this blockwise cohesive module into the SCC-based pipeline: (i) decompose; (ii) for SCCs failing UPA, search cohesive cores satisfying (A); (iii) check the residual subgame (undirected/structurally balanced) for (B).\n- Provide an algorithm computing a BR path of length ≤ |R|+|S| by the constructive flips above (after a global gauge), and quantify strictness margins required for BR-invariance of the core actions.\n"
}