{
  "content": "Ideas\n\n- We formalize and prove a multi-core cohesive existence theorem (correcting inequalities and clarifying non-uniqueness), and give a constructive BR-path bound. This generalizes the single-core cohesive result to several disjoint cohesive blocks, each internally unsigned after a block-specific signature. These modules fit the SCC-based pipeline and yield auditable, per-instance PNE certificates.\n\nMulti-core cohesive existence (corrected)\n\nSetup. Partition V=R^1 ⊔ … ⊔ R^m ⊔ S. For each t∈{1,…,m}, assume there exists τ^(t)∈{±1}^{R^t} such that the block-induced subgraph G_{R^t}^{[τ^(t)]} is unsigned (equivalently, R^t is structurally balanced with polarization τ^(t)). Define τ_R by concatenating the τ^(t)’s. Let |W_{ij}|-outdegrees w_i^B=∑_{j∈B}|W_{ij}| and w_i^{V\\R^t} analogously.\n\nAssumption (cohesiveness per block). For all t and all i∈R^t,\n\n(1)  w_i^{R^t} + τ_i^{(t)} h_i ≥ w_i^{V\\R^t}.\n\nAssumption (S-subgame feasibility). The S-restricted game with R frozen at τ_R admits a PNE z* (e.g., holds if G_S is undirected or structurally balanced, or each SCC of S is UPA).\n\nTheorem (Multi-core cohesive existence). Under the above assumptions, the full game admits a PNE x* with x*_{R^t}=τ^(t) for all t and x*_S=z*.\n\nProof. Let σ∈{±1}^V be the diagonal signature with σ_{R^t}=τ^(t) and σ_S=1. Consider the [σ]-transformed game. For i∈R^t,\n\nΔ_i(x)=u_i^{[σ]}(+1,x_{−i})−u_i^{[σ]}(−1,x_{−i})=2(h_i^{[σ]}+∑_{j}W^{[σ]}_{ij}x_j).\n\nSplit the sum into j∈R^t and j∉R^t. Since G_{R^t}^{[τ^(t)]} is unsigned, W^{[σ]}_{ij}≥0 for j∈R^t and x_j=+1 there. Hence\n\nΔ_i(x) ≥ 2(h_i^{[σ]} + ∑_{j∈R^t}W^{[σ]}_{ij} − ∑_{j∉R^t}|W^{[σ]}_{ij}|) = 2(τ_i^{(t)}h_i + w_i^{R^t} − w_i^{V\\R^t}) ≥ 0,\n\nby (1). Thus +1∈B_i^{[σ]}(x_{−i}) for all i∈R^t, regardless of x outside R^t. In particular, at any (1_{R}, z) we have every i∈R best-responding. On S, by feasibility, pick z* a PNE for the S-restricted game with R frozen at 1_R (equivalently τ_R in the original game, via Lemma NashGauge). Therefore x^†=(1_R, z*) is a PNE in the transformed game, and x*=[σ]x^† is a PNE in the original game with x*_{R^t}=τ^(t) and x*_S=z*. (Non-uniqueness: if equality holds in (1), best responses may be multi-valued; we only need inclusion.) ∎\n\nConstructive BR path and length bound\n\nLemma (Monotone R-forcing). Under (1), for any profile x, flipping any i∈⋃_t R^t to τ_i yields a best-response move. Hence there exists a BR-path of length ≤∑_t |R^t| from x to (τ_R, x_S).\n\nCorollary (BR-path to PNE). If, in addition, the S-restricted game with R frozen at τ_R has a BR-path to some z* (e.g., holds when S is undirected/structurally balanced), then concatenating yields a BR-path of length ≤∑_t |R^t| + L_S to the PNE (τ_R, z*), where L_S is a BR-path length within S.\n\nRemarks\n\n- The S-feasibility can be certified via SCC composition: if each SCC of S is UPA (undirected, structurally balanced via a signature, 2-node same-sign digon, or functional positive-cycle SCC), then a PNE exists on S for every external field, and often a BR-path exists.\n- If strict inequalities hold in (1), then all i∈R are strict best responders at τ_R; one gets BR-invariance of the R-actions thereafter.\n\nExample (two cores). Let R^1={1,2}, R^2={3}, S={4,5}. Take W inside R^1 as symmetric positive (after τ^(1)=(1,1)), and inside R^2 vacuous; across to V\\R^1 set |W_{1j}|+|W_{2j}| small so that w_i^{R^1}+τ_i h_i ≥ w_i^{V\\R^1}. Analogously for i=3 with τ^(2)=−1. Let G_S undirected. Then a PNE exists with x_{R^1}=(1,1), x_3=−1 and x_S a PNE of the S-restricted game at τ_R.\n\nObstacles\n\n- Necessity of block-wise structural balance for UPA is open beyond the functional case. Negative cycles can be neutralized by non-dominant side arcs, so absence of PNE for all external fields need not follow without dominance.\n\nNext steps\n\n- Integrate the multi-core module into the SCC pipeline: detect cohesive blocks R^t, verify (1) on each, certify S via per-SCC tests, and construct explicit BR paths with the bound. Explore strict versions of (1) to obtain BR-stability of the R-portion and global BR-stable subsets when S-subgames are BR-stable.\n"
}