{
  "summary_md": "Round summary: Established graph-level and modular guarantees for PNE in binary SNC games. Main graph-level result: a dependency digraph guarantees a PNE for every W (supported on the digraph) and every h iff the digraph is acyclic (DAG) — backward induction gives existence and a BR-path; any directed cycle can be signed to obstruct uniform existence. Modular construction: SCC composition — if every SCC is universally PNE-admitting (UPA) under arbitrary external fields (examples: undirected SCCs, structurally balanced SCCs after a gauge, functional-cycle SCCs with positive cycle-sign), then assembling PNEs from sinks upward gives a global PNE and BR-path. Added diagnostics and constructive modules: two-node digon test, functional-digraph cycle-sign test, multi-core cohesive existence, monotone bounded-length BR paths, forest corollary, signed row-sum PNE certificate, and dominant-negative-cycle nonexistence certificate. Citations: papers/paper1.txt; proofs.md.",
  "one_line_summary": "DAGs ⇔ uniform PNE; SCC/gauge composition and UPA tests give constructive PNE",
  "highlights": [
    "Uniform guarantee: dependency digraph guarantees PNE for all W,h iff it is a DAG (backward induction).",
    "SCC composition: if every SCC is UPA (e.g., undirected or structurally balanced via gauge) then a global PNE exists; BR-path constructed by reverse SCC order.",
    "UPA tests added: 2-node digon UPA ⇔ W12·W21≥0; functional-digraph SCCs UPA ⇔ every directed cycle has positive sign product.",
    "Constructive sufficient conditions: cohesive-core inequalities (w_R+τ·h ≥ w_S) and weight-dominance |h_i|>∑_j|W_ij| yield consensus/polarized or strict PNE.",
    "Algorithmic pipeline (draft): DAG check → SCC-decompose → per-SCC gauge/symmetry/functional tests → assemble PNE or apply cohesive-core diagnostics."
  ],
  "next_questions": [
    "Characterize UPA SCCs beyond undirected/structurally-balanced/functional classes (complete structural criterion).",
    "Implement a polynomial-time checker and PNE-constructor following the SCC/gauge/cohesive pipeline and validate on example families.",
    "Evaluate tightness/necessity of cohesive-core and indecomposability bounds; produce minimal counterexamples when they fail."
  ]
}