{
  "progress_md": "Round 0011 — Endpoint‑coupled Stage‑1 is in place; hygiene fixes, tiny‑path fallback, and small auxiliary lemmas for verification and preprocessing\n\nAudit of output.md (gaps and clarifications)\n- Numbering hygiene. Base cases appear as Proposition 6 (k=1→2), Proposition 6B (k=2→3), and Proposition 7 (k=3→4), plus Proposition 6A for k_flag=1 append. This is logically fine but confusing; consider grouping the three base updates under a common “Base cases” header (or renumber 6,7,8) and keep the k_flag=1 variant as a lemma.\n- Interior separator wording (minor ambiguity). In Theorem S1‑path (⇐), the bullet “Interior separators: For each separator between long blocks of types τ_b and τ_c with local inputs s1 and s2 on its two adjacent 2‑node windows …” is ambiguous (a single separator has one 2‑node window and one input s). Suggested clarification: “For each separator S with adjacent long types (τ_L,τ_R) and input s, set its 2‑node output to f_mid(τ_L,s,τ_R). For a pair of consecutive separators S1,S2 (with adjacent long types τ_b,τ_c to the middle block and inputs s1,s2), use W_{b⊙c}[α_L][α_R] with α_L = second(f_mid at S1) and α_R = first(f_mid at S2) to fill the intervening block.”\n- Δ symbol not defined. Propositions 19 and 21 use Δ (maximum out‑degree of E). Add a one‑line definition near Setup: “Let Δ := max_{x∈Σ_out} |{y : E(x,y)}|.”\n\nTiny‑path fallback (to justify the small‑n cases in S1‑path)\nLemma TP (constant‑radius completion for tiny paths). Let K := ℓ_pump+4. There exists a constant M = 2K such that any globally oriented path of length ≤ M can be solved (or rejected) by a deterministic LOCAL algorithm in O(1) rounds using the precomputed Ext tables.\nSketch proof. Precompute, offline, for each input t with |t| ≤ M, whether Ext_t ≠ ∅ and, if so, a witness labeling for each admissible boundary quadruple; by dynamic programming this is O(β^4·2^M) preprocessing (constant in β). At runtime, each node gathers its entire path in M rounds (a constant) and applies the precomputed decision for its exact instance. This justifies the “0 or 1 separator” fallback in S1‑path. Why useful: removes the last informal piece in the (⇐) direction.\n\nEndpoint‑projection identities (implementation/verification aids)\nLemma E1′ (allow sets as E‑neighborhoods). Define L_allow(τ):={α:V_left[τ][α]} and R_allow(τ):={α:V_right[α][τ]}. Then L_allow(τ)=N_E(RightColors(τ)) and R_allow(τ)=N_E^{-1}(LeftColors(τ)).\nProof. Immediate from definitions of V_left,V_right and the endpoint projections. Why useful: quick consistency checks and caches for verifying g_L,g_R.\n\nIncremental updates of endpoint projections under append (k_flag≥4)\nLemma INC (fast update). For τ with k_flag(τ)≥4 and τ′=τ·a,\n- LeftColors(τ′)=LeftColors(τ).\n- RightColors(τ′)={ y∈A_a : ∃x1,x2,x3 with Left3_τ[x1,x2,x3] and E(x3,y) }.\nProof. Left endpoint is unchanged by appending on the right. For the right endpoint, use Lemma 1 in the Left3 formulation (Prop. 19) and project to R1. Why useful: enables incremental maintenance of V_left/V_right during δ‑BFS in O(β^3) per long append.\n\nEarly infeasibility filters for Stage‑1 verification\n- F1 (nonempty Out‑sets). If ∃(τ_b,s) with OutR2(τ_b,s)=∅ or ∃(τ_c,s) with OutL1(τ_c,s)=∅, then no feasible f_mid exists (reject early). Reason: universal extendibility requires these sets to be nonempty to produce seam colors.\n- F2 (endpoint viability). If L_allow(τ_end)=∅ or R_allow(τ_end)=∅, then no endpoint map g_L/g_R exists for τ_end. Reason: V_left/V_right must be satisfiable for at least one seam color.\nWhy useful: reduces certificate search space and speeds up negative instances.\n\nExplicit clarification for Out‑set feasibility check\nLemma E3 (already implied; restated). For all long τ_b,τ_c and inputs s1,s2, the universal clause is equivalent to OutR2(τ_b,s1)×OutL1(τ_c,s2) ⊆ {(α_L,α_R): W_{b⊙c}[α_L][α_R]=true}. Proof is a direct unpacking of Lemma E2 and the definition of W. Why useful: matches the verifier’s implementation (matrix inclusion tests on β×β masks).\n\nSanity check on endpoint coupling (toy obstruction)\n- Minimal obstruction persists if (iii) is dropped: choose τ_b with OutR2(τ_b,s)={α} and pick g_L with second output β2≠α but V_left true; the block between the endpoint separator and the next interior separator may be unfillable as all W_{b⊙c}[β2][·] can be false. This validates the necessity of the alignment condition in g_L/g_R.\n\nComplexity accounting (verification)\n- Precompute T via δ (Prop. 9) with O(β^4) per long append (Prop. 19), |T| ≤ 4·2^{β^4}. Split T_long.\n- Build Ext_τ for τ∈T and Ext_{τ_b⊙τ_c} for all τ_b,τ_c∈T_long (Prop. 5), then W_{b⊙c} (Prop. 21), and V_left,V_right (endpoint projections). These are all in 2^{poly(β)}.\n- Certificate sizes: f_mid has |T_long|^2·4 entries; g_L has |T|·|T_long|·4; g_R symmetric. Verification is table lookups; filters F1–F2 prune trivially impossible instances.\n\nActionable edits to output.md\n1) Add the Δ definition (max out‑degree of E) in Setup; align Prop. 19/21 text to refer to Δ explicitly.\n2) Insert Lemma TP (tiny‑path fallback) with a one‑paragraph proof to justify small‑n handling.\n3) Add Lemma E1′ (allow‑set identities) under the endpoint projections section (optional but harmless and testable).\n4) Optionally add Lemma INC (incremental endpoint projections) in the preprocessing/complexity section as an implementation remark to speed δ‑BFS.\n5) Clarify the interior separator wording in S1‑path (⇐) as noted above.\n\nNext steps toward full trichotomy (kept out of output.md per prior guidance)\n- Formalize the oriented‑path (ℓ_width,ℓ_count,ℓ_pattern) partition (constant rounds) with parameters ℓ_width=ℓ_pattern=ℓ_pump and ℓ_count=2ℓ_pump+2; then port the f0‑based Stage‑2 certificate into output.md. All checks reduce to finitely many Gw,1 and Gw1,w2,S instances with types bounded by ℓ_pump.\n- Add a short “type detection within blocks” remark: since K=ℓ_pump+4 is constant, each separator can learn the input of its O(K) neighborhood in O(1) rounds and determine the adjacent long/short types locally.\n\nWhy these are incremental and auditable\n- Each lemma is a local identity or constant‑radius construction derived mechanically from Ext and already‑defined slices (Left3), and can be unit‑tested on small β by direct enumeration.\n- The tiny‑path fallback removes an informal step, and the Δ definition plus interior‑separator wording fix readability issues without changing substance.\n- Early filters F1–F2 are simple emptiness checks and can be added to the verifier immediately.\n"
}