{
  "content": "Ideas\n- Leverage the “permanent blockers” lemma with our k=1 forest classification to settle cycles exactly. This gives a clean, rigorous proof that h(C_n)=2 for all n≥3.\n- Record explicit schedule lengths for cycles via reduction to paths. This also provides a template for constructing schedules on graphs with a small feedback vertex set.\n- Formalize and prove the “permanent blockers” lemma (used informally before), with an inductive embedding argument on the R-recurrence.\n- Note algorithmic consequences on graphs with small feedback vertex set and propose a concrete n^{O(k)} recognition on that subclass. This provides a partial positive answer (for that family) to the main question.\n\nLemma A (Permanent blockers; formal proof)\nStatement. Let U⊆V(G). If we shoot all vertices of U in every round, then the evader is confined to G−U and the remaining hunters can execute any schedule designed for G−U. Formally, if |U|+q hunters are available and there exists a winning q-hunter schedule on G−U, then h(G)≤|U|+q. Equivalently, for any U, h(G) ≤ |U| + h(G−U).\nProof. Fix a schedule S′=(S′_1,…,S′_t) on G−U with |S′_i|≤q that wins in t rounds (R′_t=∅ under R′_{1}:=V(G−U)\\S′_{1}, R′_{i+1}:=N_{G−U}(R′_i)\\S′_{i+1}). Define a schedule S on G by S_i:=U∪S′_i. Let R_1:=V(G)\\S_1 and R_{i+1}:=N_G(R_i)\\S_{i+1}. We prove by induction that for all i, (i) R_i⊆V(G)\\U and (ii) R_i⊆R′_i. Base i=1: (i) holds since U⊆S_1; (ii) R_1=(V(G−U)\\S′_1)∪(V(G)\\(V(G−U)∪U∪S′_1))=V(G−U)\\S′_1=R′_1. Induction: assume R_i⊆V(G−U) and R_i⊆R′_i. Then N_G(R_i)=N_{G−U}(R_i)∪(N_G(R_i)∩U), and since U⊆S_{i+1}, R_{i+1}=N_G(R_i)\\(U∪S′_{i+1})=N_{G−U}(R_i)\\S′_{i+1}⊆N_{G−U}(R′_i)\\S′_{i+1}=R′_{i+1}. In particular, R_{i+1}⊆V(G−U). Thus R_t⊆R′_t=∅, so S wins in t rounds. ∎\n\nTheorem B (Cycles solved). For all n≥3, h(C_n)=2.\nProof. Lower bound: h(C_n)≥δ(C_n)=2. Upper bound: pick any u∈V(C_n), let U={u}, and note C_n−U≅P_{n−1}. We have h(P_{n−1})=1 (proved previously via the 2(n−1)−3 forward/backward sweep). By Lemma A, h(C_n)≤|U|+h(P_{n−1})=1+1=2. Hence equality holds. Moreover, an explicit winning schedule with two hunters is obtained by permanently shooting u and concurrently executing the 1-hunter path sweep on C_n−u. ∎\n\nCorollary C (Schedule length for cycles). The above construction yields a 2-hunter winning schedule on C_n of length 2(n−1)−3=2n−5. Concretely, label C_n so that u=1 is the permanently shot vertex and the path order on V\\{1} is 2,3,…,n. Then the other hunter fires in the sequence 2,3,…,n−1,n−1,n−2,…,3, with 1 included in every shot set.\n\nRemark on verification. Under R_{1}:=V\\S_{1}, R_{i+1}:=N(R_i)\\S_{i+1}, the inductive embedding used in Lemma A gives for all i: R_i(C_n; {1}∪{x_1,…,x_i}) ⊆ R_i(P_{n−1}; {x_1,…,x_i}), hence emptiness transfers immediately when the path schedule finishes.\n\nProposition D (Feedback vertex set bound; explicit). Let f:=fvs(G) be the minimum size of a vertex set whose deletion makes G acyclic. Then h(G)≤f+1.\nProof. Let U be a minimum feedback vertex set, so G−U is a forest. We have h(G−U)=1 (k=1 classification). Apply Lemma A with q=1. ∎\n\nAlgorithmic corollaries\n- Exact recognition on the subclass with fvs(G)≤k−1. Given k, decide whether h(G)≤k by checking if fvs(G)≤k−1 (then YES by Proposition D) or applying other filters (degeneracy>k ⇒ NO; τ(G)≤k ⇒ YES). Since minimum FVS is FPT in the solution size, this yields n^{O(k)}-time recognition on that subclass.\n- Cycles and cacti. By Theorem B, all cycles have h=2. For cactus graphs, the general upper bound h≤fvs+1 applies; tighter exact formulas (e.g., exploiting shared blockers at articulation points) are a promising target for k=2 structure theorems.\n\nExamples (worked)\n- C_7: Permanently shoot u=1; on the path 2–3–4–5–6–7, fire 2,3,4,5,6,6,5,4,3 while always including 1. Length 9 = 2·6−3. R-embedding ensures R_9=∅.\n- Theta graph (two terminals joined by three internally disjoint paths): fvs=2, so h≤3; δ=2 gives h≥2. Determining whether h=2 or 3 is a concrete k=2 test case for refinement beyond Proposition D.\n\nObstacles\n- The permanent-blockers technique reduces many graphs to forests with an additive +|U|, but this may be loose when cycles share blockers. Exact characterization for broader classes (e.g., series–parallel, cactus, outerplanar) remains open for k=2.\n- A general n^{O(k)} algorithm still lacks a principled bound on the number of reachable R-states from V under the transition Y⊆N(X), |N(X)\\Y|≤k. Absent such a bound, NP-membership (polynomial certificate length) also remains unresolved for k≥2.\n\nNext steps (testable)\n1) Elevate Theorem B (cycles) and Lemma A (permanent blockers) to proofs.md, with the explicit cycle schedule template and length bound 2n−5.\n2) Cactus graphs: attempt an exact formula for h in terms of a minimum set of articulation blockers plus local cycle patterns. Validate by exhaustive R-state search on all cactus graphs up to n≤12.\n3) k=2 program: Enumerate minimal obstructions to h≤2 up to n≤10 using the state-graph BFS; check families like theta graphs and ladders to hypothesize a structural certificate for h=2.\n4) FVS-parameter DP: For given feedback set U, formalize how the single remaining hunter operates on each tree component and coordinate across U’s permanent shots; optimize blockers reuse if multiple cycles share vertices (toward tighter bounds than fvs+1)."
}