{
  "summary_md": "Validated and formalized sampling certificates and augmentation characterizations for IRV ε-winners. Main outcomes: a distribution-free c-first sufficient certificate M_c with plug-in sampling (m = Θ((K+log(1/δ))/ε^2)); an exact K=3 two-type minimal-augmentation formula (five tallies; m = Θ((log(1/δ))/ε^2)); a general-K chain-based two-type certificate (pivot b) computable from O(K) subset tallies and certifiable under a verifiable chain-stability margin with m = Θ((log K + log(1/δ))/ε^2); an LP fixed-order primal/dual exactly characterizes minimal augmentation but the dual 1-norm sensitivity R_K remains open; and a K=4 steering/separation example shows the chain two-type bound is not tight (few-type steering can strictly reduce required mass). Citations: proofs.md, output.md, notes.",
  "highlights": [
    "Sound c-first sufficient certificate M_c with uniform-convergence plug-in test; sample complexity Θ((K+log(1/δ))/ε^2).",
    "Exact K=3 closed-form two-type minimal-augmentation (uses 5 tallies); decide with m = Θ((log(1/δ))/ε^2).",
    "General-K chain-based two-type certificate (pivot b): ε_b^*=B_b+max{A_b,B_b+D_{b,c}}; depends on O(K) tallies and certifiable under chain-stability with m = Θ((log K+log(1/δ))/ε^2).",
    "LP fixed-order primal/dual gives exact optimum but dual-sensitivity constant R_K (sup ||λ||_1) lacks a poly(K) bound—open problem for polynomial sample guarantees.",
    "K≥4 separation: a concrete K=4 profile shows steering with an extra added-top type (beyond {c,pivot}) can reduce required mass (≈0.1002 vs chain bound 0.15), so chain two-type is not tight."
  ],
  "next_questions": [
    "Prove or disprove a polynomial-in-K bound on the LP dual norm R_K, or develop an alternative stability/sensitivity argument for the fixed-order LP.",
    "Formalize a Fano/packing Ω((log K)/ε^2) lower bound for identifying a favorable pivot/opponent among K−1 options.",
    "Develop and analyze few-type targeted-chain LPs; construct K≥4 families witnessing strict improvements of ≥3 added-top types over the chain two-type certificate."
  ]
}