{
  "progress_md": "## Round 0003 — Anchored–anchored refinement, unconditional a-lower bound, and integrating a quantitative gain into Dvořák’s boundary term\n\nStatus and quick audit of output.md\n- Theorem A (KG(n,3) spectral MAX-CUT bound for b) and Lemma B (monochromatic-star fraction τ_v) look correct and useful as book-keeping tools. Note: The numerical corollary “(3/8 + 1/(8(n−3)) + o(1))·n” is not an improvement on 3/8; it only makes the o(1) explicit.\n- Lemma C (pair-sampling under disjointness) and Corollary D (both-good disagreement at v equals 1/2 − u_v^2/2 ± O(1/n)) are in good shape; the O(n^2/t) error with t=Θ(n^3) yields O(1/n) as intended.\n- Missing ingredients to be added later: (i) an explicit import/citation that “anchored at v ⇒ good Q3” (Dvořák Lemma 8) to justify t_v=Θ(n^3) uniformly; (ii) a clean integration of Corollary D into Dvořák’s expected-switch calculation (it currently appears only as a local bound at v); and (iii) a refined anchored–anchored counting lemma with exact formulas and asymptotics (see below).\n- Important correction (for our ongoing notes): in Dvořák’s proof, the expected number of switches inside a Q3-block is 1 − p/2 (not 1 − p^2). The final bound (1/3 + b/12 + o(1))·n comes from 1 − p/2 + (b/2 + (1/2 + o(1))a) and p = a + b/2.\n\nKey new lemmas and quantitative refinements (ready to curate next)\n1) Anchored–anchored pair mass at a vertex and its minimizer.\n- Fix a vertex v with r red and b:=n−r blue incident edges. For an ordered disjoint pair of 3-sets (K,L) at v, both cubes Q3(v,K) and Q3(v,L) are anchored at v iff the three edges at v in the directions of K are monochromatic, and likewise for L. The exact anchored–anchored ordered-pair count equals\n  C(r,3)C(r−3,3) + 2 C(r,3)C(b,3) + C(b,3)C(b−3,3),\n  and the denominator (all ordered disjoint pairs) equals C(n,3)C(n−3,3). Thus the anchored–anchored probability at v is\n  H(r,n) = [C(r,3)C(r−3,3) + 2 C(r,3)C(b,3) + C(b,3)C(b−3,3)] / [C(n,3)C(n−3,3)].\n- As n→∞ with x=r/n, H(r,n) = (x^3 + (1−x)^3)^2 + O(1/n), which is minimized at x=1/2 (since s(x):=x^3+(1−x)^3 is minimized at 1/2). Hence for all large n, H(r,n) ≥ 1/16 − O(1/n), with equality asymptotically at r≈n/2. Next step: give a discrete proof (monotonicity of H(r+1,n)−H(r,n) changing sign at ⌊n/2⌋) valid for all n≥6.\n\n2) Unconditional lower bound on a (both cubes good).\n- “Anchored at v ⇒ good” (Dvořák Lemma 8) implies that anchored–anchored pairs are a subset of both-good pairs. Therefore, averaging over v and the (uniform) choice of a v-neighbor pair,\n  a ≥ E_v[H(r_v,n)].\n- Using the asymptotic from (1), we obtain a uniform, absolute lower bound:\n  a ≥ 1/16 − O(1/n).\n- Strengthening: One can avoid asymptotics by a direct application of Lemma C to the anchored-triple set T_v (of size t_v^anc = C(r_v,3)+C(n−r_v,3)): for a random disjoint pair from all triples, P[both anchored at v] = τ_v^2 ± O(1/n). Since τ_v is minimized at r_v≈n/2 and τ_v ≥ 1/4 − 3/(4n) (Lemma B), the anchored–anchored mass at v is ≥ (1/4 − 3/(4n))^2 − O(1/n), yielding the same absolute bound a ≥ 1/16 − O(1/n).\n\n3) Anchored–anchored disagreement probability and its quadratic drop from 1/2.\n- Conditioning on both being anchored at v, the exact disagreement probability equals\n  P_v[disagree | anchored] = 2 C(r,3) C(b,3) / [C(r,3)C(r−3,3) + 2 C(r,3)C(b,3) + C(b,3)C(b−3,3)].\n- As n→∞ with x=r/n and t=x−1/2,\n  P_v[disagree | anchored] = 2x^3(1−x)^3 / (x^3+(1−x)^3)^2 + O(1/n)\n                           = 1/2 − 18 t^2 + O(t^4 + 1/n).\n  Thus, for vertices with degree imbalance |x−1/2|≥η, anchored–anchored pairs alone produce a drop below 1/2 of order Ω(η^2).\n\nIntegrating into Dvořák’s boundary step (unconditional quantitative gain)\n- In Dvořák’s calculation, the boundary contribution across the k−1 junctions is bounded by (b/2 + (1/2 + o(1)) a)·(n/3). Using (2)–(3), we can refine the both-good (a-term) contribution without invoking any additional structure:\n  • Let J denote the event “at a random junction, the two neighboring Q3’s are both anchored at their shared vertex.” By the above, P[J] = E_v[τ_v^2] ± O(1/n) ≥ (1/16 − o(1)).\n  • On J, the boundary switch probability is 1/2 − 18 E_v[(x_v−1/2)^2 | J] + o(1); off J but still in the both-good case we keep the crude 1/2 bound.\n  • Therefore, the unconditional both-good boundary-switch probability drops from (1/2)·a by at least\n    Δ_total ≥ 18·E_v[(x_v−1/2)^2 · 1_J] − o(1) = 18·E_v[T_v·τ_v^2] − o(1),\n    where T_v:=(x_v−1/2)^2 and we used P[J | v] = τ_v^2 ± O(1/n).\n- Consequently, the expected number of switches satisfies the refined inequality\n  E[switches] ≤ [ (1 − p/2) + (b/2 + (1/2)a − Δ_total) ]·(n/3) + o(n)\n               = (1/3 + b/12)·n − (Δ_total/3)·n + o(n).\n- Using τ_v ≥ 1/4 − O(1/n), we obtain a clean unconditional corollary:\n  E[switches] ≤ (1/3 + b/12)·n − 6·E_v[T_v]·(1/16 − o(1))·n + o(n)\n               = (1/3 + b/12)·n − (3/8)·E_v[T_v]·n + o(n).\n  Thus, in any coloring with nontrivial mean-square degree imbalance E_v[T_v] ≥ ε, we gain a linear improvement of magnitude (3ε/8 − o(1))·n over the baseline (1/3 + b/12)·n. The balanced-degree regime (E_v[T_v] ≈ 0) remains the hard case, where we must force b ≤ 1/2 − γ via structural constraints.\n\nWhy useful here\n- The anchored–anchored analysis yields two robust facts: an absolute lower bound a ≥ 1/16 − o(1), and a quantitative drop of the both-good boundary switch probability by a term ≥ 18·E_v[T_v·τ_v^2] − o(1). These are unconditional and compatible with Dvořák’s scheme. They give an explicit, checkable source of savings whenever degree variance is non-negligible, sharply isolating the balanced-degree regime for further work on b.\n\nExamples and sanity checks\n- Perfectly balanced degrees (r_v ≡ n/2): τ_v ≈ 1/4, H ≈ 1/16, P[disagree | anchored] = 1/2; our refinement produces no gain, as expected.\n- Biased degrees (say x_v ≡ 1/2+0.1 on a positive fraction of vertices): T_v = 0.01. Then P[disagree | anchored] ≈ 1/2 − 0.18, and τ_v ≈ 0.251..., so Δ_total ≳ 18·0.01·(0.25)^2 ≈ 0.01125, giving an absolute reduction of about 0.00375·n switches after the (1/3) factor—substantial at scale.\n\nObstacles and open technical points\n- Discrete minimization: Provide a self-contained proof (no asymptotics) that H(r,n) is minimized at r∈{⌊n/2⌋,⌈n/2⌉} for all n≥6.\n- Weighting caveat: The “both-good” boundary probability is an average over vertices weighted by the mass of both-good v-neighbor pairs. We sidestepped this by extracting an unconditional Δ_total via anchored–anchored pairs. A stronger refinement (using Corollary D’s u_v) should control the conditional drop 1/2 − P[switch | both-good] by a weighted average of u_v^2; formalizing a lower bound on the weighted mean in terms of E_v[u_v^2] would further improve the statement. A natural route is to show Cov(t_v^2, u_v^2) ≥ 0 (t_v is the count of good triples at v), yielding a weighted-average ≥ uniform-average inequality.\n- Balanced regime: We still need to push b ≤ 1/2 − γ using local consistency (4-cycles, badness structure). This remains the central challenge.\n\nNext steps (concrete, auditable)\n1) Curate two new lemmas into output.md:\n   - Lemma E (Anchored–anchored mass and a≥1/16 − O(1/n)) with a short proof via Lemma C and Lemma B.\n   - Lemma F (Anchored–anchored disagreement probability and the 1/2 − 18t^2 expansion), with a precise derivation as above.\n   Then state the refined global inequality: E[switches] ≤ (1/3 + b/12)·n − (Δ_total/3)·n + o(n), with Δ_total ≥ 18·E_v[T_v·τ_v^2] − o(1).\n2) Prove discrete minimization of H(r,n): Show H(r+1,n)−H(r,n) changes sign exactly once at ⌊n/2⌋ (discrete convexity of r↦C(r,3) and a careful telescoping argument on the product terms).\n3) Balanced-degree regime LP: Begin the LP in the symmetric case r_v≡n/2. Variables: frequencies of 4-cycle types at v; frequencies of Q3 pattern classes with a marked vertex and their f1-start color. Constraints: marginalization, 4-cycle consistency, Dvořák badness filter (Lemma 9). Objective: maximize b subject to these constraints. Deliverable: a numerical upper bound strictly below 1/2 (even γ≈10^{-3} would be compelling).\n4) Enumerate Q3 types with a marked vertex (up to automorphism), classify good/bad and, for good, the f1-start color at the mark. This feeds (3) and also allows a refined both-good analysis beyond anchored cubes.\n\nWhy this is progress\n- We obtained an absolute lower bound a≥1/16−o(1) and a concrete, unconditional reduction Δ_total in the both-good boundary term proportional to the mean-square degree imbalance. These are new, testable refinements within Dvořák’s framework. They carve out the balanced regime as the sole obstruction and set up the LP attack on b ≤ 1/2 − γ under local consistency constraints.\n"
}