{
  "content": "Ideas\n- Close the fixed-order LP sensitivity gap by upper-bounding the dual 1-norm. This yields a clean Lipschitz constant and a polynomial-in-K sample bound for certifying any fixed elimination order π.\n- Record a general “two-type along a spine” sufficient certificate for K ≥ 4 (eliminate all non-spine opponents before a final between c and a chosen b), which subsumes the K = 3 formula when only one non-spine opponent exists.\n- Provide a K-dependent lower-bound template via Fano, indicating an Ω((log K)/ε^2) necessity in general.\n\nLemma 1 (Dual 1-norm bound for a fixed elimination order).\nFix an elimination order π on K candidates and slack γ > 0. Let S_j = {π(j),…,π(K)} for j = 1,…,K−1. Consider the LP (minimize total added mass) with constraints\n(t_a(S_j) − t_{π(j)}(S_j)) + ∑_r y(r)(1[top_{S_j}(r)=a] − 1[top_{S_j}(r)=π(j)]) ≥ γ\nfor every j and a ∈ S_j \\ {π(j)}. Its dual feasible set Λ_π consists of λ ≥ 0 such that, for every ranking r,\n∑_{j=1}^{K-1} ∑_{a∈S_j\\{π(j)}} λ_{j,a}(1[top_{S_j}(r)=a] − 1[top_{S_j}(r)=π(j)]) ≤ 1.\nThen sup_{λ∈Λ_π} ||λ||_1 ≤ K.\n\nProof.\nFor each candidate x, consider the “champion” ranking r_x that places x at the very top (ties arbitrary below). Then for every j with x ∈ S_j \\ {π(j)}, we have top_{S_j}(r_x) = x, while top_{S_j}(r_x) ≠ π(j). The dual constraint for r_x reduces to ∑_{j: x∈S_j\\{π(j)}} λ_{j,x} ≤ 1. Summing these K inequalities over x gives ∑_{x} ∑_{j: x∈S_j\\{π(j)}} λ_{j,x} ≤ K. The left-hand side is exactly ∑_{j}∑_{a∈S_j\\{π(j)}} λ_{j,a} = ||λ||_1. Hence ||λ||_1 ≤ K for all λ ∈ Λ_π, proving the claim.\n\nCorollary 2 (Lipschitz sensitivity for a fixed π).\nLet v_π(b) denote the optimal value of the primal as a function of the right-hand sides b_{j,a} = γ − (t_a(S_j) − t_{π(j)}(S_j)). Then for any perturbation Δ,\n|v_π(b+Δ) − v_π(b)| ≤ K ||Δ||_∞.\n\nProof.\nBy LP duality, v_π(b) = max_{λ∈Λ_π} b^T λ. Hence |v_π(b+Δ) − v_π(b)| = |max_{λ} (b+Δ)^T λ − max_{λ} b^T λ| ≤ sup_{λ∈Λ_π} |Δ^T λ| ≤ (sup_{λ} ||λ||_1) ||Δ||_∞ ≤ K ||Δ||_∞ by Lemma 1.\n\nCorollary 3 (Sampling to certify a fixed order π).\nFor a fixed π, the constraints involve at most M_π := ∑_{j=1}^{K-1} |S_j| ≤ K(K−1)/2 distinct top-of-S indicators. Hoeffding plus a union bound implies that with m ≥ c (log(M_π) + log(2/δ)) / τ^2 samples, we have\nsup_{j,a} |(\\hat t_a(S_j) − \\hat t_{π(j)}(S_j)) − (t_a(S_j) − t_{π(j)}(S_j))| ≤ 2τ\nwith probability ≥ 1 − δ. Therefore, |\\hat v_π − v_π| ≤ K · 2τ. Setting 2Kτ = η, it suffices to take m = Θ((log K + log(1/δ))/η^2).\n\nUsefulness: This gives a polynomial-in-K sample bound to accurately evaluate the minimal augmentation for any fixed π. As a one-sided, sound certifier: if \\hat v_π ≤ ε − η, then v_π ≤ ε and the target winner is an ε-winner via π. This does not require uniform estimation over all π.\n\nRemark (On selecting π).\nSearching all π is computationally large. Practically, evaluate \\hat v_π for a small set of candidate orders (e.g., the empirical IRV order; orders obtained by swapping adjacent eliminations; or a handful of “spine” orders defined below). Whenever any order certifies (\\hat v_π ≤ ε − η), the certificate is valid. Guaranteeing success for all instances still requires either a structural approximation result over orders or a broader (potentially exponential) uniform estimation; establishing such an approximation is open.\n\nProposition 4 (Spine two-type sufficient certificate for general K).\nFix c and choose a “spine opponent” b ≠ c. Let γ > 0. Define\nA_γ(b) := max_{S ⊇ {b,c}} max_{a ∈ S\\{b,c}} [t_a(S) − t_c(S) + γ]_+,\nB_γ(b) := max_{S ⊇ {b,c}} max_{a ∈ S\\{b,c}} [t_a(S) − t_b(S) + γ]_+,\nD_γ(b) := t_b({b,c}) − t_c({b,c}) + γ.\nIf one adds α c-first and β b-first ballots with α ≥ A_γ(b), β ≥ B_γ(b), and α − β ≥ D_γ(b), then along any elimination path that always removes candidates in S\\{b,c} before either b or c, every such a ∈ S\\{b,c} is eliminated strictly before {b,c}, and c defeats b in the final. Hence c is the winner. The total added mass α+β is minimized by\nε_spine(b;γ) = B_γ(b) + max{A_γ(b), B_γ(b) + D_γ(b)}.\n\nProof (sketch).\n- First-round and all intermediate rounds that involve S ⊇ {b,c}: For every a ∈ S\\{b,c}, the constraints α ≥ A_γ(b) and β ≥ B_γ(b) ensure p'_a(S) < min{p'_b(S), p'_c(S)} with strict margin γ, so a is never the minimal among S.\n- Final: Each c-first (resp. b-first) ballot contributes +1 to t'_c({b,c}) (resp. t'_b({b,c})). The condition α − β ≥ D_γ(b) enforces a strict c-over-b final.\n- Optimality under these constraints is the same 2D linear minimization as K = 3: set β = B_γ(b) and α = max{A_γ(b), B_γ(b) + D_γ(b)}.\nWhen K = 3, the maxima in A_γ, B_γ collapse to the unique S = {a,b,c}, recovering the exact formula from the notes. For K ≥ 4, this remains a sound (generally non-tight) certificate that uses only two ballot types.\n\nExample (K = 4, certificate beating c-first-only bound).\nLet first-round shares be p_c = 0.24, p_b = 0.26, p_d = 0.25, p_a = 0.25. Suppose for all S ⊇ {b,c} and a ∈ S\\{b,c}, the gaps t_a(S) − t_b(S) ≤ 0.03 and t_a(S) − t_c(S) ≤ 0.09, while t_b({b,c}) − t_c({b,c}) = 0.04. Then ε_spine(b;0) = 0.03 + max{0.09, 0.07} = 0.12, while the c-first certificate requires max_S min_{x≠c}(t_x(S) − t_c(S))_+ ≥ 0.09. If the worst S for c-first is larger than 0.12 (possible when some S inflates a over both c and b while keeping b close to c head-to-head), the spine certificate may strictly improve the bound.\n\nLower bound sketch: Ω((log K)/ε^2) via packing.\nConstruct a family {P_s}_{s=1}^K of ranking distributions such that (i) under P_s, candidate s is an ε/4-winner while every x ≠ s is not an ε/2-winner; (ii) the pairwise KL divergences satisfy KL(P_s||P_{s′}) ≤ C ε^2 for a constant C. For instance, start from an impartial culture and introduce a small Mallows-type tilt that makes s pairwise beat all others by margin Θ(ε) while keeping all other interactions symmetric; IRV need not elect s, but an O(ε) augmentation (along an appropriate spine with b chosen adversarially) suffices to force s to win, whereas forcing any x ≠ s would require > ε/2. Standard Fano’s inequality then implies that any algorithm identifying an ε/2-winner with probability ≥ 2/3 must use m ≥ c (log K)/ε^2 samples. Formalizing one such tilt with explicit verification of (i)–(ii) is a concrete next step.\n\nObstacles\n- Tightness of the K-bound: while ||λ||_1 ≤ K is sufficient for polynomial sensitivity, it may be loose; sharpening it (e.g., to O(log K)) would further reduce the safety margin needed.\n- Selecting π without exponential exploration remains open. Either structural approximation over a poly(K)-sized family of orders or data-dependent strategies with uniform generalization bounds (beyond naive union over (a,S)) are needed.\n- The spine certificate is sufficient, not necessary, for K ≥ 4; characterizing exact minimal augmentation even for a fixed π seems to require more than two ballot types in general.\n\nNext steps\n- Elevate Lemma 1 and Corollary 2 into notes/proofs; add Corollary 3 as a sampling guarantee for any fixed order π.\n- Explore poly(K)-sized families of “spine” orders that approximate optimal LP value within an additive α = o(ε), enabling polynomial sample guarantees without exponential union bounds.\n- Formalize the Fano-based Ω((log K)/ε^2) lower bound with an explicit tilted impartial-culture construction and full verification of ε-winner separations.\n- Investigate whether the dual K-bound plus structural constraints on rankings can yield Rademacher-style uniform controls over {v_π}_π without enumerating all (a,S).\n\nMinor refinement (K = 3 plug-in Lipschitz constant).\nFor K = 3, the map (p_a,p_b,p_c,t_c({b,c}),t_c({a,c})) ↦ ε^*(γ;c) is 6-Lipschitz in the sup norm: A_γ, B_γ, D_γ each vary by ≤ 2τ under τ-perturbations of their inputs, and ε^* = B_γ + max{A_γ, B_γ + D_γ} varies by at most 6τ. Choosing τ = ε/12 gives m = Θ((log(1/δ))/ε^2) for a safe plug-in decision."
}