{
  "summary_md": "This round formalized sound sampling certificates and exact/sufficient augmentation formulas for IRV ε-winners. Key results: a distribution-free c-first sufficient certificate M_c with uniform-convergence sampling (m = Θ((K + log(1/δ))/ε^2)); an exact K=3 closed-form two-type minimal-augmentation ε^*(c) computable from five tallies with m = Θ((log(1/δ))/ε^2); a sound general-K chain-based two-type certificate (pivot b) depending on O(K) subset tallies; and an LP fixed-order formulation that exactly characterizes minimal augmentation but whose dual-sensitivity constant R_K (sup ||λ||_1) is open, blocking a proven polynomial-in-K sample bound. The universal lower bound Ω((1/ε^2) log(1/δ)) holds. Citations: notes (round), proofs.md, output.md.",
  "highlights": [
    "Sound c-first certificate M_c := max_{S⊆C, c∈S}[min_{a≠c} t_a(S)−t_c(S)]_+; if ε>M_c adding ε c-first ballots makes c win. Uniform estimation gives m = Θ((K+log(1/δ))/ε^2).",
    "Exact K=3 two-type reduction: ε^*(c)=min{ε_a^*,ε_b^*} with closed-form ε_a^*=B_γ+max{A_γ,B_γ+D_γ}; needs five tallies and m=Θ((log(1/δ))/ε^2).",
    "Counterexample: c-first certificate can be loose for K=3—mixed additions may need strictly less mass (example a=0.38,b=0.35,c=0.27 yields 0.14 vs 0.20).",
    "General-K chain-based two-type sufficient certificate (pivot b): define elimination chain e_j and A_b,B_b,D_{b,c}; minimal two-type mass = B_b+max{A_b,B_b+D_{b,c}}; depends on O(K) subset tallies.",
    "LP fixed-order primal/dual exactly characterizes minimal added mass, but sensitivity bound depends on R_K = sup_{λ∈Λ} ||λ||_1; bounding R_K=poly(K) is open, preventing a provable poly(K) sample guarantee for exact certification.",
    "Information-theoretic lower bound: m = Ω((1/ε^2) log(1/δ)) is necessary (even for K=2); K-dependent lower bounds remain to be formalized."
  ],
  "next_questions": [
    "Prove (or disprove) a polynomial-in-K bound on the dual norm R_K = sup_{λ∈Λ} ||λ||_1 for the fixed-order LP (or find an alternative stability/sensitivity argument).",
    "Formalize and add the chain-based certificate to proofs.md and construct a K≥4 instance where a third ballot type strictly reduces required augmentation vs the two-type bound."
  ]
}