{
  "feedback_md": "Overall: Good progress on sound sufficient conditions and K=3 exactness, but two major issues surfaced: (i) a flawed general-K “two-type” reduction that only looks at first-round shares, and (ii) incorrect dual-norm bounds for the fixed-order LP. We can safely advance by recording the K=3 exact formula and a sound general-K chain-based two-type certificate; the dual sensitivity bound remains open.\n\nProver 1: Your general-K two-type theorem is unsound. You replace all round-j tallies t_w(S) by first-round shares p_w, concluding that nonfinal candidates are eliminated in ascending order of p_w. In IRV, t_w(S) can be much larger than p_w after transfers. Minimal counterexample (K=4): Take p = (p_a, p_b, p_c, p_y) = (0.26, 0.26, 0.23, 0.25). Suppose after eliminating a, the round-2 tallies on S={b,c,y} are (t_b(S), t_c(S), t_y(S)) = (0.40, 0.25, 0.35). Your bounds give A* = max_w(p_w − p_c)_+ = 0.03 and B* = max_w(p_w − p_y)_+ = 0.01, but they do not ensure c and y beat b in S since b’s tally is 0.40. Any proof must use t_w(S) for the actual S, not just p_w.\n\nProver 2 and 3: The dual 1-norm bounds (≤K and ≤K−1) are incorrect. In the dual constraint for the ranking r_x that places x first, there is a negative term at j = pos_π(x): −∑_{a∈S_j\\{x}} λ_{j,a}. Dropping this term yields ∑_{j<pos(x)} λ_{j,x} ≤ 1, from which summing over x wrongly gives ||λ||_1 ≤ K (or K−1). Including the negative term, the sum over x cancels and yields 0 ≤ K, providing no bound. Hence the claimed Lipschitz sensitivity constants do not follow. Also, the K=3 Lipschitz constant L=3 asserted by Prover 3 is too small: A, B, D each have sup-norm Lipschitz constant 2, so a safe bound is L ≤ 6.\n\nProver 4: Your chain-based two-type certificate is sound and aligns with IRV mechanics: fix b, follow the baseline minimal-of-others chain e_1,…,e_{K−2} (with the election’s tie-breaking), and require α ≥ max_j[t_{e_j}(S_j) − t_c(S_j) + γ]_+ and β ≥ max_j[t_{e_j}(S_j) − t_b(S_j) + γ]_+, plus α − β ≥ t_b({b,c}) − t_c({b,c}) + γ. This ensures elimination along that chain and a strict c-over-b final; the optimal two-type mass is B + max{A, B + D}. Minor fix: when stating dominance, note that rankings with top_{S_j} = e_j harm constraints and are excluded at optimum, but they do not contribute zero.\n\nNext steps:\n- Formalize and add the chain-based two-type certificate (general K) and the K=3 exact formula to proofs.md; keep the c-first certificate and its sampling guarantee.\n- Attempt a separation example for K≥4 where two-type is suboptimal (requires a third type).\n- Revisit the LP dual bound with the negative terms intact; explore alternative dual test rankings or structural decompositions to bound sup||λ||_1.\n- Lower bounds: formalize a Fano/packing instance yielding Ω((log K)/ε^2) for any certificate that must identify a favorable opponent among K−1.\n",
  "summary_md": "We confirmed and formalized: (1) a sound c-first sufficient certificate with uniform-convergence sampling; (2) an exact K=3 two-type formula with sampling guarantee; and (3) a sound general-K chain-based two-type certificate (fix pivot b and follow the minimal-of-others chain). We rejected: Prover 1’s general-K two-type result based solely on first-round shares (invalid), and Provers 2–3’s dual 1-norm bounds (omit negative terms) and K=3 Lipschitz L=3 (too small). Main open item: a correct polynomial dual sensitivity bound for the fixed-order LP; plus tighter K-dependent lower bounds. We updated proofs with the validated theorems and output with concise upper/lower bounds and the K=3 exact result.",
  "verdict": "uncertain",
  "blocking_issues": [
    "General-K fixed-order LP sensitivity: no valid bound on sup_{λ} ||λ||_1; prior proofs ignored negative dual terms",
    "Prover 1’s general-K two-type certificate incorrectly uses first-round shares for later rounds; needs subset tallies t_w(S)",
    "Lack of a demonstrated K≥4 instance showing two-type insufficiency or a tighter general certificate",
    "Rigorous K-dependent lower bounds beyond Ω((1/ε^2) log(1/δ)) remain to be formalized"
  ],
  "per_prover": [
    {
      "prover_id": "01",
      "brief_feedback": "Your general-K two-type theorem is unsound: elimination in later rounds depends on t_w(S), not p_w. The claim that nonfinal candidates drop in ascending p_w can fail badly after transfers. Provide constraints using actual subset tallies or restrict to a specific elimination chain as in Prover 4.",
      "score": "unlikely"
    },
    {
      "prover_id": "02",
      "brief_feedback": "The dual 1-norm ≤ K bound drops negative contributions at j = pos_π(x). Summing the corrected constraints yields only 0 ≤ K. Thus the sensitivity and sampling corollaries do not follow. The ‘spine’ certificate idea is fine as a sufficient condition but needs subset tallies, not just first-round.",
      "score": "unlikely"
    },
    {
      "prover_id": "03",
      "brief_feedback": "Same dual-bound flaw as P2 and an incorrect Lipschitz constant L=3 for K=3 (A,B,D are each 2-Lipschitz under sup norm). Please revise the dual analysis keeping negative terms and re-evaluate Lipschitz constants.",
      "score": "unlikely"
    },
    {
      "prover_id": "04",
      "brief_feedback": "Good, sound chain-based two-type certificate for general K and clear K=4 example. Minor fix: rankings with top_{S_j}=e_j hurt constraints (not zero), but they are never used at optimum. Your sample-splitting approach is reasonable under separation; highlight its assumption clearly.",
      "score": "promising"
    }
  ],
  "notes_update": {
    "action": "append",
    "content": "Updates (verifier audit)\n\n- Invalid general-K two-type claim (first-round-based). It is not enough to compare only first-round shares p_x. Later-round tallies t_w(S) can substantially exceed p_w after transfers. Counterexample sketch (K=4): Let p=(0.26,0.26,0.23,0.25) for (a,b,c,y). Suppose after removing a the tallies on S={b,c,y} are (t_b,t_c,t_y)=(0.40,0.25,0.35). A two-type bound computed only from p would take A*≈0.03 and B*≈0.01, which does not keep c,y above b in S: c would still be the round-2 loser. Any sound certificate must use the relevant subset tallies t_w(S).\n\n- Dual sensitivity (fixed-order LP): prior attempts to bound sup_{λ} ||λ||_1 by K or K−1 dropped the negative term at j=pos_π(x) in the dual constraints. Including it makes the ‘sum over x’ argument cancel, giving no bound. The sensitivity constant remains open.\n\n- Sound general-K two-type (chain) certificate. For target c and pivot b, let S_1=C and iteratively remove e_j = argmin_{e∈S_j\\{b,c}} t_e(S_j), with the same deterministic tie-breaking as the election, forming S_{j+1}=S_j\\{e_j}. Define\n  A_b(γ)=max_j [t_{e_j}(S_j)−t_c(S_j)+γ]_+,\n  B_b(γ)=max_j [t_{e_j}(S_j)−t_b(S_j)+γ]_+,\n  D_{b,c}(γ)=t_b({b,c})−t_c({b,c})+γ.\nAdding α≥A_b(γ) of c-first and β≥B_b(γ) of b-first ballots ensures elimination of e_1,…,e_{K−2} in order and a strict c-over-b final if α−β≥D_{b,c}(γ). The minimal two-type mass is B_b+max{A_b, B_b+D_{b,c}}. This is a sufficient, efficiently checkable condition depending on O(K) subset tallies (those on the chain sets S_j and the final pair).\n\n- K=3 exact formula. The minimal augmentation to make c win is ε^*(γ;c)=min{ε_a^*(γ), ε_b^*(γ)}, where for first-eliminate a: A_γ=[p_a−p_c+γ]_+, B_γ=[p_a−p_b+γ]_+, D_γ=t_b({b,c})−t_c({b,c})+γ, and ε_a^*(γ)=B_γ+max{A_γ, B_γ+D_γ}. This matches the earlier counterexample and strictly improves the c-first certificate. A safe plug-in Lipschitz constant is 6 under sup-norm perturbations of the five required tallies.\n\nNext steps\n- Formalize the chain-based certificate (statement and proof) and add it to proofs.md; keep the K=3 exact theorem and the c-first certificate with sampling.\n- Construct a K≥4 instance where adding a third ballot type strictly reduces the required mass relative to the two-type bound.\n- Pursue a correct dual-norm bound for the fixed-order LP (retain negative contributions); explore alternative dual test rankings or decompositions by rounds.\n- Lower bounds: formalize a Fano/packing family showing Ω((log K)/ε^2) for identifying a favorable opponent y among K−1 possibilities.\n"
  },
  "proofs_update": {
    "action": "append",
    "content": "Preliminaries\n\n- Candidates C, |C|=K. For nonempty S⊆C and a∈S, let t_a(S)=Pr[top among S is a] under the population distribution over full rankings. Adding a nonnegative measure y on rankings (||y||_1 denotes its total mass) updates tallies additively: t'_a(S)=t_a(S)+∑_r y(r) 1[top_S(r)=a]. We assume a fixed deterministic tie-breaking rule; we enforce strict margins via a slack γ>0 so ties are irrelevant.\n\nTheorem 1 (Uniform convergence for top-of-S tallies).\nLet F={1[top_S(r)=a]: a∈S⊆C, |S|≥1}. For m i.i.d. ballots and any δ∈(0,1), with probability ≥1−δ we have sup_{a,S} |\\hat t_a(S)−t_a(S)| ≤ τ whenever m ≥ c (log(K·2^{K−1})+log(2/δ))/τ^2 for a universal constant c.\n\nProof. Hoeffding’s inequality and a union bound over |F| ≤ K·2^{K−1}.\n\nTheorem 2 (Sufficient c-first certificate).\nFix c∈C and define M_c:=max_{S⊆C, c∈S, |S|≥2} [min_{a∈S\\{c}} t_a(S) − t_c(S)]_+. If ε > M_c, then adding any ε' with M_c < ε' ≤ ε of c-first ballots makes c the IRV winner (strictly, by γ absorbed into ε').\n\nProof. For each S with c∈S, t'_c(S)=t_c(S)+ε' > min_{a≠c} t_a(S), so c is never the unique minimum in any round and thus survives to win.\n\nCorollary 3 (Sampling for the c-first certificate).\nLet \\hat M_c be the plug-in estimator of M_c from \\hat t. Then |\\hat M_c−M_c| ≤ 2τ under sup_{a,S} |\\hat t_a(S)−t_a(S)| ≤ τ. Consequently, output any c with \\hat M_c ≤ ε−2τ; with probability ≥1−δ, c is an ε-winner. Taking τ=ε/4 gives m=Θ((K+log(1/δ))/ε^2).\n\nProof. For fixed S, the map (t_a(S))_{a∈S} ↦ min_{a≠c} t_a(S) − t_c(S) is 2-Lipschitz in sup norm; positive part and max preserve Lipschitzness.\n\nProposition 4 (Necessary ε,δ dependence).\nAny algorithm that outputs an ε-winner with probability ≥1−δ requires m=Ω((1/ε^2) log(1/δ)).\n\nProof. For K=2 (majority), distinguishing µ≥1/2−ε from µ≤1/2−2ε needs Ω((1/ε^2) log(1/δ)).\n\nTheorem 5 (K=3 exact minimal augmentation).\nLet C={a,b,c} and fix target c. Write first-round shares p_x:=t_x({a,b,c}) and pairwise tallies t_x({b,c}), t_x({a,c}). For γ>0 define\nA_γ:=[p_a−p_c+γ]_+,\nB_γ:=[p_a−p_b+γ]_+,\nD_γ:=t_b({b,c})−t_c({b,c})+γ.\nLet ε_a^*(γ) be the minimum total mass needed to eliminate a first and make c beat b in the final by ≥γ. Then ε_a^*(γ)=B_γ+max{A_γ, B_γ+D_γ}. Symmetrically, ε_b^*(γ)=B'_γ+max{A'_γ, B'_γ+D'_γ} with a↔b. The exact minimal augmentation is ε^*(γ;c)=min{ε_a^*(γ), ε_b^*(γ)}, and ε^*(c)=lim_{γ→0^+} ε^*(γ;c).\n\nProof. Sufficiency: adding α c-first and β b-first changes p'_a=p_a, p'_b=p_b+β, p'_c=p_c+α, so a is strictly below both b and c in round 1 if α≥A_γ and β≥B_γ. In the final, t'_c({b,c})−t'_b({b,c})=(t_c−t_b)+α−β, so α−β≥D_γ ensures a strict c-over-b win. Optimality over two types reduces to minimizing α+β over α≥A_γ, β≥B_γ, α−β≥D_γ, whose solution is β=B_γ and α=max{A_γ, B_γ+D_γ}. Taking the better of eliminating a or b first yields ε^*(γ;c).\n\nTheorem 6 (General K chain-based two-type certificate).\nFix c∈C and choose a pivot b∈C\\{c}. Set S_1:=C. For j=1,…,K−2, let e_j be the (tie-broken) minimizer of t_e(S_j) over e∈S_j\\{b,c}, and define S_{j+1}:=S_j\\{e_j}. Let\nA_b(γ):=max_{1≤j≤K−2} [t_{e_j}(S_j)−t_c(S_j)+γ]_+,\nB_b(γ):=max_{1≤j≤K−2} [t_{e_j}(S_j)−t_b(S_j)+γ]_+,\nD_{b,c}(γ):=t_b({b,c})−t_c({b,c})+γ.\nIf we add α≥0 of c-first ballots and β≥0 of b-first ballots with α≥A_b(γ), β≥B_b(γ), and α−β≥D_{b,c}(γ), then the IRV elimination proceeds by removing e_1,…,e_{K−2} (in order) before {b,c}, and c defeats b in the final by ≥γ. Among such two-type additions, the minimum total mass is\nε_b^*(γ)=B_b(γ)+max{A_b(γ), B_b(γ)+D_{b,c}(γ)}.\n\nProof. Induct on j. For S_j, by construction e_j is the minimal among S_j\\{b,c}. Since only c and b tallies increase, all other candidates remain at baseline and e_j remains the (tie-broken) minimum among S_j\\{b,c}. The constraints α≥A_b(γ), β≥B_b(γ) imply t'_c(S_j)>t'_{e_j}(S_j) and t'_b(S_j)>t'_{e_j}(S_j), so e_j is the unique minimum in S_j and is eliminated. This yields S_{j+1}. In the final between b and c, each c-first (resp. b-first) ballot adds +1 to t'_c({b,c}) (resp. t'_b({b,c})), so α−β≥D_{b,c}(γ) ensures a strict c-over-b win. Minimizing α+β over the three halfspaces gives β=B_b(γ) and α=max{A_b(γ), B_b(γ)+D_{b,c}(γ)}.\n\nCorollary 7 (K=3 sampling for exact ε^*).\nEstimating the five quantities {p_a,p_b,p_c,t_c({b,c}),t_c({a,c})} within τ by m=Θ((log(1/δ))/τ^2) samples and using a safety margin 6τ yields a correct plug-in decision with probability ≥1−δ. Choosing τ=Θ(ε) gives m=Θ((log(1/δ))/ε^2).\n"
  },
  "output_update": {
    "action": "replace",
    "content": "Main results on sampling ε-winners under IRV\n\n- Sufficient certificate (all K): Define M_c:=max_{S⊆C, c∈S, |S|≥2} [min_{a∈S\\{c}} t_a(S) − t_c(S)]_+. If ε > M_c, adding ε of c-first ballots makes c win. With m = Θ((K + log(1/δ))/ε^2) random ballots, we can uniformly estimate all required tallies and soundly certify any c with high probability.\n\n- Exact characterization for K = 3: For C={a,b,c}, the minimal added mass to make c win is ε^*(c)=min{ε_a^*, ε_b^*}, where for eliminating a first,\n  ε_a^* = [p_a−p_b]_+ + max{ [p_a−p_c]_+, [p_a−p_b]_+ + (t_b({b,c})−t_c({b,c})) },\nwith p_x = t_x({a,b,c}). Symmetrically for ε_b^*. Estimating the five needed tallies to accuracy Θ(ε) with m = Θ((log(1/δ))/ε^2) samples suffices to decide whether ε^*(c) ≤ ε with probability ≥ 1−δ.\n\n- Lower bound: Any algorithm requires m = Ω((1/ε^2) log(1/δ)) samples even for K = 2 (majority).\n"
  }
}