{
  "progress_md": "Ideas\n- Parametrized certificate (decoupling accuracy and robustness). Introduce two knobs: a concentration radius γ for the uniform deviation event and a target robustness α (the amount of added ballots). If along the empirical path σ we have all margins d_{r,y}(S) ≥ α + γ, then on the uniform event |d_{r,y}(S) − d_{r,y}(P)| ≤ γ we get d_{r,y}(P) ≥ α. Mixing with Q (the single ranking R = (w, e_{K−1}, …, e_1)) at level α yields, for all r,y≠w, d_{r,y}(P′) = d_{r,y}(P)/(1+α) ≥ α/(1+α) > 0 and for y = w, d_{r,w}(P′) ≥ (α+α)/(1+α) > 0. Hence σ is feasible in P′ and w is an α-winner. This strictly generalizes the 2ε→ε threshold in the current output.\n- Clean separation of roles: choose γ via uniform Hoeffding over U = K(K−1)2^{K−2} functionals; choose α ≤ ε as the robustness budget we certify. Then a one-line certify-or-abstain condition: min_{r,y} d_{r,y}(S) ≥ α+γ.\n- Counting identity proof sketch. U = Σ_{A} |A|(|A|−1) over nonempty A with |A|≥2. Let S ∼ Bin(K, 1/2) be the size of a uniformly random subset; E[S(S−1)] = K(K−1)E[Z_1Z_2] with Z_i ∼ Ber(1/2) iid, hence K(K−1)2^{K}·(1/4)/2^{K} = K(K−1)/4. Multiplying by the number of subsets 2^K and dividing by 4 yields U = K(K−1)2^{K−2}. Alternatively, double-count ordered pairs (y,x) and subsets containing them.\n\nExamples\n- K=3 lower-bound instance (Le Cam two-point). Candidates a,b,c. Fix a robust first-round elimination of c by setting first-place shares a: (1−s)/2, b: (1−s)/2, c: s with s ∈ (0, 1/3). Choose distributions supported on the six rankings with all masses identical except on types with c on top:\n  • P+: r_1 = P[c ≻ a ≻ b] = s/2 + ε, r_2 = P[c ≻ b ≻ a] = s/2 − ε.\n  • P−: r_1 = s/2 − ε, r_2 = s/2 + ε.\n  Keep p_1+p_2 = q_1+q_2 = (1−s)/2 and split these arbitrarily (identically under P+ and P−) so first-round shares match exactly. Then c is eliminated first under both. Final decision equals the a vs b pairwise majority: margin m_ab(P±) = r_1 − r_2 = ±2ε. Thus under P+, a is the IRV winner; under P−, b is the IRV winner; moreover, under P−, a is not an ε-winner (since mixing with α=ε yields margin (−2ε+ε)/(1+ε) < 0). The total variation between P+ and P− equals 2ε; the KL satisfies KL(P+||P−) = (s/2+ε)log((s/2+ε)/(s/2−ε)) + (s/2−ε)log((s/2−ε)/(s/2+ε)) ≤ c_s ε^2 with c_s = 8/s for ε ≤ s/4 (from Taylor’s theorem and convexity). Hence, by Le Cam, any algorithm that outputs an ε-winner with error ≤ δ must use m ≥ (1/c_s)·Ω(log(1/δ))/ε^2 = Ω((log(1/δ))/ε^2).\n- Toy certificate check (K=4). Suppose the empirical path is e_1=4, e_2=3, e_3=2 with winner w=1, and the per-round empirical margins are 0.08, 0.06, 0.05. With γ = 0.02 (from m via Lemma 1) and α = 0.03 ≤ ε, we have min margin 0.05 ≥ α+γ, so certification triggers; after mixing, all non-w margins shrink to ≥ α/(1+α) ≈ 0.029 > 0.\n\nObstacles and gaps\n- Current output’s Theorem 1 fixes α = ε and requires d_{r,y}(S) ≥ 2ε. This is correct under the additive model, but the dependence on ε is somewhat rigid. The parametrized version above allows any α ≤ ε and any γ achieved by m.\n- Success probability of the “always output empirical winner” algorithm cannot be bounded uniformly over all P without a gap assumption on P (e.g., Γ := min_{r,y} d_{r,y}(P) ≥ margin). The certificate yields a standard gap-dependent guarantee: if Γ ≥ α + 2γ, then with probability ≥ 1−δ (the uniform event) the algorithm’s sample path has min margin ≥ α + γ and we certify an α-winner. This gap-dependence should be stated explicitly.\n- Constants in Lemma 1. The output uses a generic C. A precise instantiation: with m ≥ (2/γ^2)(log(2U) + log(1/δ)), we get uniform deviation ≤ γ by Hoeffding plus union bound (accounting for signs). This can be threaded through the parametrized certificate to produce an explicit m.\n\nFormal lemmas (ready to add to output)\n- Lemma (Parametrized certificate). Fix α ∈ (0,1/2) and γ ∈ (0,1/2). On the event sup_{A,y≠x} |(score_y(S;A)−score_x(S;A))−(score_y(P;A)−score_x(P;A))| ≤ γ, if along the empirical IRV path σ we have min_{r,y} d_{r,y}(S) ≥ α + γ, then the empirical winner w is an α-winner for P.\n- Theorem (Gap-dependent guarantee). Suppose Γ := min_{r,y} d_{r,y}(P) ≥ α + 2γ. If m ≥ (2/γ^2)(log(2U) + log(1/δ)), then with probability ≥ 1−δ the empirical winner w is an α-winner for P.\n- Lemma (K=3 Le Cam lower bound). For any δ ∈ (0,1/3) and ε ≤ s/4 with s ∈ (0,1/3), there exist P+, P− as above such that any algorithm using m samples that, with probability ≥ 1−δ, outputs an ε-winner must satisfy m ≥ c (log(1/δ))/ε^2, where c = s/32 (by the bound KL(P+||P−) ≤ 8ε^2/s and Bretagnolle–Huber inequality). In particular, for a fixed constant s (e.g., s = 1/4), we get m = Ω((log(1/δ))/ε^2).\n\nNext steps\n- Insert the parametrized certificate and gap-dependent theorem into output.md with full proofs (including the algebra with normalization (P+αQ)/(1+α)).\n- Finalize the K=3 lower bound with explicit constants (verify KL bound rigorously: use second derivative at 0 equals 4/(s/2) and convexity to upper bound for |ε| ≤ s/4).\n- K-dependence lower bound sketch to formalize: construct a packing of M ≈ exp(Θ(K)) instances by choosing one round/competitor y* at which the true margin is ±2ε, while all other constraints have slack Ω(1). Apply Fano to obtain m ≥ Ω((log M)/ε^2) = Ω(K/ε^2) under a prior. As a stepping stone, prove at least an Ω((log K)/ε^2) bound by packing over O(K) choices of the critical constraint.\n- Tighten constants in the uniform bound via Bernstein/Chernoff (the top-among-A indicators have variance ≤ p(1−p)); document whether this yields meaningful gains in m for moderate K.\n\nNotes on gaps in current output.md\n- Add the parametrized version to avoid hard-coding 2ε and to clearly separate γ (from m,δ,K) and the target α ≤ ε.\n- State and prove the gap-dependent guarantee explicitly; currently it is implicit.\n- For Corollary 2 (K=3), list the exact finite set of functionals needed and compute U_K=3 = 12 to justify the m = O((log(1/δ))/ε^2) claim with an explicit constant."
}