{
  "content": "# Corrections, certificates, examples, and provable bounds\n\n## 1) Correct sufficient certificate (uniform over sets)\nLemma 1 (Uniform max-deficit certificate). Fix c. Define\nB(c) := max_{S⊇{c}} [ min_{a∈S\\{c}} p_a(S) − p_c(S) ].\nIf B(c) ≤ ε (with tie-breaking not eliminating c on ties after adding an infinitesimal slack), then c is an ε-winner. In particular, adding ε fraction of c-first ballots suffices.\n\nProof. Adding ε of c-first ballots increases p_c(S) by ε for every S containing c and leaves p_a(S) for a≠c unchanged (we compare absolute tallies, not normalized shares). Hence for every S⊇{c}: p′_c(S) = p_c(S)+ε ≥ min_{a≠c} p_a(S) = min_{a≠c} p′_a(S). So c is never strictly below the minimum at any round encountered by IRV under the augmented profile, and therefore cannot be eliminated. ∎\n\nRemark. This certificate is sufficient, not necessary: IRV’s elimination path under augmentation might visit a strict subset of the S, allowing smaller ε to suffice.\n\nWhy useful here: It yields a verifiable condition turning the ε-winner question into finitely many inequalities over S⊇{c}.\n\n\n## 2) Counterexample: single-chain certificates fail for K≥4\nWe exhibit a profile on C={a,b,c,d} where the “single-chain” check (comparing only versus designated b_t along one chain) incorrectly certifies c, yet c does not win even after adding ε mass of c-first ballots.\n\nBallot types and weights:\n- T1: c>a>d>b with weight x=0.34.\n- T2: a>d>c>b with weight y=0.29.\n- T3: d>c>a>b with weight z=0.34.\n- T4: b>a>d>c with weight δ=0.03.\nTotal 1.\n\nComputed tallies:\n- Full set C: p_c(C)=x=0.34, p_a(C)=y=0.29, p_d(C)=z=0.34, p_b(C)=δ=0.03. First-round minimum is b.\n- On S={a,c,d}: T1→c, T2→a, T3→d, T4→a, so p_c=0.34, p_a=0.32, p_d=0.34. Minimum among others is a.\n- Pair {c,a}: c beats a, with p_c=x+z=0.68, p_a=y+δ=0.32.\n- Pair {c,d}: c loses to d, with p_c=x=0.34, p_d=y+z+δ=0.66.\n\nIRV elimination: remove b first (0.03), then on {a,c,d} remove a (0.32), leaving final pair {c,d}, where c loses. Thus c is not the winner.\n\nYet the “chain” that checks S=C (vs b), then S={a,c,d} (vs a), then pair {c,a} would (incorrectly) conclude that c can be made an ε-winner with ε≈0.03: indeed at C we have p_c−p_b=0.31, at {a,c,d} we have p_c−p_a=0.02, and at {c,a} c wins handily. After adding ε=0.03 fraction of c-first ballots, c still loses versus d in the final pair, so the chain certificate is false.\n\nTakeaway: Any certificate restricted to one elimination chain (and only comparing to chosen b_t rather than the round’s true minimum) is unsound for K≥4.\n\n\n## 3) Two-phase certification algorithm with sample complexity\nAlgorithm (holdout certificate for the sample winner):\n- Phase 1: Draw m1 ballots, run IRV to get ĉ (no guarantee needed in this phase).\n- Phase 2: Draw m2 fresh ballots. For all S⊇{ĉ} and a∈S\\{ĉ}, estimate p̃_a(S), p̃_{ĉ}(S). Compute B̃(ĉ)=max_{S⊇{ĉ}}(min_{a∈S\\{ĉ}} p̃_a(S)−p̃_{ĉ}(S)). If B̃(ĉ) ≤ ε/2, output ĉ.\n\nProposition 2. If m2 ≥ (2/ε^2)·ln(2K·2^{K−1}/δ), then with probability ≥1−δ, whenever Phase 2 outputs ĉ, that ĉ is an ε-winner.\n\nProof. Condition on Phase 1. For each fixed (S,a), the indicator g_{S,a}(ballot)=1[top_S(ballot)=a] has mean p_a(S). The total number of such functions with ĉ fixed is at most K·2^{K−1} (each S⊇{ĉ}, each a∈S). Hoeffding plus union bound yields a uniform deviation |p̃_a(S)−p_a(S)| ≤ ε/4 simultaneously for all those (S,a) with probability ≥1−δ if m2≥(2/ε^2)ln(2K·2^{K−1}/δ). Then B(ĉ) ≤ B̃(ĉ)+ε/2 ≤ ε, so Lemma 1 applies. ∎\n\nComments:\n- This cleanly bypasses adaptivity: we fix ĉ and the family {g_{S,a}} before Phase 2.\n- Sample complexity m2 scales as O((K+log(1/δ))/ε^2). Computationally, Phase 2 is exponential in K due to enumerating S.\n\n\n## 4) K=3: a provable guarantee under a mild separation condition\nLet C={c,a,b}. Write x*=argmax_{x∈{a,b}} p_x(C).\n\nProposition 3 (K=3 with separation). Suppose |p_a(C)−p_b(C)| ≥ γ. Draw m i.i.d. ballots and run IRV on them to get ĉ. If m ≥ (8/ε^2)·ln(18/δ) and γ ≥ ε/2 (so that α:=√(ln(18/δ)/(2m)) ≤ ε/4 ≤ γ/2), then with probability ≥1−δ the output ĉ is an ε-winner of the true election.\n\nProof. Uniformly over the 9 quantities {p_x(S)} with S∈{C,{c,a},{c,b}} and x∈S, Hoeffding+union bound gives |p̂_x(S)−p_x(S)| ≤ α. Let x̂ be the more popular of {a,b} in the sample on S=C. By α ≤ γ/2, we have x̂=x*. On the sample profile, since ĉ is the IRV winner, ĉ is not the minimum at C, and ĉ beats x̂ in the final pair. Hence p̂_{ĉ}(C) ≥ min_{y∈{a,b}} p̂_y(C), and p̂_{ĉ}({ĉ,x̂}) ≥ p̂_{x̂}({ĉ,x̂}). Transferring to truth: p_{ĉ}(C) ≥ min_{y} p_y(C) − 2α and p_{ĉ}({ĉ,x*}) ≥ p_{x*}({ĉ,x*}) − 2α. Adding ε≥2α mass of ĉ-first ballots makes ĉ safe at C and win against x*; since x* is the true final opponent, ĉ wins IRV. ∎\n\nRemarks.\n- Without the separation |p_a(C)−p_b(C)| ≥ γ, the sample may misidentify the true final opponent, and bounding the (true) pair versus the actual final opponent from the sample winner alone is generally impossible.\n- This strengthens and corrects the K=3 discussion: the guarantee hinges on identifying the true final opponent at C.\n\n\n## 5) Lower bounds: refined statements to formalize\n- Two-candidate baseline. For K=2, deciding whether the output is an ε-winner reduces to distinguishing Bernoulli means within ε/2; any algorithm needs m=Ω((1/ε^2)·log(1/δ)).\n- Log-K Fano lower bound. Construct K instances over ballots where for each i the unique ε/4-winner is i, with pairwise KL divergence Θ(ε^2). Then any algorithm that finds an ε/2-winner with error ≤δ needs m=Ω((log K)/ε^2). We will provide an explicit IRV-compatible family and verify uniqueness of ε/4-winner in each.\n\nWhy useful: Matches the O((K+log(1/δ))/ε^2) upper order up to a linear vs logarithmic dependence on K, suggesting near-optimality unless Ω(K/ε^2) can be shown.\n\n\n## 6) Obstacles and failed approaches\n- One-phase “natural algorithm” (run IRV on the sample and directly output ĉ) for K≥4 remains challenging: the property “ĉ is winner on the sample” does not imply the uniform certificate B̂(ĉ)≤0; there can exist S not on the sample path where ĉ is below the minimum among others, and these S may become relevant under the true augmented process.\n- Attempted simplification “pairs suffice” is false in general: B(c) can be attained at a non-pair S because top-of-S constraints link more than two candidates (we have explicit constructions where triple deficits exceed any pair deficit). Hence checking only head-to-heads is insufficient.\n\n\n## 7) Next steps\n- Prove and record a compact “uniform certificate ⇒ ε-winning” theorem with explicit tie handling (reserve ε/100 slack) suitable for proofs.md.\n- Optimize the holdout bound constants; tighten M in the union bound to ≤(K−1)2^{K−2} by noting that for each S we only need the minimum among others rather than all a.\n- Explore whether B(c) is always achieved on an “IRV-reachable” set S along some elimination order; if true, it could reduce the 2^{K−1} blowup to polynomially many S. Either prove or give a counterexample.\n- Formalize the Fano lower bound with a concrete K-ary construction tailored to IRV.\n- For K=3, investigate whether the separation assumption can be relaxed by a small extra ε budget that simultaneously covers both possible final opponents.\n\n\n## 8) Small verification example (K=3)\nLet C={c,a,b}. Suppose p_a(C)=0.37, p_b(C)=0.31, p_c(C)=0.32 (so x*=a). Head-to-heads: p_c({c,a})=0.51, p_c({c,b})=0.60. Then B(c)=max{ (0.31−0.32), (0.49−0.51), (0.40−0.60) }^+=0.01, attained at S=C. Adding ε=0.01 of c-first ballots makes c an IRV winner (remains above both at C, then beats a head-to-head). This illustrates the certificate and that the worst S need not be a pair."
}