{
  "summary_md": "This round corrected a flawed ‘‘single-chain’’ certificate and developed sound certificates and sample bounds for estimating IRV ε-winners from samples. Main advances: an explicit K=4 counterexample showing chain-only checks can fail; a correct uniform max-deficit certificate B(c)=max_{S⊇{c}}(min_{a∈S\\{c}} p_a(S)−p_c(S)) (B(c)<ε ⇒ c is an ε-winner, equality needs tie-handling); a two-phase holdout certification with m2 ≥ (2/ε^2)·ln(2M/δ) (M=(K−1)·2^{K−2}+2^{K−1}); and a K=3 positive result under a separation assumption (m ≥ (8/ε^2)·ln(18/δ), γ ≥ ε/2). Lower bound K=2: m = Ω((1/ε^2)·ln(1/δ)); a Fano-type Ω((log K)/ε^2) lower bound is outlined but not yet formalized. Citations: Research Notes; Current Proofs.",
  "highlights": [
    "Single-chain certificate is unsound for K≥4 — explicit K=4 counterexample (T1:0.34, T2:0.29, T3:0.34, T4:0.03) where chain checks pass but c loses.",
    "Uniform max-deficit certificate B(c)=max_{S⊇{c}}(min_{a≠c} p_a(S)−p_c(S)) is a correct sufficient condition: B(c)<ε ⇒ c is ε-winner (equality needs tie rules).",
    "Two-phase holdout algorithm: pick sample winner ĉ then estimate p_a(S) on a fresh holdout; with m2 ≥ (2/ε^2)·ln(2M/δ) one can certify ĉ if B̃(ĉ) ≤ ε/2−ξ.",
    "K=3 result (with separation): if |p_a(C)−p_b(C)|≥γ≥ε/2 and m ≥ (8/ε^2)·ln(18/δ), the sample IRV winner is an ε-winner w.h.p.",
    "Controlling all top-of-set frequencies requires union bounding over ~K·2^{K−1} indicators — computationally exponential but only adds a Θ(K) term to the log factor in sample size.",
    "Lower bounds: K=2 is order-optimal Ω((1/ε^2)·ln(1/δ)); Fano suggests Ω((log K)/ε^2) for general K, pending explicit IRV construction."
  ],
  "next_questions": [
    "Formalize the Fano-style lower bound m = Ω((log K)/ε^2) with an explicit family of IRV distributions.",
    "Characterize the minimal family of subsets S needed for certification (are worst-case S exactly the IRV-reachable sets?) to reduce computational cost.",
    "Tighten/analyze one-phase sample-run-IRV bounds for general K (remove separation assumption or prove impossibility)."
  ]
}