{
  "summary_md": "This round tightens the LP ↔ algorithmic interface: we added two structural lemmas (monotonicity in r and an extreme-point characterization), clarified when interior-placement equalities are physically justified (product-state or automorphism-invariant initial states, or a public random rotation), and produced an auditable plan to run r = 2 LP instances with symmetry reductions. The computational plan uses S3+reflection quotienting, staged constraint families (single-core, two-core, t=3), high-precision solvers, and extraction of dual certificates for k ∈ {10..16}, stopping when q < 0.99 (or any q < 1). A transfer-matrix / Markov-chain relaxation is proposed as an independent cross-check. Two textual clarifications are requested in output.md (after Definition 6 and in Corollary 8) to make the symmetry hypothesis explicit. Watchouts: over-reduction of symmetry and illegal interior-placement constraints; include dirac-mass infeasibility as a sanity test. Citations: prover-01.out.json (progress_md), output.md.",
  "highlights": [
    "Lemma A (monotonicity in r): q(r+1,k) ≥ q(r,k). Use to prioritize smallest r (r=2) and compare r=3 as a check.",
    "Lemma B (extreme-point structure): feasible region is a polytope in R^{3^k}; optima occur at extreme points → sparse supports and human-auditable dual certificates are possible.",
    "Interior-placement equality constraints require either product initial states (identical local marginals) or automorphism-invariant global states; alternatively, a public random rotation can restore invariance—add explicit caveats in output.md.",
    "Concrete, auditable r=2 plan: symmetry reduction (S3 + reflection), staged constraint families (single-core → two-core → t=3), high-precision LP solver, and dual-certificate extraction for k=10..16 (stop on q<0.99).",
    "Backup analytic relaxation: transfer-matrix / stationary Markov-chain (order d) provides independent upper bounds to cross-check LP outputs and detect modeling errors.",
    "Sanity checks & pitfalls: stride k+2r consistency, dirac-mass infeasibility test, avoid over-reduction of symmetry, and validate that placement constraints only reference buffers fully inside [1..k]."
  ],
  "next_questions": [
    "Implement the r=2 LP sweep with symmetry reduction and staged constraints for k=10..16; for any instance with q<1, archive primal/dual certificates and the lifted full-space inequality.",
    "Clarify the model: is a public random rotation (shared randomness) allowed to enforce automorphism-invariance in the entanglement regime? If yes, state this in output.md; if not, keep the automorphism-invariance hypothesis explicit.",
    "Build and run the transfer-matrix / Markov-chain relaxation for the same (r,k) to cross-check LP solver outputs and help identify which local patterns drive the bound."
  ]
}