{
  "feedback_md": "High-level assessment: This was a productive round with several useful structural observations (monotonicity in r; extreme-point structure; a concrete computational plan). However, there is a critical modeling issue: the interior-placement equality constraints in Definition 6 and Lemma 5 are currently stated too strongly. They equate core marginals across all placements of a frame family, even when the relative geometry (inter-core distances) differs. That is not implied by light-cone localization plus uniformity, even under automorphism-invariant initial states. Only placements that are related by a graph automorphism (in practice, rotations; reflections only if the algorithm/ports are reflection-invariant) are guaranteed to have equal probabilities. This affects the soundness of Corollary 4 as currently written (it was later corrected in Corollary 8, but the inconsistency remains) and, more importantly, whether the LP’s feasible set contains the actual window marginals of a given algorithm.\n\nConcrete counterexample to the over-strong constraint: Let r = 0, consider a cycle with even n and initial state ρ0 that is the 1/2-mixture of the two perfect matchings of EPR pairs ((1,2),(3,4),…) and ((2,3),(4,5),…); this ρ0 is rotation-invariant. Two cores of length 1 at distance 1 have nontrivial Z-correlations (EPR half the time), whereas two cores at distance 2 are uncorrelated. Thus, equating their joint marginals (as the current Definition 6 does for t = 2 without conditioning on geometry) is unjustified. Equality holds only within a fixed geometry class (same inter-core distances, up to rotation; reflection only if admissible).\n\nAction items we executed: We repaired the formal interface by (i) revising Lemma 5 to only assert equality for placements within the same geometry class (i.e., related by cycle automorphisms), and (ii) revising Definition 6 so the LP enforces interior-placement invariance only within each fixed geometry class. We also removed the unsound Corollary 4 and kept the corrected constant-error bound under automorphism invariance (now numbered as Corollary 10), with an explicit remark pointing to the necessity of symmetry (cf. the EPR-based counterexample).\n\nValidation of new lemmas: Your Lemma A (monotonicity in r) is correct; we added it with a short proof: as r grows, fewer placements are admissible, hence fewer equalities, so the feasible set expands and the optimum is nondecreasing. Lemma B (extreme-point optimality) is standard LP theory; we added it (notationally Lemma 9) after confirming the feasible polytope is nonempty (uniform distribution is feasible) and bounded.\n\nOn the transfer-matrix/Markov relaxation: Important correction—restricting to stationary Markov chains defines a subset of the LP-feasible distributions, so maximizing over that subset yields a lower bound on q(r,k), not an upper bound. It is useful as an engineering cross-check (if it already gives < 1, the true q is also < 1 only if we separately certify the LP bound), but it cannot by itself certify an LP-based upper bound on success probability. For certificates that upper-bound q, you must solve a superset or the exact LP and extract a dual.\n\nNext steps, concretely:\n- Implement the geometry-aware LP: index multi-core constraints by core lengths and inter-core distances δ (with δj ≥ 2r). Enforce equality across translations (and optionally reflection if you want to assume that symmetry) within each geometry class whose r-buffers fit in [1..k].\n- Maintain separate runs with and without reflection constraints to avoid accidental oversymmetrization.\n- Sweep r = 2, k ≈ 10–16 as proposed; extract dual certificates whenever q < 1. Verify monotonicities q(r,k+1) ≤ q(r,k) and q(r+1,k) ≥ q(r,k) on the exact (or provably sound) LP.\n- Keep the Dirac-mass infeasibility check under the single-core (geometry-aware) constraints.\n- Use the Markov-chain relaxation only as a sanity cross-check; do not interpret it as a certifying upper bound.\n\nIf you can produce any (r,k,q<1) instance under the sound constraints, we can immediately invoke: (i) exponential decay in n in the product-state regime (stride k+2r), and (ii) an n-independent constant bound under automorphism-invariant entangled initial states.",
  "new_notes_md": "Important correction: geometry-aware interior placement invariance\n- The equalities we enforce must respect automorphism classes of placements. Two placements of t cores are guaranteed to have equal core marginals only if they are related by a cycle automorphism (rotation; reflection only if the model is reflection-invariant). Equating placements with different inter-core distances is not justified by light-cone localization plus uniformity.\n- Minimal counterexample (r = 0, entangled, rotation-invariant): let ρ0 be the 1/2-mixture of the two perfect matchings of EPR pairs around the cycle. Adjacent vertices have Z-correlations (EPR half the time); vertices at distance 2 are uncorrelated. Thus, two singleton cores at distance 1 vs distance 2 have different joint marginals, defeating geometry-agnostic equality constraints.\n- Fix: Parameterize multi-core constraints by geometry (core lengths s = (s1,…,st) and inter-core gaps δ = (δ1,…,δt−1), where δj is the number of vertices between cores j and j+1). Require equality only across translations inside [1..k] (and optionally reflections) for the same (s, δ), with the additional admissibility condition δj ≥ 2r ensuring disjoint r-buffers.\n\nMonotonicity in r (new)\n- Let q(r,k) be the (revised, geometry-aware) LP optimum. Then q(r+1,k) ≥ q(r,k). Reason: when r increases, fewer placements are admissible, so fewer equalities are enforced; the feasible region enlarges and the optimum cannot decrease.\n\nExtreme-point structure (new)\n- The feasible set is a nonempty polytope in R^{3^k} (uniform distribution is feasible), defined by linear equalities (geometry-aware invariance), nonnegativity, and normalization. Hence an optimal distribution exists and can be taken at an extreme point (basic feasible solution). This supports sparse-support searches and dual-certificate extraction.\n\nAmplification reminders (unchanged)\n- No entanglement: independence requires gaps of size 2r, so the exponential stride is k+2r. The r = 1 path 0–1–2 counterexample shows smaller gaps are insufficient.\n- With entanglement: constant-error bounds require automorphism-invariant initial states (or an admissible public random rotation to enforce it). Without that symmetry, interior-placement equalities need not hold.\n\nComputation plan (r = 2), updated to geometry-aware constraints\n- Variables: p_ψ, ψ ∈ Σ^k. Quotient by S3 color permutations; do not assume reflection unless explicitly imposed.\n- Constraints (progressive):\n  • Single-core: s ∈ {1,2,3}, equality across all interior translations.\n  • Two-core: (s1,s2) ∈ {(1,1),(2,1),(2,2)}, at several admissible separations δ ≥ 2r; enforce equality across translations for each fixed δ.\n  • If needed, add t = 3 families similarly.\n- Certification: For any q < 1, extract a dual and archive (r,k), the (s,δ) list, the dual vector, and the inequality certifying ∑_ψ p_ψ·1{proper} ≤ q.\n\nTransfer-matrix/Markov cross-check\n- Restricting to stationary Markov chains (order d) is a subset of the LP-feasible set; maximizing properness yields a lower bound on q(r,k), useful for catching modeling/solver errors but not a certifying upper bound.\n\nPitfalls and checks\n- Do not equate placements with different δ. Keep separate runs with and without reflection constraints. Validate symmetry reductions on small k against the full (unreduced) LP.\n- Ensure all placements counted in constraints have r-buffers fully inside [1..k].",
  "new_notes_append": "True",
  "new_outputs_md": "Main theorems proved in this file\n- Light-cone localization and r-non-signaling for r-round LOCAL algorithms (with or without initial entanglement).\n- Independence beyond 2r for two-way r-round LOCAL algorithms with product initial states (no shared entanglement).\n- Exponential amplification without entanglement given a segment-level bound q(r,k) < 1.\n- Automorphism-covariant interior placement invariance within fixed geometry classes.\n- Segment LP with geometry-aware interior invariance; structural lemmas: monotonicity in k, monotonicity in r, extreme-point optimality.\n- Constant-error bound with entanglement under automorphism invariance.\n\nPreliminaries\nLet G = (V, E) be a graph (cycles are of primary interest). An r-round quantum LOCAL algorithm consists of r synchronous layers of local channels acting on vertex/edge registers, followed by local measurements at the vertices that output colors in {1,2,3}. Each round is modeled as a product of CPTP maps localized on vertices/edges (purifiable to local unitaries by Stinespring dilation). For S ⊆ V, let N_r(S) = {v ∈ V : dist(v, S) ≤ r} denote the r-neighborhood of S.\n\nTheorem 1 (Light-cone localization and r-non-signaling)\nFix an r-round quantum LOCAL algorithm. Let S ⊆ V, and let M_S be any POVM element that depends only on the final local measurements in S. Then there exists a positive operator X_S supported only on the registers associated with N_r(S) (and ancillas therein) such that, for every initial global state ρ (possibly entangled), the probability of M_S is Tr[ρ X_S]. Consequently, if two initial states ρ and ρ′ agree on N_r(S), then the output marginal on S is the same under ρ and ρ′.\n\nProof sketch (standard): Purify to a depth-r circuit of local unitaries. In the Heisenberg picture, conjugating M_S backward through each round enlarges its support by at most one graph hop. After r rounds, the evolved effect X_S is supported on N_r(S). For any ρ, P[M_S] = Tr[ρ X_S]. If ρ and ρ′ coincide on N_r(S), then Tr[ρ X_S] = Tr[ρ′ X_S].\n\nTheorem 2 (Independence beyond 2r without initial entanglement)\nAssume the initial state is a product across vertices, ρ = ⊗_{v∈V} ρ_v. Let S_1, …, S_m ⊆ V have pairwise disjoint r-neighborhoods (equivalently, dist(S_i, S_j) > 2r for i ≠ j). For each i, let M_{S_i} be any event depending only on measurements in S_i, and let X_{S_i} be its Heisenberg-evolved effect from Theorem 1. Then the random outcomes on S_1, …, S_m are mutually independent; in particular,\nTr[ρ X_{S_1} ⋯ X_{S_m}] = ∏_{i=1}^m Tr[ρ_{N_r(S_i)} X_{S_i}].\n\nProof: Each X_{S_i} acts only on N_r(S_i); these supports are disjoint, and ρ factors across them. The trace of the product factors, which is precisely independence.\n\nCorollary 3 (Exponential amplification without entanglement)\nLet r ≥ 1. Fix k ≥ 1 and suppose there exists q < 1 such that, for every distribution on a length-k path segment that satisfies the LP constraints in Definition 6 (below), the probability the segment is internally proper is at most q. Then, for any r-round two-way quantum LOCAL algorithm on the n-cycle with product initial state, the success probability satisfies\nP_success(C_n) ≤ q^{⌊n / (k + 2r)⌋}.\n\nProof: Partition the cycle into m = ⌊n / (k + 2r)⌋ disjoint windows of length k separated by gaps of size 2r. If the cycle is proper, each window is internally proper. Let E_i be “window i is internally proper,” and X_i its Heisenberg-evolved effect. Supports N_r(W_i) are disjoint, so E_i are independent by Theorem 2. By the segment-level bound, P[E_i] ≤ q. Hence P_success(C_n) ≤ ∏_i P[E_i] ≤ q^m.\n\nRemark 4 (Necessity of the 2r separation)\nFor r = 1 on a path 0–1–2, one round suffices for node 1 to correlate nodes 0 and 2 (e.g., by broadcasting a private random bit), so outputs at distance 2 need not be independent. Thus 2r is tight in general.\n\nLemma 5 (Automorphism-covariant interior placement invariance for fixed geometries)\nFix an r-round uniform quantum LOCAL algorithm on a cycle C_n, with initial global state ρ_0. Let W ⊆ C_n be any contiguous window of length k. Consider t cores with lengths s = (s_1,…,s_t), and let δ = (δ_1,…,δ_{t−1}) be nonnegative integers encoding the inter-core gaps (δ_j is the number of vertices strictly between core j and core j+1). Let ω and ω′ be two r-gapped placements of (s, δ) inside W (i.e., all r-buffers lie in W and δ_j ≥ 2r). Assume ρ_0 is invariant under the rotations of C_n (reflections as well if the model is reflection-invariant). Then, for every core assignment ζ, the probability that the outputs on the cores equal ζ is the same for ω and ω′.\n\nProof: Let U_ω ⊆ W and U_{ω′} ⊆ W be the unions of the r-neighborhoods of the cores. Because ω and ω′ have the same geometry (s, δ), there exists a rotation (and possibly a reflection) π of C_n mapping U_ω to U_{ω′} and carrying each core in ω to the corresponding core in ω′. By Theorem 1, there exist positive operators X_ω and X_{ω′} supported on U_ω and U_{ω′} giving the core-event probabilities as Tr[ρ_0 X_ω] and Tr[ρ_0 X_{ω′}]. Uniformity implies covariance under π: X_{ω′} = U_π X_ω U_π^†. Since ρ_0 is invariant under π, Tr[ρ_0 X_{ω′}] = Tr[ρ_0 X_ω].\n\nDefinition 6 (Segment LP with geometry-aware interior invariance)\nFix Σ = {1,2,3}, r ≥ 1, k ≥ 1. A geometry is a pair (s, δ) with s = (s_1,…,s_t) positive integers and δ = (δ_1,…,δ_{t−1}) nonnegative integers. An r-gapped placement ω of (s, δ) inside [1..k] is a t-tuple of start positions (ω_1 < ⋯ < ω_t) such that each core C_j = [ω_j .. ω_j + s_j − 1] has its r-buffer C_j^{(+r)} = [ω_j − r .. ω_j + s_j − 1 + r] contained in [1..k], these r-buffers are pairwise disjoint, and ω_{j+1} = ω_j + s_j + δ_j. The variables are p_ψ for ψ ∈ Σ^k, with p_ψ ≥ 0 and ∑_ψ p_ψ = 1. The objective is to maximize ∑_ψ p_ψ · 1{ψ has no equal-color adjacencies on edges (i,i+1), i = 1..k−1}. The constraints enforce interior placement invariance within fixed geometries: for every geometry (s, δ), every core assignment ζ, and every two r-gapped placements ω, ω′ of (s, δ) inside [1..k], the marginal ∑_{ψ: ∀j ψ|_{C_j(ω)} = ζ_j} p_ψ equals ∑_{ψ: ∀j ψ|_{C_j(ω′)} = ζ_j} p_ψ. Denote the optimum by q(r,k).\n\nRemark 6.1 (Soundness regimes and symmetry)\nThese equality constraints are necessary for r-round uniform algorithms under either of the following assumptions: (i) product initial states with identical local marginals (⊗_v ρ; rotation-invariant), or (ii) arbitrary shared entanglement provided the initial global state is invariant under the rotations of the cycle (reflections as well if the model is reflection-invariant). Without such symmetry in the initial state, the constraints need not hold across placements, even within the same window.\n\nLemma 7 (Monotonicity in k)\nFor all r ≥ 1 and k ≥ 1, q(r,k+1) ≤ q(r,k).\n\nProof: Let p be feasible for (r,k+1). Its marginal p′ on the first k coordinates satisfies all geometry-aware invariance constraints for (r,k): any placement inside [1..k] remains a placement inside [1..k+1], and equalities are preserved under marginalization. Moreover 1{proper on k+1} ≤ 1{proper on first k} pointwise, hence ∑_ψ p_ψ·1{proper on k+1} ≤ ∑_{ψ′} p′_{ψ′}·1{proper on k}. Taking suprema over feasible p proves the claim.\n\nLemma 8 (Monotonicity in r)\nFor all r ≥ 1 and k ≥ 1, q(r+1,k) ≥ q(r,k).\n\nProof: As r increases to r+1, the set of admissible placements (and hence the set of equality constraints) for any geometry (s, δ) weakens: some placements cease to be admissible because r-buffers no longer fit or become non-disjoint. Therefore the feasible set enlarges, and the supremum cannot decrease.\n\nLemma 9 (Extreme-point optimality)\nFor each fixed (r,k), the feasible region of Definition 6 is a nonempty polytope in R^{3^k} defined by linear equalities, nonnegativity, and normalization. Hence an optimal solution exists and can be taken at an extreme point (basic feasible solution).\n\nProof: Nonemptiness follows from the uniform distribution p_ψ = 3^{-k}, which satisfies all equality constraints. Boundedness follows from nonnegativity and normalization. Linear programming theory guarantees that a maximum exists and is achieved at an extreme point of the polytope.\n\nCorollary 10 (Constant-error bound with entanglement under automorphism invariance)\nLet r ≥ 1 and k ≥ 1, and let q(r,k) be as in Definition 6. Consider any r-round uniform quantum LOCAL algorithm on C_n whose initial global state is invariant under the rotations of the cycle. Then, for all n ≥ k, the success probability obeys P_success(C_n) ≤ q(r,k).\n\nProof: Fix any contiguous window W ⊆ C_n of length k. If the cycle is properly colored, then W is internally proper. By Lemma 5, the distribution on W (restricted to events supported on geometry-aware r-buffered placements) satisfies the invariance constraints of Definition 6. Therefore it is feasible for the LP, and the probability that W is internally proper is at most q(r,k). Since {cycle proper} ⊆ {W proper}, P_success(C_n) ≤ q(r,k). (Necessity of the symmetry assumption is illustrated by the EPR counterexample in the notes.)",
  "new_outputs_append": "False",
  "verdict": "uncertain"
}