{
  "content": "# Ideas\n\n- Fix the flaw in the previous O(1)-test by incorporating residue/period constraints of the per-type period transition A_τ := M_τ·E. The naive test via L_τ = ⋃_{e≤β} diag(A_τ^e) fails (parity counterexample) because it only guarantees some lengths, not all; O(1) requires feasibility for arbitrary block lengths k (≥ a constant). Use the graph-theoretic period (gcd of cycle lengths) of SCCs of A_τ.\n- Provide an EXPTIME-decidable necessary-and-sufficient per-type criterion: an aperiodic SCC (period 1) yields eventual loops of all large lengths at its vertices. Combined with a constant-size bridging matrix condition across short types, this yields a correct EXPTIME O(1) test.\n- Keep the NEXPTIME middle-gap test as-is (with τ_b,τ_c∈R_K∪R_{K+1}). A full trichotomy in NEXPTIME follows by: if O(1) test passes ⇒ O(1); else run middle-gap test ⇒ Θ(log* n) if accept, Θ(n) otherwise.\n\n# Lemmas and corrected O(1) criterion\n\nLet E∈{0,1}^{β×β}, S_i diagonal (i∈{0,1}), M(w)=S_{i_1}·E·S_{i_2}·…·E·S_{i_k}. For a “period type” τ with matrix M_τ, define A_τ := M_τ·E. For a short type σ with matrix M_σ, define C_σ := E·M_σ·E.\n\n- Lemma (eventual loops in aperiodic SCC). For any Boolean adjacency A on β nodes and any node x in an SCC of period 1 (i.e., the gcd of all cycle lengths in that SCC equals 1), there exists N such that (A^m)[x,x]=1 for all m ≥ N.\n  Why useful: if a long periodic block has type τ and we pick x in an aperiodic SCC of A_τ, then regardless of the number k of periods (as long as k is large enough), we can realize a labeling with boundary output x on both ends of the block.\n\n- Definition (aperiodic boundary set). For τ, compute the SCC decomposition of the digraph of A_τ. Let L_τ := { x ∈ Σ_out : x lies in an SCC of A_τ with period 1 }.\n\n- Lemma (bridging across short block). Let τ_l,τ_r be long-block types, σ a short-block type. If ∃ x_l∈L_{τ_l}, x_r∈L_{τ_r} with C_σ[x_l,x_r]=1, then for all sufficiently large long-block repetition counts, one can label the left and right long blocks to present boundary outputs x_l and x_r, respectively, and then label the short block to connect them locally.\n  Why useful: reduces each interface to a constant matrix check; together with the previous lemma ensures compatibility for arbitrary (large) repetition counts.\n\n- Theorem (EXPTIME decision for O(1) on oriented paths). There is a deterministic EXPTIME procedure that decides whether the problem is O(1):\n  1) Build the reachable type set T (|T|≤2^{β^2}) and the length-filtered sets R_ℓ for 1≤ℓ≤2|T| (by iterating δ(M,i)=M·E·S_i).\n  2) Let L_pattern=|T|, L_width=|T|. For every τ∈R_{≤L_pattern}, compute L_τ via SCC periods of A_τ. If L_τ=∅ for some τ, return “not O(1)”.\n  3) For every triple (τ_l,σ,τ_r) with τ_l,τ_r∈R_{≤L_pattern} and σ∈⋃_{ℓ≤2L_width} R_ℓ, compute C_σ and check ∃ x_l∈L_{τ_l}, x_r∈L_{τ_r} with C_σ[x_l,x_r]=1. If any triple fails, return “not O(1)”. Otherwise, return “O(1)”.\n\nSketch of correctness. Necessity: If O(1), then every long periodic block type τ must be fillable for arbitrarily many repetitions k; hence some x admits loops for all large k, forcing x to lie in an aperiodic SCC (period=1), so L_τ≠∅. Interfaces must be fillable for all separators σ, hence the C_σ condition must hold for some choices x_l,x_r in those L_τ sets (apply replacement on long blocks to enforce those choices). Sufficiency: Construct the O(1) algorithm by the standard (L_width,L_count,L_pattern)-partition; in each long block of type τ choose any x∈L_τ and realize boundary x on both ends using the eventual-loop property; then at each short σ pick (x_l,x_r) satisfying C_σ and fill σ locally. All operations depend only on constant-radius choices.\n\nComplexity: Building T and R_ℓ is 2^{O(β^2)}·poly(β). Each L_τ needs SCC and period computation (poly(β)). The universal triple check is |T|^3 many constant-size matrix queries. Overall EXPTIME in β.\n\n# Examples\n\n- 2-coloring parity obstruction (Θ(log* n) on cycles): Σ_out={a,b}, E is the 2-cycle a↔b, Cin–out admits both outputs on both inputs. For any τ, A_τ has all SCCs of period 2, so L_τ=∅. The test correctly rejects O(1).\n- Trivial labeling: E is all-ones, Cin–out admits any output at either input. Each A_τ is primitive (aperiodic strongly connected), so every L_τ=Σ_out. For any σ, C_σ is all-ones, the interface check passes; the test accepts O(1).\n\n# Obstacles / checks\n\n- We must align the “unit step” consistently: a long block with k repetitions of w has boundary transfer (M_τ·E)^k composed with a final M_τ or not? Our interface uses C_σ=E·M_σ·E between blocks. The choice A_τ:=M_τ·E ensures A_τ^k represents k periods with the correct inter-period edge; the aperiodicity conclusion is unaffected by off-by-one constants.\n- We restrict long-block “period types” to τ∈R_{≤L_pattern}; this covers all primitive-word periods exposed by the partition. Types that cannot appear as periods are irrelevant for the O(1) decision.\n\n# Middle gap (recap)\n\n- Keep the NEXPTIME certificate f_type : T×{00,01,10,11}×T→Σ_out^2 and verify for τ_b,τ_c∈R_{K}∪R_{K+1} the scalar condition (E·M_{τ_b}·E·M_{τ_c}·E)[ℓ_2,r_1]=1 (EXPTIME check). If no such f_type exists, conclude Θ(n).\n\n# Next steps\n\n1) Write the formal proofs for: (i) eventual-loop lemma; (ii) necessity of aperiodic SCCs per τ; (iii) sufficiency via replacement and partition; and the exact alignment of products A_τ^k and C_σ across interfaces.\n2) Implement the EXPTIME O(1)-test and integrate with the existing NEXPTIME middle-gap verifier. Validate on randomized β and hand-crafted parity-like counterexamples.\n3) (Optional) Optimize by pruning τ that provably cannot arise as period types (e.g., by checking primitivity of representatives), though not needed for complexity bounds.\n\n# Conclusion\n\n- The corrected O(1)-test replaces the flawed per-type loop-set condition with an EXPTIME-checkable aperiodicity condition (period-1 SCCs of A_τ) plus constant-size interface checks. This blocks the parity counterexample and matches the intuition that O(1) labeling needs boundary feasibility for all large repetition counts. Coupled with the existing NEXPTIME middle-gap test, this yields a full NEXPTIME trichotomy for β-normalized, radius-1 LCLs on oriented paths.\n"
}