{
  "progress_md": "Round 0008 — endpoints for Stage-1 on paths, missing base case k=2→3, and a clean endpoint-aware feasible-function theorem\n\nSummary of gaps spotted in output.md\n- Missing base case k=2→3. The current output.md has Proposition 6 (k=1→2) and Proposition 7 (k=3→4), but does not state the k=2→3 update explicitly. This base rule is used by δ and is necessary for deterministic enumeration from length 1.\n- Stage-1 equivalence is still marked as “pending endpoint treatment.” The text has a clean Out-set feasible-function definition and the pumping/concatenation tools, but the (⇐) direction on paths needs endpoint handling. This is the main blocker to claiming the ω(n) vs o(n) trichotomy on globally oriented paths.\n- Minor duplication: concatenation is stated once for k_flag≥4 (Lemma 2) and later for all k_flag (Lemma 11). It is harmless, but a single “all k_flag” statement would suffice.\n\nProposed additions (self-contained, Ext-level, auditable) to close the Stage-1 endpoint gap\n\nDefinitions (endpoint projections and seam matrices)\n- RightColors(τ) := { y ∈ Σ_out : ∃ x1,x2,x3 with (x1,x2,x3,y) ∈ Ext_τ }.\n- LeftColors(τ) := { x ∈ Σ_out : ∃ x2,x3,x4 with (x,x2,x3,x4) ∈ Ext_τ }.\n- Endpoint seam-compatibility matrices:\n  - V_left[τ][α] is true iff ∃ y ∈ RightColors(τ) with E(y, α).\n  - V_right[α][τ] is true iff ∃ x ∈ LeftColors(τ) with E(α, x).\nWhy useful here. These capture exactly the one-sided feasibility needed to glue an endpoint block to its unique adjacent separator by a single E-edge. They can be computed in time 2^{poly(β)} after Ext tables, and they reduce all endpoint checks to constant-time lookups.\n\nLemma E1 (endpoint equivalences)\n- For any type τ and any color α, there exists a legal labeling of a left end-block P of type τ that matches E at the seam to a separator whose first output is α iff V_left[τ][α] is true.\n- Dually, there exists a legal labeling of a right end-block P of type τ that matches E at the seam from a separator whose second output is α iff V_right[α][τ] is true.\nSketch proof. The rightmost coordinate of Ext_τ lists all possible o4; the existence of an o4 with E(o4, α) is precisely V_left[τ][α]. For the right end, the leftmost coordinate lists all possible o1; the existence of x with E(α, x) is V_right[α][τ]. In both directions, Ext-membership provides the interior completion.\nWhy useful here. This is the missing local criterion to fill one-sided blocks in the Stage-1 construction on finite paths.\n\nEndpoint-aware Stage-1 witness for paths\n- Mid-separator feasible function (as in output.md). f_mid: T_long × {0,1}^2 × T_long → Σ_out^2 with the Out-set universal check via Ext_{τ_b ⊙ τ_c}.\n- Endpoint witnesses:\n  - g_L: T × {0,1}^2 → Σ_out^2 assigns the 2-node output on the unique separator adjacent to the left endpoint; for each (τ_end, s), let g_L(τ_end, s) = (β1, β2).\n  - g_R: {0,1}^2 × T → Σ_out^2 assigns the 2-node output on the unique separator adjacent to the right endpoint; for each (s, τ_end), let g_R(s, τ_end) = (β1, β2).\nConstraints for g_L,g_R:\n  - Node/window legality: βi ∈ A_{s[i]} (i=1,2) and E(β1, β2).\n  - One-sided seam feasibility: V_left[τ_end][β1] = true for g_L, and V_right[β2][τ_end] = true for g_R.\nWhy useful here. These capture exactly the conditions needed to legally glue an endpoint block to its neighbor separator using only Ext-tables (no global simulation).\n\nTheorem P-S1 (Stage-1 on globally oriented paths)\nLet P be a β-normalized radius-1 LCL on globally oriented paths. The following are equivalent:\n1) P has deterministic LOCAL complexity o(n) on paths.\n2) There exist witnesses (f_mid, g_L, g_R) satisfying: f_mid is feasible (Out-set form in output.md) and g_L,g_R satisfy the above constraints with V_left,V_right.\nMoreover, the existence of such witnesses is verifiable in nondeterministic time 2^{poly(β)}.\n\nProof outline and how it fits the current framework\n- (⇒) Given an o(n) algorithm A, extract f_mid as in output.md (Lemma 18 style) using pumping and concatenation. For g_L and g_R, place a single separator S next to an arbitrary end block of type τ_end, embed the configuration in a large pumped path to the left/right, simulate A for o(n) rounds, and define g_L(τ_end, s) (resp. g_R) as the 2-node output on S. Local legality of A guarantees the node/window constraints, and seam legality implies the corresponding endpoint matrix entry (Lemma E1). All constructions depend only on Types by pumping; hence well-defined.\n- (⇐) Given (f_mid, g_L, g_R), compute in O(log* n) rounds an MIS on the K-th power of the directed path with K := ℓ_pump + 4. As in output.md, label every internal separator with f_mid and fill each middle block via the Ext-witness in Ext_{τ_b ⊙ τ_c}. For the left end block P_end with its unique neighbor separator S, let g_L(τ_end, s) = (β1, β2). By V_left[τ_end][β1], choose (o1,o2,o3,o4) ∈ Ext_{τ_end} with E(o4, β1) and fill P_end accordingly; similarly the right end via g_R and V_right. All node and edge constraints hold by Ext membership and seam E-tests. Runtime is O(log* n); endpoints add no overhead.\n- NEXPTIME verification. Deterministically enumerate T, T_long, Ext tables, and precompute V_left,V_right and the seam-feasibility matrices W_{b⊙c} (already in output.md). Nondeterministically guess f_mid, g_L, g_R and verify: (i) node/window constraints for all entries; (ii) the Out-set universal checks for f_mid using W_{b⊙c}; (iii) one-sided checks for g_L,g_R using V_left,V_right. Total time 2^{poly(β)}.\nWhy useful here. This removes the “pending endpoint treatment” remark and completes the o(n) vs Ω(n) decision for globally oriented paths at the type/Ext level.\n\nExplicit k=2→3 base-case to insert\nProposition (Base-case update; k=2→3). Let t = (b1, b2), t′ := t·a. For all (x1, x2, x3, x4) ∈ Σ_out^4,\n(x1,x2,x3,x4) ∈ Ext_{t′} ⇔ [ x3 = x2, x1 ∈ A_{b1}, x2 ∈ A_{b2}, x4 ∈ A_a, E(x1,x2), E(x2,x4) ].\nWhy useful here. Needed by δ to lift k_flag from 2 to 3 and to make the append DP fully constructive from seeds.\n\nComplexity notes (consistent with output.md)\n- Precompute T via δ in 2^{poly(β)}; compute Ext_τ for all τ and Ext_{τ_b ⊙ τ_c} (for τ_b,τ_c ∈ T_long) using the O(β^6) routine; precompute W_{b⊙c} and V_left,V_right in β^{O(1)} per pair.\n- Certificate size: f_mid has |T_long|^2·4 entries; g_L has |T|·4, g_R has |T|·4 entries. Verification consists of constant-time table lookups per case; total time 2^{poly(β)}.\n\nSanity checks (toy instances)\n- Equality LCL (E={(c,c)}, A_0=A_1={c}). RightColors(τ)=LeftColors(τ)={c} for all τ; choose f_mid(·)=(c,c), g_L=g_R=(c,c). All matrices trivial; accepts.\n- Proper 2-coloring (Σ_out={a,b}, E forbids equal). A standard f_mid exists (alternating), and V_left,V_right are always true since RightColors=LeftColors={a,b}. Stage-1 accepts. (Stage-2 will correctly reject constant-time.)\n- Linear-hard case: If for some τ_end, RightColors(τ_end) has no E-neighbor in a color forced as β1 by any g_L, then V_left fails and the verifier rejects, certifying Ω(n).\n\nAction items for outputs.md\n- Add the k=2→3 base rule explicitly (as above), beside k=1→2 and k=3→4.\n- Add RightColors/LeftColors and the endpoint matrices V_left,V_right with a short correctness lemma (Lemma E1).\n- Add the endpoint-aware Stage-1 theorem (Theorem P-S1) with the construction/verification outline; reference existing Lemmas 11–14 and Prop. 21 for the internal (two-sided) parts.\n- Optional editorial: merge Lemma 2 and Lemma 11 into a single “all k_flag” concatenation lemma, or keep both but note that Lemma 11 subsumes Lemma 2.\n\nNotes toward Stage-2 (constant vs log* n)\n- The paper’s (ℓ_width, ℓ_count, ℓ_pattern)-partition (Lemma 22) is already reproduced for cycles and applies to oriented paths with a simpler orientation primitive. Integrating the per-type boundary-interface witness Q_τ and bridging checks from earlier rounds should now be feasible. I will prepare a path-specialized statement and proof next, using the existing Ext machinery and associativity.\n\nWhy these steps are incremental and testable\n- All additions reduce to precomputable projections or matrices over already-defined Ext tables; no new global gadgets are used.\n- The endpoint matrices enable immediate unit tests: compute V_left,V_right on random tiny instances and compare against brute-force searches over Ext.\n- The endpoint-aware theorem uses the same MIS-based spacing (already standard and cited) and reuses W_{b⊙c}; only constant-size endpoint lookups are added.\n"
}