{
  "content": "Ideas\n- Goal: Conjecture 7.2 (units of the Habiro ring ℤ[q]^ℕ are exactly {±q^i}). We consolidate and extend the toolbox with three new, rigorous statements that are immediately testable: (A) a prime-order rigidity lemma (special case of the “infinitely many prime powers” rigidity, but stated for primes); (B) a canonical exponent (slope) i from the Ohtsuki expansion and its first-order p-adic matching at all towers μ_{p^∞} (p odd); (C) a uniform tail-control lemma at p-power roots. These sharpen the route to produce infinitely many exact monomial evaluations needed for the existing rigidity criterion.\n\nProposition A (prime-order rigidity)\nStatement. Let u∈U(ℤ[q]^ℕ). If there exist i∈ℤ and an infinite set Π of odd primes such that for each ℓ∈Π and each primitive ℓ-th root ζ we have u(ζ)=±ζ^i, then u=±q^i in ℤ[q]^ℕ.\nProof. Let Z be the set of those primitive ℓ-th roots with ℓ∈Π. By Theorem (paper’s thm:2), the evaluation map τ^ℤ_{ℕ,Z}: ℤ[q]^ℕ→∏_{ζ∈Z}ℤ[ζ] is injective (Z contains infinitely many prime powers—here primes). Hence w(q):=u(q)/(±q^i) maps to the constant 1 on Z, so w=1. ∎\n\nLemma B (canonical exponent and first-order matching)\nLet u∈U(ℤ[q]^ℕ). Write its Habiro expansion u=∑_{n≥0} a_n(q) (q)_n with a_n∈ℤ[q]. Then:\n(i) u(1)=a_0(1)∈{±1} and u′(1)=a_0′(1)−a_1(1). In particular i:=u′(1)/u(1)∈ℤ is well-defined.\n(ii) Fix an odd prime p and a≥1, and let ζ be a primitive p^a-th root. In ℤ_p(ζ), we have\nu(ζ) ≡ u(1)·ζ^i mod (ζ−1)^2.\nProof. (i) Evaluate at q=1: (q)_0(1)=1, and (q)_n(1)=0 for n≥1. For derivatives, (q)_1′(1)=−1 and (q)_n′(1)=0 for n≥2, giving the stated formula. Since u(1)=±1, i∈ℤ.\n(ii) In ℤ_p[[X]] with X=q−1, write u(1+X)=ε + ε i X + X^2 w(X), where ε=u(1)=±1. Substitute X=ζ−1; for p odd, |ζ−1|_p<1, so convergence holds and u(ζ)≡ε+ε i(ζ−1) mod (ζ−1)^2. Also ζ^i≡1+i(ζ−1) mod (ζ−1)^2, hence u(ζ)≡ε·ζ^i mod (ζ−1)^2. ∎\n\nLemma C (uniform tail control at p-power roots)\nStatement. Fix an odd prime p and r≥1. There exists N(r) such that for every a≥1 and every primitive ζ of order p^a, one has (q)_n(ζ)≡0 mod p^r in ℤ_p(ζ) for all n≥N(r).\nProof. For k≥1 we have v_{𝔭}(1−ζ^k)=v_{𝔭}(1−ζ)+v_p(k) (standard for cyclotomic towers). Thus\nv_{𝔭}((q)_n(ζ)) = ∑_{k=1}^n v_{𝔭}(1−ζ^k) = n v_{𝔭}(1−ζ)+v_p(n!).\nSince v_{𝔭}(1−ζ)=1/(p^{a−1}(p−1))>0 and v_p(n!)→∞ with n, the RHS→∞ with n uniformly in a (because v_p(n!) is independent of a). Hence for any prescribed r there is N(r) so that v_{𝔭}((q)_n(ζ))≥r for every a and n≥N(r). ∎\nWhy useful. For any u=∑ a_n(q) (q)_n, the tail ∑_{n≥N(r)} a_n(ζ) (q)_n(ζ) is 0 mod p^r uniformly in a; one only needs to analyze finitely many head terms to study u(ζ) modulo p^r along μ_{p^∞}.\n\nExamples\n- If u=±q^i, then Lemma B recovers i and ±, and Lemma C is tautologically satisfied. Proposition A applies to any sequence of primes.\n- Non-monomial Laurent polynomials g∈ℤ[q,q^{−1}] cannot be Habiro-units (proved earlier): immediately rules out classical candidates like γ_m.\n\nObstacles\n- Lemma B gives only first-order congruence u(ζ)≡u(1)·ζ^i modulo (ζ−1)^2 along μ_{p^∞}, not exact equality at infinitely many levels. Lemma C controls tails but does not, by itself, force exact equality. A mechanism to promote congruences to equalities (e.g., via p-adic logarithms and a tower-lifting criterion) is still missing.\n\nNext steps\n- Local lifting attempt: For the normalized v(q):=u(q)/(u(1) q^i), set E_{p^a}:=v(ζ_{p^a})∈1+(ζ−1)^2. Study log E_{p^a}∈𝔭 in ℤ_p(ζ_{p^a}); aim to prove log E_{p^a}=0 for infinitely many a (then E_{p^a}=1 and Proposition A applies). Lemma C reduces this to finitely many head coefficients modulo p^r.\n- Two-prime synthesis: Do the previous step for two odd primes p and q to pin down the same i and apply the “infinite exact match” rigidity (Theorem (thm:2)).\n- Formalize all statements (Proposition A, Lemma B, Lemma C) in proofs.md with complete proofs. These, together with the previously established Laurent-polynomial classification and torsion-units result, give a coherent, verifiable partial framework toward Conjecture 7.2.\n"
}