{
  "content": "Ideas\n- Target: Conjecture 7.2 (units of the Habiro ring ℤ[q]^ℕ are exactly {±q^i}). We add three rigorous, testable results: (P1) Laurent-polynomial units are monomials; (P5) a determinant/product identity for values at n-th roots; (P6) a rigidity lemma via vanishing at infinitely many cyclotomic factors. We also record a useful p-adic valuation identity (L2) to support future “tower” analyses.\n\nProposition P1 (Laurent-polynomial units are monomials)\nStatement. If g ∈ ℤ[q,q^{-1}] is a unit in the Habiro ring ℤ[q]^ℕ, then g=±q^i for some i∈ℤ.\nProof. Write g=q^i h with i∈ℤ and h∈ℤ[q] chosen so h(0)≠0. Pick a prime p∤h(0). Over 𝔽_p, the reduction ĥ∈𝔽_p[q] is a nonconstant polynomial with nonzero constant term, hence has a nonzero root α in some 𝔽_{p^f}. Let n=ord(α) in 𝔽_{p^f}^×. Then α is a root of Φ_n modulo p, so there is a ring map θ: ℤ[q]/(Φ_n)→𝔽_{p^f}, q↦α. Since ĥ(α)=0, θ(h)=0 and θ(g)=θ(q^i)θ(h)=0. Thus g is not a unit in ℤ[q]/(Φ_n). By the inverse limit unit criterion (if x maps to a unit in every finite quotient then x is a unit), g cannot be a unit in ℤ[q]^ℕ. Hence h=±1 and g=±q^i. ∎\nCorollary. For odd m≥3, γ_m(q)=∑_{j=0}^{m−1}(−1)^j q^j is not a unit in ℤ[q]^ℕ.\n\nProposition P5 (Determinant/product identity)\nStatement. If u ∈ U(ℤ[q]^ℕ), then for every n≥1 we have ∏_{ζ^n=1} u(ζ)=±1.\nProof. The image ū of u in R_n:=ℤ[q]/(q^n−1) is a unit, hence multiplication-by-ū is an automorphism of the free abelian group R_n, with determinant ±1. Over ℂ, ℂ⊗R_n≅⊕_{ζ^n=1}ℂ via evaluation at ζ, and the eigenvalues of multiplication by ū are u(ζ). Thus det=∏_{ζ^n=1}u(ζ)=±1. ∎\nRemark. For n=ℓ prime, this recovers u(1)·N_{ℚ(ζ_ℓ)/ℚ}(u(ζ_ℓ))=±1. As N of a unit is ±1, this gives no extra restriction alone, but P5 is a convenient global constraint for subsequent arguments.\n\nProposition P6 (Rigidity from infinitely many cyclotomic congruences)\nStatement. Let u ∈ U(ℤ[q]^ℕ). If there exists an infinite set T⊂ℕ containing infinitely many prime powers such that u≡1 mod Φ_n(q) in ℤ[q]/(Φ_n) for all n∈T, then u=1 in ℤ[q]^ℕ. More generally, if u≡±q^i mod Φ_n for all n in such T with the same sign and i, then u=±q^i.\nProof. Let Z be the set of primitive roots of unity of orders in T. By Theorem (paper’s thm:2), τ^ℤ_{ℕ,Z} is injective. The hypothesis u≡1 mod Φ_n for all n∈T says u(ζ)=1 for all ζ∈Z, hence τ(u)=1 and u=1. The ±q^i variant is identical after dividing by ±q^i. ∎\n\nLemma L2 (p-adic valuation at p-power roots)\nStatement. Let p be an odd prime, a≥1, and ζ a primitive p^a-th root. Then for any integer 1≤k<p^a, v_{𝔭}(1−ζ^k)=v_{𝔭}(1−ζ)+v_p(k), where v_{𝔭} is the normalized valuation on ℚ_p(ζ) with v_{𝔭}(p)=1.\nSketch. In ℚ_p(ζ), 1−ζ is a uniformizer and the cyclotomic extension is totally ramified of degree φ(p^a)=p^{a−1}(p−1). Using the identity ζ^k−1=(ζ−1)(1+ζ+⋯+ζ^{k−1}), one checks v_{𝔭}(1+⋯+ζ^{k−1})=v_p(k) (this is standard; e.g., via the p-adic logarithm or Kummer’s congruences). ∎\nWhy useful. Evaluating (q)_n(ζ)=∏_{r=1}^n(1−ζ^r) gives v_{𝔭}((q)_n(ζ))=n·v_{𝔭}(1−ζ)+∑_{r=1}^n v_p(r)=n·v_{𝔭}(1−ζ)+v_p(n!). This underlies attempts to control u(ζ) modulo high powers of the prime above p.\n\nExamples\n- γ_m non-unit (odd m): immediate from P1. This addresses and closes a previously noted caveat.\n- If u ∈ U(ℤ[q]^ℕ) and u(ζ)=1 for all primitive ζ of orders in an infinite set of prime powers (e.g., some fixed p^a varying a), then u=1 by P6.\n\nObstacles\n- Upgrading p-adic congruences u(ζ_{p^a})≡u(1) mod (1−ζ_{p^a}) to exact equalities for infinitely many a is nontrivial; L2 shows valuations of (q)_n(ζ_{p^a}) depend on a in a delicate way, and simple “increasing congruence depth” does not follow uniformly.\n- The determinant identity P5 alone does not force u(ζ_ℓ) to be a root of unity; extra global input is needed to pin down the principal-unit parts at infinitely many ℓ.\n\nNext steps\n- Combine L2 with explicit Habiro expansions u=∑_{n≥0} a_n (q)_n to bound u(ζ_{p^a}) modulo (1−ζ_{p^a})^M uniformly in a for suitable M depending on the first coefficients; investigate whether for some M the principal-unit part must vanish for infinitely many a.\n- Seek conditions guaranteeing u≡±q^i mod Φ_ℓ for infinitely many primes ℓ; even a weaker statement (for infinitely many ℓ in some arithmetic progression) would imply the conjecture via P6.\n- Formalize P1, P5, P6 (and L2 with references) into proofs.md; they are independent, checkable contributions toward Conjecture 7.2.\n"
}