{
  "content": "Ideas\n- We formalize a class of “strongly local” metrics d on X=G_{\\bullet,D} (degree-bounded or D-regular) that dominate the Benjamini–Schramm metric d_\\bullet in the sense: closeness in d forces agreement of a large finite r-ball around the root. This ensures any d-open ball is contained in some d_\\bullet-cylinder C(F), and small enough d-balls are contained in finer cylinders C(F′).\n- Within this class we give a general criterion: if the complement of a property P can be forced by a cylinder-refinement (i.e., from any cylinder one can refine to a smaller cylinder all of whose extensions lie in P^c), then P is nowhere dense under any such d. We then implement the bridge-forcing refinement in full detail for X=G_{\\bullet,\\le D} (all D≥3) and X=G_{\\bullet,=D} with D odd, thereby establishing robustness of “bridgeless is nowhere dense.”\n- For even D in the regular space, bridgeless is already comeagre under d_\\bullet (since 1-way bridges are impossible and 2-way bridges are meagre), so no “flip” is needed.\n\nDefinitions\n- Strongly local (dominating) metric. A metric d on X is strongly local if there is a modulus ψ:(0,1]→\\mathbb{N} such that for all x,y∈X and ε∈(0,1],\n  d(x,y)<ε ⇒ B_{ψ(ε)}(x)≅B_{ψ(ε)}(y).\n  Equivalently, every d-ball U=B_d(x,ε) is contained in the cylinder C(B_{ψ(ε)}(x)).\n- Basic cylinders. For an r-ball F, let C(F)={x∈X: B_r(x)≅F}.\n\nExamples\n- Weighted-sum local metrics: given weights (w_r)_{r≥0} strictly decreasing with w_r>0 and ∑_r w_r<∞, define\n  d_w(x,y)=\\sum_{r≥0} w_r·1_{B_r(x)\\not\\cong B_r(y)}.\n  Then d_w is strongly local: if d_w(x,y)<w_R, there can be no mismatch at any radius ≤R, hence B_R(x)≅B_R(y). The topology is Polish (X embeds as a closed subset of a countable product of finite discrete sets; d_w induces the product topology).\n- Any metric topologically finer than d_\\bullet with the above modulus property is strongly local.\n\nGeneral lemma (robust nowhere-denseness under strongly local metrics)\nLemma 1. Let d be strongly local on X. Suppose S⊂X has the following forcing property: for every r-ball F with C(F)≠\\varnothing, there exists r′≥r and an r′-ball F′ extending F such that C(F′)≠\\varnothing and every x∈C(F′) lies in X\\S. Then S is nowhere dense in (X,d).\nProof. Let U be a nonempty d-open set. Pick x∈U and ε>0 with B_d(x,ε)⊂U. Put r=ψ(ε); then B_d(x,ε)⊂C(B_r(x)). By assumption, there exists r′≥r and F′ extending B_r(x) with C(F′) nonempty and C(F′)⊂X\\S. Choose y∈C(F′). For any 0<δ<1 with ψ(δ)≥r′, we have B_d(y,δ)⊂C(B_{r′}(y))=C(F′)⊂X\\S. Hence U contains a nonempty d-open subset B_d(y,δ) disjoint from S. Therefore interior_d(\\overline{S}^d)=\\varnothing, i.e., S is nowhere dense.\n\nBridge forcing in X=G_{\\bullet,\\le D} (all D≥3)\nWe prove the forcing hypothesis of Lemma 1 with S=“bridgeless graphs.” Fix (G,\\rho) and r, and put F=B_r(G,\\rho). Let u∈L_r(F) be a boundary vertex with deg_F(u)<D (such a u exists since G is infinite and Δ(G)≤D). We build an r′-ball F′ extending F so that every extension of F′ contains a bridge. The key is to create a finite “sealed lump” T attached to u by a single edge e=ut_0, and to saturate all vertices of T to their maximum allowed degree D within F′, so that in any extension no new edges can be added incident to T; hence e is the only edge from T to the rest of the graph in every extension, and therefore a bridge.\nConstruction of T.\n- Pick an odd integer n≥D+2, and create new vertices t_0,t_1,…,t_{n-1}. We will add edges among the t_i’s and connect u to t_0 by e.\n- Target degrees inside F′:\n  • For each i≥1, set deg_{F′}(t_i)=D.\n  • Set deg_{F′}(t_0)=D, with one of these D edges being e=ut_0.\n  • No vertex in T has any neighbor outside T∪{u} within F′.\n- Thus inside the induced subgraph on T the degree sequence is (D-1,D,…,D) of length n: t_0 has D−1 neighbors in T, each t_i (i≥1) has D neighbors in T.\n- Existence (Erdős–Gallai check). For D≥3 and odd n≥D+2, the nonincreasing sequence (D,…,D,D−1) is graphic. Indeed, its sum D(n−1)+(D−1)=Dn−1 is even when D and n are odd. For 1≤k≤n−1, with min(k,D) treated casewise,\n  ∑_{i=1}^k d_i≤k(k−1)+(n−k)min(k,D)\n  holds because for k≤D the RHS is kn−k≥Dk, and for k≥D+1,\n  Dk≤k(k−1)+(n−k)D ⇔ 0≤k^2−(1+2D)k+nD,\n  which is minimized at k=D+1, where it equals D(n−D−1)≥D>0 since n≥D+2. For k=n the inequality is trivial. Hence such a simple graph on T exists. Now add e=ut_0. This realizes the target degrees inside F′.\n- Choose r′ large enough to contain T∪{u} and all its edges at distance ≤r′ from the root.\n- Ensure nonemptiness (room to extend): choose a boundary vertex w∈L_r(F) with w≠u and leave deg_{F′}(w)<D (e.g., add nothing at w); then T is sealed, but w has residual capacity. Any infinite locally finite completion can be grown off w (e.g., by attaching a degree-≤D infinite tree beyond radius r′), ensuring C(F′)≠\\varnothing.\nVerification (bridge). In any extension of F′ within X, every vertex in T already has degree D in F′, so no further edges with an endpoint in T can be added. Within F′, the only edge between T and V(F′)\\T is e=ut_0. Hence in any completion, e is the unique edge whose deletion separates the finite set T from the rest, so e is a 1‑way infinite bridge. Thus C(F′)⊂X\\S, as required.\nRemark on parity. The above construction crucially uses n odd (to pass the graphicity check). This covers all D≥3 by choosing n odd; there is no obstruction in the ≤D space because degrees inside T are exactly D and the unique cross-edge e is accounted for via the neighbor u∉T.\n\nBridge forcing in X=G_{\\bullet,=D} for odd D≥3\nWe adapt the previous gadget, but must maintain exact D-regularity in the final graph. The same T works: inside F′, all vertices of T have degree D (counting e), and no further edges incident to T are allowed in any extension. The rest of F′ (including u) may have residual degree and will be completed outside F′. As before, e is the only edge between T and the rest in any completion; thus e is a 1‑way infinite bridge.\nNonemptiness: leave at least one vertex z in F′\\T with deg_{F′}(z)<D to permit D-regular completion; as the outside is infinite, one can attach a D-regular infinite completion (e.g., graft a D-regular tree or any standard D-regular expander tail) to z and distribute the finitely many residual stubs in F′ in a finite neighborhood. Therefore C(F′)≠\\varnothing.\n\nConclusion via Lemma 1\n- For X=G_{\\bullet,\\le D} (D≥3) and X=G_{\\bullet,=D} with D odd, the complement of “bridgeless” is forced by a cylinder refinement inside any cylinder. Hence “bridgeless” is nowhere dense under any strongly local metric d.\n- If, additionally, (X,d) is Baire (e.g., Polish via product-coding as above), then “bridgeless” is meagre.\n\nEven D-regular case\nIn D-regular graphs with even D, 1‑way infinite bridges are impossible (standard parity argument: if A is the finite side of a cut with a single edge, then |δ(A)|≡D|A| (mod 2), contradiction). The paper’s Theorem 16 shows graphs with a 2‑way infinite bridge form a meagre set. Hence “bridgeless” is comeagre (typical) already under d_\\bullet; the above robustness is not needed to obtain typicality.\n\nObstacles and clarifications\n- Why the “single sealed lump” T suffices in ≤D for all D≥3: Although parity often obstructs “one cross edge” between a finite K and its complement when all degrees in K are pre-specified internally, our construction specifies degrees of T inside F′ counting the cross-edge e to u∉T. This removes the parity obstruction for all D by choosing n odd. The graphicity check above is the only nontrivial existence point, and it is satisfied.\n- Necessity of strong locality: The proof of Lemma 1 uses that a d-ball is contained in a cylinder, and that smaller d-balls around a refined cylinder point are contained in the refining cylinder. Without this domination property, we cannot guarantee that open neighborhoods stay inside a cylinder that forces a bridge.\n\nNext steps (for verifier)\n1) Formalize “strongly local” precisely in the notes and record the general Lemma 1 with its short proof. Add the example class d_w.\n2) Write a complete, self-contained proof of the graphicity claim: for odd n≥D+2, the degree sequence (D,…,D,D−1) is graphic (we gave a full Erdős–Gallai verification).\n3) Package the forcing construction as a lemma: In X=G_{\\bullet,\\le D} (D≥3) and X=G_{\\bullet,=D} with D odd, for any cylinder C(F) there exists a refinement C(F′) such that every extension contains a 1‑way infinite bridge, and C(F′)≠\\varnothing.\n4) Conclude: For any strongly local (Polish) metric d on X, “bridgeless” is nowhere dense (hence meagre), so typicality does not change within this natural class. For even D‑regular, “bridgeless” is already typical under d_\\bullet.\n\nRemarks on alternative, nonlocal metrics\n- Adding global “bridge profile” coordinates (e.g., H_r indicating existence of a bridge meeting B_r) to define d_new=d_\\bullet+\\sum 2^{−r−1}|H_r(x)−H_r(y)| yields neighborhoods where the bridge set may have interior, and completeness/Baire-ness can fail (sequences that push bridges arbitrarily far out are Cauchy with no limit preserving profile). This suggests such metrics are not Baire-safe.\n\nSummary\n- We provided a rigorous invariance scheme for “bridgeless is nowhere dense” under a broad, natural class of strongly local (dominating) metrics, with explicit bridge-forcing gadgets and a fully verified graphicity step. This makes measurable, auditable progress toward a negative answer to the conjecture within a robust class of alternative metrics. Pending: a systematic catalogue of natural metrics satisfying strong locality, and an impossibility or construction result outside this class."
}