{
  "feedback_md": "Key audits and corrections\n\n- Prover 1: Your star analysis conflates the agent-moving and object-moving models. In our setting, agents are fixed on vertices; objects move. Phrases like “center becomes A” and the arc condition u→v defined via u’s preferences are agent-moving semantics and lead to invalid sequences (e.g., a purported leaf–leaf swap). The non-uniqueness counterexample as stated is therefore incorrect for our model. Do not use an agent-transition digraph on stars. A correct object-moving account is given by Prover 3 via an object-acceptance digraph and center-object monotonicity. Please rework your star analysis accordingly and drop the agent-moving terminology.\n\n- Prover 2: Good corrections: the “k movers” procedure is XP (n^{O(k)}), not FPT. The proposed FPT by number of leaves L is plausible as a decomposition at an articulation vertex with branch path subroutines and boundary summaries, but the cycle-composition lemma (your Lemma G) needs a precise and verifiable boundary state. At present it is a promising outline, not a proof. Provide a formal specification of boundary tokens, the exact partial orders kept, and a correctness proof for global acyclicity from local summaries.\n\n- Prover 3: Your star lemmas (center-object monotonicity, each leaf swaps at most once) are sound for object-moving and the star counterexample demonstrates that terminal allocations (sinks) are not unique, though the final center object is unique. Keep this line; develop a DP on the acceptance DAG to decide existence of a PO sink without path enumeration.\n\n- Prover 4: The XP(k) algorithm is rigorous and immediately useful as a baseline exact solver for small k; we can add it to proofs.md. The double-star scheme has clear invariants (bridge swaps only across {u,v}, O(n) bound) but remains heuristic until confluence/order-independence issues on each side are settled; keep it in notes.\n\nSafe building blocks (retain in proofs): reachable ⇒ IR; PO test via improvement-digraph acyclicity; fixed-target reachability on trees (good-edge scheduler); NP membership from these two tests. One-sided polytime certificates: TTC-reachable and sink-test (compute a sink then PO-test) remain valid but incomplete.\n\nNext steps\n\n- Prover 1: Rewrite the star analysis in object-moving terms (object-acceptance DAG over objects; center vertex agent’s order controls monotone progress). Drop agent-transition digraph H.\n- Prover 2: Formalize the L-leaves algorithm: exact boundary state definition, per-branch path solver with prescribed in/out flows, and a proof that the union of boundary partial orders characterizes global acyclicity.\n- Prover 3: Provide a formal proof that leaf swaps at most once and uniqueness of the final center object; then attempt a DP over the acceptance DAG to decide PO-sink existence.\n- Prover 4: Keep XP(k) and add correctness details; for double-stars, either prove local confluence or define a bounded branching that yields completeness with a complexity bound.\n",
  "summary_md": "We corrected model confusions and consolidated safe results: reachable ⇒ IR; global PO test via improvement-digraph; fixed-target tree reachability; NP membership. TTC remains only a sufficient certificate. For stars (object-moving), the final center object is unique but terminal allocations need not be; a valid counterexample was given. An XP algorithm in k movers is formalized as a baseline exact solver. Proposed FPT by number of leaves requires precise boundary summaries before entering proofs. Next: formalize the leaves-parameter DP, a star-DAG DP for PO sinks, and refine double-star confluence or bounded branching.",
  "verdict": "uncertain",
  "blocking_issues": [
    "Prover 1’s star analysis uses agent-moving semantics and is invalid in the object-moving model.",
    "No complete polynomial-time algorithm on trees; only one-sided certificates and XP-by-k are rigorous so far.",
    "FPT-by-leaves outline lacks a formal boundary state and correctness proof.",
    "Star case: non-uniqueness of sinks complicates naive greedy approaches; complete characterization still open."
  ],
  "per_prover": [
    {
      "prover_id": "01",
      "brief_feedback": "Your star digraph H and example use agent-moving semantics; they are invalid for object-moving. Recast entirely in object-moving terms (object-acceptance over center’s order) and drop claims based on agent transitions.",
      "score": "unlikely"
    },
    {
      "prover_id": "02",
      "brief_feedback": "Good corrections: XP-by-k is accurate; FPT-by-leaves is promising but needs a precise boundary summary and proof that local acyclicity plus boundary acyclicity implies global PO. Provide full details next.",
      "score": "uncertain"
    },
    {
      "prover_id": "03",
      "brief_feedback": "Solid: correct star lemmas (monotone center object; leaves swap at most once) and a valid non-uniqueness counterexample. Push toward a DP over the acceptance DAG to decide PO-sink existence.",
      "score": "promising"
    },
    {
      "prover_id": "04",
      "brief_feedback": "XP(k) algorithm is rigorous and ready for proofs.md. Double-star invariants are useful; work toward confluence or bounded branching to ensure completeness and a complexity bound.",
      "score": "promising"
    }
  ],
  "notes_update": {
    "action": "append",
    "content": "Model alignment and star dynamics (object-moving)\n\n- In our model, agents are fixed on vertices; objects move along edges by allowed swaps. Analyses based on agents moving (e.g., “center becomes A”) are invalid here.\n\n- Stars: Let the center vertex agent have strict order ≻_c. A swap with leaf ℓ at state where the center holds x and ℓ holds h_ℓ is allowed iff h_ℓ ≻_c x and x ≻_ℓ h_ℓ. Along any swap sequence, the center’s held object strictly increases in ≻_c; each leaf swaps at most once. The final center object is unique (maximal in the acceptance DAG under ≻_c), but terminal allocations (sinks) are not unique; e.g., with center order b ≻ a ≻ x0 and both leaves preferring x0 ≻ a ≻ b, both paths x0→b and x0→a→b are valid and yield distinct sinks.\n\n- Safe verifiers retained: fixed-target reachability on trees via good-edge scheduling (O(n^2)); global PO test via improvement-digraph acyclicity (O(n^2)); hence TREE-REACHABLE-PE ∈ NP. TTC reachability and sink-test remain sound one-sided certificates.\n\n- Parameterization: Enumerating at most k movers yields an exact XP algorithm in n^{O(k)} time by enumerating subsets S (|S|≤k) and injective assignments on S, then checking reachability and PO per candidate.\n\n- Leaves parameter (outline): Root at an articulation r; for a bounded number of leaves L, enumerate cross-branch flow patterns across r; solve each branch (path) under boundary constraints and summarize a boundary partial order; accept if the union summary is acyclic and per-branch PO holds. Requires a precise boundary state and a correctness proof.\n\nNext steps: (i) Replace any agent-moving formulations with object-moving ones; (ii) formalize the leaves-parameter boundary summaries and proofs; (iii) develop a star acceptance-DAG DP to decide existence of a PO sink without path enumeration; (iv) continue assembling small instances (n≤6) to test and refine structural claims."
  },
  "proofs_update": {
    "action": "append",
    "content": "Theorem (XP algorithm parameterized by the number of movers k). Fix a tree T, initial allocation µ0, and strict preferences. Let k be an upper bound on the number of movers (agents a with µ(a) ≠ µ0(a)). There is an algorithm that decides TREE-REACHABLE-PE and outputs a witness when one exists with ≤k movers, running in time n^{O(k)}·poly(n).\n\nProof. For each s=0,…,k, enumerate all subsets S⊆A with |S|=s. For each S, enumerate all injective maps φ: S → B\\{µ0(a): a∈A\\S}. Define a candidate matching µ by µ(a)=φ(a) for a∈S and µ(a)=µ0(a) for a∉S. For each connected component C of the induced forest T[S], check reachability of µ|_C from µ0|_C on the subtree induced by C (apply the O(n^2) tree target-reachability routine). If any component fails, discard µ. Otherwise, form the full matching µ and test global PO in O(n^2) via acyclicity of the improvement digraph. If both checks pass, output µ along with the concatenated per-component swap sequences (interleaved arbitrarily, as components are edge-disjoint), which realizes µ from µ0 on T. If no candidate passes, answer NO.\n\nCorrectness. Any solution with ≤k movers has some S and φ as above; outsiders remain fixed, so reachability reduces to independent checks on components of T[S]. Conversely, the procedure outputs only matchings that are both reachable (componentwise realizable) and globally PO (acyclic improvement digraph). The interleaving of componentwise swap sequences is valid since components are edge-disjoint.\n\nRunning time. The number of candidates is ∑_{s=0}^k C(n,s)·P(n,s) = n^{O(k)}. Each candidate verification (reachability and PO) is polynomial, yielding total time n^{O(k)}·poly(n). ∎"
  },
  "output_update": null
}