{
  "progress_md": "Ideas and notation\n- Problem restated. For a finite multiset A of positive reals, define the participation ratio P(A) := (∑_{a∈A} a)^2 / (∑_{a∈A} a^2). We want a universal constant C such that for every A there exists A' ⊆ A with max(A') ≤ 2 min(A') and |A'| ≥ C P(A). Let M(A) be the largest number of points from A in any multiplicative interval [t, 2t] (equivalently, the maximum over choices of min of a valid A'). Then the target inequality is |A'| ≥ C P(A), and it suffices to prove P(A) ≤ K M(A) for some absolute K, because this implies |A'| ≥ (1/K) P(A).\n- Dyadic “bin” viewpoint. For any shift α ∈ [0, 1) (log base 2), let I_k(α) := [2^{k+α}, 2^{k+α+1}) be half-open bins of multiplicative length 2. For a fixed α, let B_k := A ∩ I_k(α) with cardinality m_k := |B_k|, sum s_k := ∑_{a∈B_k} a, and square-sum q_k := ∑_{a∈B_k} a^2. Write S := ∑ a = ∑_k s_k and Q := ∑ a^2 = ∑_k q_k. For any α, m* := max_k m_k ≤ M(A) because any single bin is a valid [t,2t] window (taking t = left endpoint of the bin; then 2·min(B_k) ≥ 2·2^{k+α} ≥ 2^{k+α+1} > every element of B_k).\n\nUpper bounds on the best possible C (via constructions)\n- Warm-up: geometric progression with ratio 2. Let A = {1, 2, 4, …, 2^{n-1}}. Any [t, 2t] contains at most 2 elements, so M(A) ≤ 2. Compute S = 2^n − 1, Q = (4^n − 1)/3, hence P(A) = S^2/Q → 3 as n→∞. Thus for this family, |A'|/P(A) ≤ 2/3. Hence C ≤ 2/3.\n- Sharp obstruction giving C ≤ 1/3. Fix integers L ≥ 1 and M ≥ 1 and pick r > 2 (take r = 2 + ε with small ε). Let values be v_j = r^j (j = 0,…,L−1), and include exactly M copies of each v_j. Then any [t, 2t] can capture elements from at most one “scale,” since v_{j+1} = r v_j > 2 v_j. Hence M(A) = M. Direct computation: S = M ∑_{j=0}^{L−1} r^j, Q = M ∑_{j=0}^{L−1} r^{2j}, so P(A) = S^2/Q = M · ( (∑ r^j)^2 / ∑ r^{2j} ). As L → ∞, (∑ r^j)^2 / ∑ r^{2j} → (r+1)/(r−1). Taking r ↓ 2 gives P(A) ≥ (3 − o(1)) M. Thus |A'|/P(A) ≤ 1/(3 − o(1)), so any universal C cannot exceed 1/3. Therefore C ≤ 1/3 is a sharp upper bound candidate.\n\nA rigorous lower bound C ≥ 3/14\nWe prove a universal inequality P(A) ≤ (14/3) M(A), i.e., S^2 ≤ (14/3) M(A) Q. This yields |A'| ≥ (3/14) P(A) for some A' with max ≤ 2 min.\n- Fix an arbitrary shift α ∈ [0,1) and bins I_k(α). With notation above, m* := max_k m_k ≤ M(A). We will show S^2 ≤ (14/3) m* Q. Since this holds for every α, it also holds with m* replaced by M(A).\n- Key ratio bound between bins. For k < ℓ and any a ∈ B_k, b ∈ B_ℓ we have a ≤ 2^{k+α+1} and b ≥ 2^{ℓ+α}, hence b/a ≥ 2^{ℓ−k−1}. Therefore, for d := ℓ−k ≥ 2 we have 2ab ≤ 2 · b^2 / 2^{d−1} = 2^{2−d} b^2.\n- Split indices into two parity classes: even and odd. Write S_even = ∑_{k even} s_k and S_odd analogously. Then S = S_even + S_odd and S^2 ≤ 2(S_even^2 + S_odd^2) by Cauchy-Schwarz.\n- Bound within one parity class (say even). First, same-bin terms: ∑_{k even} s_k^2 ≤ ∑_{k even} m_k q_k ≤ m* ∑_{k even} q_k.\n  Next, cross-bin terms: For fixed ℓ even, by the ratio bound and summing over even k ≤ ℓ−2,\n  2 ∑_{k even, k≤ℓ−2} s_k s_ℓ ≤ q_ℓ · ∑_{m≥1} 2^{2−2m} m_{ℓ−2m} ≤ (4/3) m* q_ℓ,\n  since ∑_{m≥1} 2^{2−2m} = 4 × ∑_{m≥1} 4^{−m} = 4 × (1/3) = 4/3. Summing over ℓ even gives\n  2 ∑_{k<ℓ, both even} s_k s_ℓ ≤ (4/3) m* ∑_{ℓ even} q_ℓ.\n  Therefore S_even^2 ≤ (1 + 4/3) m* ∑_{k even} q_k = (7/3) m* ∑_{k even} q_k.\n- The same estimate holds for odd indices. Summing and using S^2 ≤ 2(S_even^2+S_odd^2) yields\n  S^2 ≤ 2 · (7/3) m* (∑_{k even} q_k + ∑_{k odd} q_k) = (14/3) m* Q.\n- Since m* ≤ M(A), it follows that P(A) = S^2/Q ≤ (14/3) M(A). Taking A' as a bin achieving M(A) gives |A'| ≥ (3/14) P(A). This proves a universal lower bound C ≥ 3/14 ≈ 0.214286.\n\nExamples and sanity checks\n- Equal numbers: A = {1,1,…,1} (n times). Then M(A) = n, P(A) = n; any [t,2t] capturing all n works. Our bound |A'| ≥ (3/14) P gives |A'| ≥ (3/14) n, which is true but far from sharp.\n- Powers of 2: A = {1,2,4,8}. S=15, Q=85, P≈2.647. The guarantee |A'| ≥ (3/14)P ≈ 0.567 ensures at least 1 element; the true optimum is 2.\n- Two-per-scale, r slightly bigger than 2: M(A)=2, while P can be made arbitrarily close to 6; our general bound guarantees |A'| ≥ (3/14)P ≈ 1.285, i.e., at least 2 elements, which matches the true maximum 2. The obstruction shows we cannot hope for C>1/3 globally.\n\nWhy the 1/3 lower bound looks plausible (but currently unproven here)\n- Heuristic: For sets composed of M-per-scale blocks separated by r>2, P equals M times (r+1)/(r−1) in the large-scale limit and is maximized near r↓2, giving P ≈ 3M. This suggests the sharp inequality P ≤ 3 M(A) might hold in full generality. Our proof above yields P ≤ (14/3) M(A); improving the constants in the cross-bin estimates (or using a different structural argument) could potentially push the factor down to 3.\n- Potential analytic angle: recast A as atoms on log-scale and use a Carleson embedding–type inequality for the operator f ↦ averages over multiplicative intervals of length log 2; the “Carleson constant” of the family is controlled by M(A). This perspective might be able to deliver the optimal constant 3.\n\nObstacles in tightening 14/3 → 3\n- Our proof uses a parity split and crude geometric-decay bounds 2ab ≤ 2^{2−d} b^2. These bounds are loose near d=1 (adjacent bins), so we avoided adjacent interactions by the parity split, but the decay sum over d even (≥2) still totals 4/3. Using 3-way splits gives decay sum 4/7 per class but requires a factor 3 outside, leading to a slightly worse net constant (33/7 ≈ 4.714). The 2-way split currently gives the best constant from this scheme (14/3 ≈ 4.667).\n- Any method summing cross-bin terms asymmetrically (to avoid double counting) still pays the decay series ∑ 2^{2−2m} = 4/3 in the parity split. Reducing this effectively seems to require a different decomposition or a more refined inequality exploiting the actual distribution of masses s_k and q_k.\n\nNext steps\n- Targeted improvement: Seek an inequality of the form (∑ s_k)^2 ≤ 3 M ∑ q_k by (i) a refined binning with nonuniform coloring/weights minimizing the effective decay sum, or (ii) an embedding estimate that bounds ∑_k s_k^2 plus carefully weighted neighbor interactions by M ∑ q_k with the sharp constant.\n- Explore Carleson embedding on the multiplicative line. The intervals [t,2t] form a 1-parameter family; the measure generated by A induces a Carleson measure with Carleson constant comparable to M(A). Prove a sharp L^1–L^2 embedding from this.\n- Try a probabilistic shift argument with weighted bins: choose α uniformly, set m*(α) = max_k m_k(α). Show E[m*(α)] ≥ c P for c close to 1/3, then deduce existence of a good α. The technical heart is to lower bound E[∑ s_k(α)^2] in terms of S^2 with a universal constant; earlier counterexamples show this cannot hold in full generality unweighted, but a conditional lower bound after trimming large scales may still work.\n- Attempt tightness: Prove that for any A, P ≤ 3 M(A). If true, this establishes optimal C=1/3. If false, produce a counterexample where P/M(A) > 3.\n\nNotes about output.md\n- No output.md was provided in this round. I cannot audit prior proofs for gaps. The results above (upper bound C ≤ 1/3 via explicit construction; lower bound C ≥ 3/14 via bin-parity argument) are self-contained and rigorously justified within these notes."
}