{
  "content": "Ideas\n- Work within the permutation template f_i(π)=π(i) on E⊆S_k, F=[k]. Then the conflict graph G is complete on E, so the least number of parts equals |E|. Thus the task reduces to maximizing |E| while enforcing the fibre constraint “for every z, ∃ t with |f_t^{-1}(z)| ≤ n”.\n- Provide (i) a sharp upper bound for |E| when the “witness” indices t(z) form a transversal (which they always can); (ii) extremal constructions meeting this bound, yielding factorial-sized counterexamples at n=1; (iii) a robust “many small fibres per z” variant using van der Waerden’s permanent bound.\n\nLemma 1 (Completeness in the permutation template)\nLet k≥2, take F=[k], and define f_i(π)=π(i) for π∈S_k. For any E⊆S_k, the conflict graph G on E (xy adjacent iff ∃ p≠q with f_p(x)=f_q(y)) is complete.\nProof. For π≠σ choose s with π^{-1}(s)≠σ^{-1}(s). Then f_{π^{-1}(s)}(π)=s=f_{σ^{-1}(s)}(σ) with distinct indices.\nWhy useful: The number of parts equals χ(G)=|E|.\n\nProposition 2 (Sharp upper bound under a fixed transversal; optimality of D_k+kn)\nFix a bijection τ:[k]→[k], and a set E⊆S_k satisfying, for all z∈[k], the count C_z:=|{π∈E: π(τ(z))=z}| ≤ n. Then\n|E| ≤ D_k + kn,\nwhere D_k is the number of derangements on [k]. Moreover, equality holds for E=D_k ∪ (⋃_{z} A_z), where each A_z consists of n permutations that fix z and no other point (relative to τ).\nProof. Split E=A∪B where A consists of π avoiding all “transversal” cells (τ(z),z) (so |A|≤D_k), and B the rest. Define S:=∑_{z} C_z ≤ kn. Every π∈B hits at least one transversal cell, contributing ≥1 to S. Hence |B|≤S≤kn, giving |E|≤D_k+kn. For equality, take all derangements (|A|=D_k) and for each z pick n permutations with exactly one fixed point at (τ(z),z) (exist since there are D_{k-1} choices), so C_z=n and every π∈B is assigned to its unique z.\nWhy useful: Within the permutation template the optimal |E| under the hypothesis is exactly D_k+kn.\n\nCorollary 3 (Tight factorial counterexample at n=1)\nTake τ=id. Let E:=D_k ∪ {π^z: z∈[k]}, where each π^z has exactly one fixed point z. Then the hypothesis holds with n=1 (for each z choose t=z), χ(G)=|E|=D_k+k, and by Lemma 1 the conflict graph is complete. Since D_k∼e^{-1}k!, this gives a K_{D_k+k} instance with n=1.\nSmall cases: k=3 gives |E|=5>2·1+1, a K_5; k=4 gives |E|=9+4=13>3.\n\nTheorem 4 (Any linear bound χ≤c(k)·n* must have c(k)≥D_k+k∼e^{-1}k!)\nLet c(k) be such that every instance with k functions satisfies χ(G)≤c(k)·n*. Apply it to Corollary 3. There n*=1 and χ(G)=D_k+k, hence c(k)≥D_k+k. In particular, no bound with c(k) subfactorial (e.g. polynomial) can hold.\nWhy useful: This strictly strengthens the linear lower bound c(k)≥k (from the k!/ (k−1)! example) to c(k)≥Θ(k!).\n\nProposition 5 (Many small fibres per z; robust factorial core)\nFix integers k≥2 and r with 1≤r≤k. Choose permutations σ_1,…,σ_r of [k] and consider the “forbidden board” B=⋃_{j=1}^r{(i,σ_j(i))}. Let E_0(r):={π∈S_k : π(i)≠σ_j(i) for all i and j} be the permutations avoiding all r matchings. Then\n|E_0(r)| = per(A) ≥ ((k−r)/k)^k k! = ((1−r/k)^k) k!,\nwhere A is the 0–1 allowed matrix (complement of B). Moreover, in the permutation template the conflict graph on E_0(r) is complete, and for every z there are at least r indices t with |f_t^{-1}(z)|=0. Thus the “≥r small fibres per z” variant (with n=1) admits instances with χ(G)≥((1−r/k)^k)k!≈e^{−r}k!.\nProof. The matrix A has all row/column sums t=k−r. Normalize B:=A/t to obtain a doubly-stochastic matrix. By Egorychev–Falikman (van der Waerden), per(B)≥k!/k^k, hence per(A)=t^k per(B)≥((k−r)/k)^k k!. Completeness follows from Lemma 1; the fibre claim is immediate by construction.\nWhy useful: Shows failure persists and is factorial even under a stronger assumption that each z has ≥r small fibres (here equal to 0) at n=1.\n\nRemark 6 (Pinned completions through a prescribed forbidden cell)\nFix a forbidden cell (i_0,z_0) from some σ_j. The number of π with π(i_0)=z_0 and π avoiding all other forbidden cells is at least\n((k−r−1)/(k−1))^{k−1} (k−1)!,\nsince after fixing π(i_0)=z_0 and deleting row i_0 and column z_0, the residual (k−1)×(k−1) allowed matrix has all row/column sums equal to k−r−1; apply van der Waerden as above. This yields many distinct “pinned” permutations if one wishes to realize small fibres with value 1 instead of 0.\n\nExamples\n- k=3, n=1: E=D_3∪{(12),(13),(23)} has |E|=5 and G=K_5.\n- k arbitrary, n=1: E=D_k∪{one single-fixed permutation per z} has |E|=D_k+k∼e^{-1}k!.\n- r≥1 variant: For fixed r, E_0(r) alone (with n=1) has |E|≥(e^{−r}+o(1))k! and G complete.\n\nObstacles and cautions\n- The upper bound |E|≤D_k+kn crucially uses that the “witness indices” t(z) define a transversal of cells (i.e., one cell per column, in distinct rows). This is exactly the statement of the hypothesis (choosing a single t(z) per z globally). Without fixing a transversal, the counting argument must be rephrased, but the same reasoning applies once the witness choice is made.\n- For the r≥2 “pinned completion” counts, the reduced matrix is not regular unless we delete the row/column of the pinned cell; the stated bound handles this correctly. Selecting distinct pinned permutations for all (z,j) simultaneously is unnecessary for our purposes (E_0(r) already gives factorial size), so we omit SDR details.\n\nNext steps\n- Record the proof of Proposition 2 and Theorem 4 into proofs.md; these give an essentially tight extremal picture within the permutation template for fixed n.\n- For the r≥1 variant, add the van der Waerden-based bound rigorously (Proposition 5) and the “pinned completion” bound (Remark 6) via permanents of reduced matrices.\n- Explore maximal |E| under extra regularity: e.g., each f_i surjective (projective-plane template gives |E|≈k^2 at n=1; can one exceed quadratic?), and quantify tight upper bounds in that regime.\n"
}