{
  "progress_md": "Round 0004 — tightening gadgets to a DP-checkable spec (radius 1, β-normalized)\n\nContext and goal\n- We continue the NEXPTIME-hardness reduction from Succinct 3-Coloring to Feasible-Function Existence (F1) for β-normalized, radius-1 LCLs on oriented paths. The key deliverables now are (i) explicit, radius-1 local rules for a per-bit boundary probe that separates 2^B canonical left/right vertex types; (ii) explicit per-side color gating and mixed-pair acceptance; (iii) a seam tableau interface with local inequality/equality checks; (iv) concrete alphabet counting compatible with β = poly(s); and (v) a B=2 sanity instance blueprint.\n\nMinor gaps noted in output.md (no edits made)\n- Types vs fixed interior inputs. Definitions allow both “interior inputs arbitrary” and “fixed by the instance”; the hardness uses the latter. It would help to emphasize that Type(w) is computed w.r.t. the fixed interior input string of w.\n- Context set size. When later we use contexts realized by w_1 S w_2 with |w_i| ∈ {ℓ_pump, ℓ_pump+1}, it would be useful to remark explicitly that |C| ≤ |T| = ℓ_pump.\n\nA. Explicit probe gadget (Type-Separation Lemma, radius-1, DP-checkable)\nParameters and layout\n- B = s^{c0}. Fix β = s^{c1} with c1 ≥ 2c0 to give O(B^2) room in the adjacency table (C_out–out), while keeping |Σ_out| = β = poly(s).\n- Canonical left block W_L(u) adjacent to S (right of S) contains, in order: HEAD_C (constant size), a Corridor prefix (constant size), and the PORT zone of length B, followed by neutral PAD. PORT cell t (1 ≤ t ≤ B) statically carries Addr=t and RidBit=u_t on its output symbol; Cin–out ties RidBit to the input bit at that node.\n- Reserved boundary-output 4-tuples {Q_j: j ∈ [B]}. Q_j means: at the two leftmost boundary nodes put tokens BL1_j, BL2_j; at the two rightmost boundary nodes tokens BR2_j, BR1_j (these four come from disjoint reserved subalphabets). Under any other 4-tuple we are in “non-probe” mode.\n- Probe corridor states: For each j ∈ [B], we have Head_j and Accept_j. In non-probe mode these symbols are not permitted anywhere. In probe mode (only if Q_j is used), they are the only non-PAD symbols allowed before the PORT zone; ERR/⊥ are explicitly forbidden adjacent to any Head_j/Accept_j.\n\nAllowed C_out–out pairs (schema; all others are disallowed)\n- Probe start at boundary:\n  • (BL1_j, BL2_j) and (BL2_j, Head_j). This forces the first interior cell after the second boundary node to be Head_j when Q_j is used.\n- Corridor propagation up to PORT[1]:\n  • Head_j must continue deterministically: (Head_j, Head_j) on each corridor edge until the first PORT cell. No other successor is permitted from Head_j (disables ERR/⊥ escape).\n- Entering the PORT zone (key test). Let Port(k,b) denote the output symbol of the k-th PORT cell when “probe-active”; we use a distinct “probe variant” for PORT cells (Port^P) so the grammar can react to probe mode without interfering with the non-probe alphabet.\n  • From the corridor into Port^P(k,b): allow (Head_j, Port^P(k,b)) for all j,k and b∈{0,1}.\n  • From Port^P(k,b) to the next interior cell:\n    - If k ≠ j: require continuation of the probe head: (Port^P(k,b), Head_j). (For all pairs (j,k) with k≠j; total O(B^2) entries.)\n    - If k = j and b = 1: allow termination: (Port^P(j,1), Accept_j).\n    - If k = j and b = 0: no outgoing pair is allowed (this creates a dead end, rejecting the boundary assignment Q_j).\n- Accept sink and padding:\n  • (Accept_j, PAD) and then PAD self-loops (neutral plumbing) to the end of the block. No ERR near Accept_j is permitted.\n- Non-probe discipline:\n  • If the boundary outputs are not Q_j, then Head_j and Accept_j are not allowed anywhere; the PORT cells use their non-probe variants Port^I(k,b) with standard PAD plumbing. All error-chain symbols are available in non-probe mode (as in the reference), ensuring malformed interiors never constrain f.\n\nClaim TS (Type-Separation). Fix a boundary-input 4-tuple a⋆. For any canonical W_L(u), under boundary outputs Q_j we have E_{W_L(u)}(a⋆)[Q_j] = 1 if and only if u_j = 1. Hence the bit-vector (E(a⋆)[Q_j])_{j=1..B} equals u, which separates 2^B distinct left-context types; symmetric right-contexts are constructed analogously.\n- Why: Under Q_j the only legal continuation from BL2_j is Head_j (unique path). Head_j must propagate to Port^P(1, u_1), then to Head_j, then Port^P(2, u_2), etc. When it reaches Port^P(j, u_j), it has an outgoing edge only if u_j=1 (Accept_j). Thus extendibility equals u_j.\n- Radius-1 and budgeting: All checks are nearest-neighbor pairs. Alphabet uses O(B) symbols for {Head_j, Accept_j} and O(B) probe variants of PORT; the O(B^2) combinatorics appears only in the adjacency table (pairs (Head_j, Port^P(k,·)) and (Port^P(k,·), Head_j)), which is acceptable since C_out–out has β^2 entries and β = s^{c1} with c1 ≥ 2c0.\n- No error escape: Head_j and Accept_j have no allowed neighbors other than those listed; in particular there are no pairs with ERR or ⊥ adjacent to Head_j/Accept_j, so reserved probes are deterministic.\n\nB. Per-side color gating and mixed pairs\nSymbols near S (two nodes S1 and S2): SColor ∈ {R,G,B,⊥} is the only choice f makes at S nodes. All handshake bits are attached to interior neighbors, not to S.\n- Gate tokens on the interiors: The immediate neighbor on the left side of S is either GateL (present only in canonical W_L(u) at a fixed offset) or ¬GateL (any other symbol). Symmetrically, the immediate neighbor on the right side of S is GateR in canonical W_R(v) or ¬GateR otherwise. These are enforced by the constant-size grammar of HEAD/PORT/PAD adjacent to S.\n- Per-side gating (local, radius-1):\n  • If the neighbor is ¬GateL (resp. ¬GateR), then only ⊥ is allowed at S on that side; any non-⊥ color at S has no legal neighbor pair and dead-ends.\n  • If the neighbor is GateL (resp. GateR), then S may be labeled R,G,B or ⊥.\n- Seam activation and must-color:\n  • The bridge wb∘wc is “active” only if both sides are canonical, i.e., the two interior neighbors are GateL and GateR and both S nodes are non-⊥. This is encoded by allowing a special ActiveBridgeStart symbol adjacent to S only under the pairs (GateL, S∈{R,G,B}) and (S∈{R,G,B}, GateR) simultaneously. When ActiveBridgeStart appears on both sides, the interior between S1 and S2 must be labeled by the RUN_B corridor (see §C). In this active-active case, ⊥ at either S is forbidden (no pair with ActiveBridgeStart), implementing “must color” only when both sides are canonical.\n  • Mixed pairs (exactly one side canonical): No ActiveBridgeStart is produced (since one side fails the gate), so RUN_B is not enabled. The interior wb∘wc is filled by neutral PAD and accepts unconditionally. This ensures that mapping inactive types to ⊥ and coloring canonical types does not produce (F1) violations on mixed pairs.\n  • Inactive pairs (neither side canonical): Both S nodes must be ⊥; PAD fills the bridge; accept.\n\nC. Seam tableau and local acceptance (EDGE and Eq)\nCorridor and inputs\n- In the active-active case, between S1 and S2 we lay a fixed-width RUN_B corridor that statically encodes a row-by-row tableau of a fixed universal machine U. U runs in poly(s) steps to compute:\n  • EDGE := D(u,v) ∈ {0,1} and Eq := [u=v] ∈ {0,1}, reading u and v from the two PORT zones adjacent to S (u from W_L(u) and v from W_R(v)). As is standard, the row transitions of U are enforced by local C_out–out pairs across row separators; malformed rows have no accepting continuation and cannot appear in the active mode (ERR is disabled adjacent to RUN_B states).\n  • Forwarding of S1Color: The first corridor cell to the right of S1 captures the color at S1; this “forwarded color” is then carried unchanged (checked by nearest-neighbor equalities) to a designated verdict cell V next to S2.\nVerdict cell and local gate (radius-1)\n- The verdict cell V (the immediate right neighbor of S2) carries a symbol Ver(EDGE, Eq, FwdColor) in a constant-size set (there are 2×2×3 ≤ 12 possibilities). The only allowed pairs between S2 and V enforce:\n  • If EDGE=1, then Color(S2) ≠ FwdColor.\n  • If Eq=1, then Color(S2) = FwdColor.\n  • If EDGE=0 and Eq=0, allow all 3×3 color pairs.\n- This implements “accept iff (EDGE=0 or colors differ) and (Eq=0 or colors equal)” purely locally between S2 and its neighbor V. Note ERR is forbidden adjacent to RUN_B states and V in active mode.\n- Graphs without loops: To avoid contradictory (EDGE=1 and Eq=1) on diagonals, we assume D(u,u)=0; if needed, pre-process the succinct circuit to zero the diagonal (standard and w.l.o.g. for 3-colorability).\n\nD. Budget and radius bookkeeping (explicit)\n- Disjoint-role alphabets: We partition Σ_out into disjoint subalphabets per role/phase (HEAD/PORT/PAD/ERR/PROBE/RUN_B/S, etc.), so sizes add rather than multiply.\n- Symbol counts (dominant terms):\n  • PORT symbols: O(B) (Port^I(k,b) in idle mode and Port^P(k,b) in probe mode; constant factor 2×2 per k).\n  • Probe heads: O(B) symbols {Head_j, Accept_j}.\n  • Boundary tokens for Q_j: O(B) (the four boundary positions use disjoint constant-size families per j; total O(B)).\n  • RUN_B and HEAD/PAD/ERR: O(1) each (fixed universal TM alphabet and error-chain tokens as in the reference).\n  • S colors: {R,G,B,⊥} (4 symbols restricted to the two S positions by role).\n- Adjacency table size: The probe needs O(B^2) distinct allowed pairs ((Head_j, Port^P(k,·)) and (Port^P(k,·), Head_j)), which fits within the β×β table since β = s^{c1} with c1 ≥ 2c0; the rest are O(β) pairs per role. All interactions are radius-1.\n\nE. B=2 sanity instance blueprint (DP-ready)\n- Fix B=2. Port^I(k,b), Port^P(k,b) for k∈{1,2}, b∈{0,1}. Head_1, Head_2, Accept_1, Accept_2. Q_1 and Q_2 families each with four boundary tokens. S colors {R,G,B,⊥}. GateL/GateR. RUN_B row alphabet (constant-size), and verdict states Ver(e,q,c) with e,q∈{0,1}, c∈{R,G,B}.\n- Probe rules instantiate the schema:\n  • (BL1_1, BL2_1), (BL2_1, Head_1), Head_1 propagations, (Head_1, Port^P(1,b)), (Port^P(1,1), Accept_1), (Port^P(1,0), ·) has no successor, (Head_1, Port^P(2,b)), (Port^P(2,b), Head_1).\n  • Similarly for j=2 with indices swapped.\n- Canonical W_L(u) with u∈{00,01,10,11}: PORT^I(1,u_1), PORT^I(2,u_2) adjacent to S, with HEAD_C before them. The DP on the 4-node boundary assigns Q_1 or Q_2 and checks that E[Q_1]=u_1, E[Q_2]=u_2.\n- Seam: For a toy D (say, the 4-cycle on {00,01,10,11}), RUN_B emits Ver(EDGE,Eq,FwdColor), and the S2–Ver adjacency forbids equal colors iff EDGE=1 and requires equality if Eq=1. Mixed pairs accept via PAD.\n\nF. Soundness/completeness checks (sketch, unchanged in spirit)\n- Completeness: Given a 3-coloring χ of the succinct graph, set f(τ^L_u)=χ(u), f(τ^R_v)=χ(v), f(others)=⊥. Active-active pairs accept because RUN_B computes EDGE and Eq correctly and the local gate enforces χ(u)≠χ(v) when EDGE=1 and χ(u)=χ(v) when Eq=1; mixed/inactive pairs accept via PAD and gating.\n- Soundness: Any feasible f must map non-canonical types to ⊥ and assign colors to canonical types (by gating/must-color). Then χ(u):=f(τ^L_u) is well-defined (Eq-gate across (L(u),R(u)) forces consistency), and for any edge D(u,v)=1, the (L(u),R(v)) pair is extendible only if colors differ, so χ is a proper 3-coloring.\n\nG. Outstanding items and why they matter\n- Existence/normalization of canonical contexts at lengths ℓ_pump or ℓ_pump+1: We continue to rely on pumping/replacement (Lemmas 10–12, 14–15 from the reference) to ensure that HEAD_C+PORT+PAD blocks occur adjacent to S at the required lengths. Alternatively, we could present an explicit “two-length padding” construction; until then, keep this as an assumption tied to the standard lemmas.\n- DP regression (B=2): Assemble a machine-readable instance listing Cin–out and Cout–out per the schemas above; verify by the O(kβ^2) DP (i) probe separation; (ii) seam acceptance behavior on all 16 ordered pairs (L(u),R(v)).\n\nWhy this round is substantive progress\n- We turned the probe and seam gadgets into explicit radius-1 adjacency schemas that the verifier can implement and test: (i) deterministic per-bit probe with no error escape and extendibility exactly u_j; (ii) per-side gating with mixed pairs accepting unconditionally; (iii) active seam with local EDGE/Eq gate adjacent to S2. Budgeting and radius-1 checks are laid out; the B=2 instance is specified concretely enough to build the DP.\n\nNext steps (auditable deliverables)\n1) Produce the explicit C_out–out table fragment (parameterized by B) for the probe schema: list all (Head_j, Port^P(k,b)) and (Port^P(k,b), Head_j) pairs, the start/accept edges, and the disallowed ERR/⊥ adjacencies in probe mode. Provide the Cin–out rule tying Port(k,b).RidBit to Σ_in.\n2) Formalize the GateL/GateR placement around S (constant-size patterns) and the exact pairs that enable ActiveBridgeStart only when both sides are canonical and S colors are non-⊥.\n3) Fix the RUN_B row alphabet and transitions for a concrete U; specify the verdict cell placement and the allowed/forbidden S2–Ver pairs for all (EDGE,Eq,FwdColor) and S2 colors.\n4) Build and share the B=2 tables and a small D (4-cycle) for the verifier’s DP harness; check probe separation and seam behavior thoroughly.\n5) (Optional) Add a short proof of the replacement/padding lemma specialized to r=1 into output.md so canonical contexts at lengths ℓ_pump or ℓ_pump+1 are guaranteed without appealing externally.\n"
}