{
  "progress_md": "Status and aim\n- Objective: make the NEXPTIME-hardness reduction auditable by pinning down three radius-1 gadgets with explicit, testable behavior: (i) a per-bit boundary-probe family {Q_j} that injectively separates 2^B vertex indices into distinct context types; (ii) per-side color gating and seam activation that keep mixed pairs vacuous and enforce “must color” only when both sides are canonical; (iii) a seam tableau that computes EDGE := D(u,v) and Eq := [u=v] and enforces local acceptance (EDGE=0 or colors differ) ∧ (Eq=0 or colors equal).\n\nGaps or clarifications in output.md (to log, not to edit now)\n- Fixed inputs in types: Definitions state “interior inputs may be arbitrary; if the model fixes interior inputs, the definition is with respect to those fixed inputs.” Our reduction uses fixed interior inputs to encode indices/C. Suggest adding a sentence clarifying that Type(w) is computed with respect to the fixed input string of w, which is the instance’s input.\n- Context set size and construction: It would be useful to state explicitly that the context set C consists of types realized by words of the form w_1 S w_2 with |w_i| ∈ {ℓ_pump, ℓ_pump+1}, hence |C| ≤ ℓ_pump. Also note (or later prove) how pumping/replacement ensures the existence of canonical contexts with prescribed lengths.\n\nLemma TS — Per-bit boundary probe (radius 1, deterministic, no error-escape)\n- Statement. There exist: (a) a fixed boundary-input tuple a⋆ ∈ Σ_in^4; (b) B distinct reserved boundary-output 4-tuples Q_1,…,Q_B; (c) an output-track layout with Role ∈ {HEAD, PORT, RUN, PAD, PROBE, ERR}, an address subtrack Addr ∈ {1,…,B}, and a data subtrack RIDbit ∈ {0,1} tied to Σ_in by Cin–out when Role=PORT; (d) probe-head states Start_j, Head_j, Test_j, Acc_j for each j; such that for each canonical left block L(u) exposing a well-formed B-cell PORT zone with Addr=1,…,B and RIDbit spelling u ∈ {0,1}^B adjacent to S, we have for all j∈[B]:\n  E_{L(u)}(a⋆)[Q_j] = u_j.\n  Hence u≠u′ ⇒ Type(L(u))≠Type(L(u′)). A symmetric construction yields 2^B distinct right-types.\n- Rule discipline (sketch sufficient for DP audit):\n  • Under Q_j the only legal Cout–out pairs from the left boundary enter PROBE mode with Start_j, then deterministically propagate Head_j one step per edge along a predeclared probe-corridor; ERR/⊥ pairs are disallowed when any PROBE state is present.\n  • Along Head_j: if current Role≠PORT, the unique successor keeps moving; if Role=PORT with Addr≠j, keep moving; if Role=PORT with Addr=j, the only successor is Test_j.\n  • At Test_j: allow transition to Acc_j iff RIDbit=1; otherwise no successor exists (dead-end).\n  • Acc_j locally splices into PAD and disables all alternative branches.\n- Why this yields E= u_j: Q_j triggers a unique run; it reaches exactly the unique PORT cell with Addr=j; Cin–out forces RIDbit to equal the node’s input bit; hence continuation exists iff u_j=1. No error-escape is available in PROBE mode.\n- Alphabet budget: O(1) for roles/phases, O(B) for Addr values, O(B) for {Start_j,Head_j,Test_j,Acc_j}, plus O(1) for PAD/ERR; feasible with β ≥ c·B.\n\nLemma CG — Per-side color gating and seam activation\n- Statement. There exist handshake markers GateL, GateR emitted near S if and only if the adjacent interior begins with a well-formed canonical vertex header (HEAD+PORT at fixed offsets). Local rules ensure:\n  • Color-permission at S_i (i∈{1,2}) is per-side: S_i may carry Color ∈ {RED,GRN,BLU} iff Gate on that side is present; else the only allowed token is ⊥.\n  • Active seam mode is enabled only if both GateL and GateR are present (active-active). In active-active, we enforce “must color”: both S nodes must be non-⊥. In mixed pairs (exactly one Gate present), the seam remains inactive and accepts unconditionally (the inactive side is ⊥ by gating). In inactive-inactive, both sides are ⊥ and accept.\n- Why useful. It prevents mixed pairs from constraining f and restricts non-⊥ colors to canonical vertex contexts only, so f must color only τ^L_u, τ^R_v and map all others to ⊥.\n\nLemma Seam — Tableau for D(u,v) and Eq(u,v) with local gates\n- Statement. There is a fixed-width RUN corridor across the bridge wb∘wc that simulates a universal TM U for poly(s) steps, reading enc(D) from HEAD and the port bits u (from left PORT) and v (from right PORT), and computing two verdict bits: EDGE := D(u,v) and Eq := [u=v]. The last tableau row writes, in the unique cell immediately to the right of S2, a triple (EDGE, Eq, FwdCol), where FwdCol is a copy of Color(S1). Local rules between S2 and this neighbor enforce all of:\n  (A) EDGE=1 implies Color(S2) ≠ FwdCol; if EDGE=0 both equal/unequal are allowed.\n  (B) Eq=1 implies Color(S2) = FwdCol; if Eq=0 both equal/unequal are allowed.\n  Coupled with CG’s “must color” in active-active, this yields acceptance iff (EDGE=0 or colors differ) and (Eq=0 or colors equal).\n- Robustness: In active mode, ERR symbols are disallowed adjacent to RUN states; malformed tableaux have no accepting continuation. Outside active mode (i.e., mixed or inactive), neutral ⊥-plumbing is available, so those pairs accept vacuously.\n\nPadding to prescribed lengths (existence of canonical contexts)\n- Claim. For each u∈{0,1}^B there exists at least one left word w_1 of length in {ℓ_pump, ℓ_pump+1} whose suffix adjacent to S is a canonical W_L(u); similarly for right contexts. Proof sketch: Build a seed left word as P^z · W_L(u) with padding P outside the HEAD/PORT/RUN header. By Lemma 15 (pumping), choose z so that Type(P^z) stabilizes and the total length hits ℓ_pump or ℓ_pump+1. By Lemma 12 (type composition), replacing P^z by any P^{z′} of the same type preserves Type(P^z · W_L(u)); since we pump only in PAD outside the seam, the near-S structure and the probe/seam interfaces are unaffected. Symmetrically for the right side.\n\nSoundness/completeness (recap with Eq)\n- Completeness: Given a proper 3-coloring χ, set f(τ^L_u)=χ(u) and f(τ^R_v)=χ(v), ⊥ elsewhere. Active-active bridges accept by Lemma Seam (Eq forces same color on (u,u), EDGE forces inequality on edges; non-edges are vacuous). Mixed/inactive pairs accept via CG.\n- Soundness: If f satisfies (F1), define χ(u):=f(τ^L_u). Pairing (τ^L_u,τ^R_u) is active-active with Eq=1, so colors must match; pairing (τ^L_u,τ^R_v) for any edge has EDGE=1, so colors must differ. Hence χ is a proper 3-coloring.\n\nAlphabet/radius budget (concrete)\n- Tracks: roles/phases O(1), colors+⊥ (4), ERR O(1), RUN alphabet O(1), Addr values O(B), probe heads and reserved boundary outputs O(B). Total |Σ_out| ≤ c_0 + c_1·B for fixed constants, so choose β ≥ c·B. All checks are radius-1: probe steps, RUN row transitions, per-side gating, and the S2–neighbor acceptance gates.\n\nDP-auditable B=2 sanity plan\n- Build four left seeds L(00), L(01), L(10), L(11) and four right seeds; reserve Q_1,Q_2; fix a⋆. Verify by the O(kβ^2) DP that E_{L(u)}(a⋆)[Q_1,Q_2]=(u_1,u_2). Implement a tiny U that sets EDGE for a 4-cycle and Eq via bitwise equality. Check all 16 ordered pairs (L(u),R(v)): accept iff (u=v ⇒ colors equal) and (u,v edge ⇒ colors differ). Mixed pairs (e.g., L(u) with a non-canonical right) accept regardless.\n\nPotential pitfalls and how we address them\n- Alternative completions under probes: explicitly forbid ERR/⊥ and any non-probe successors when a PROBE state is active.\n- Mixed-pair dead-ends: avoided by per-side gating and late seam activation; only active-active enforces “must color”.\n- S-token control: f controls only the color/⊥ choice at S; all other S subtracks (handshake bits) are fixed by local adjacencies.\n- Length normalization dependence: we only need existence of at least one canonical context per u at lengths in {ℓ_pump, ℓ_pump+1}; pumping/replacement provides this without changing near-S behavior.\n\nNext steps (explicit, auditable)\n1) Write the parametrized probe-rule schema: enumerate allowed Cout–out pairs for Start_j,Head_j,Test_j,Acc_j and the prohibition of ERR/⊥ adjacent to any PROBE state; list Cin–out constraints tying RIDbit to Σ_in whenever Role=PORT.\n2) Specify the per-side handshake tokens near S and the exact Cout–out conditions that (i) enable colors per-side; (ii) activate the seam only if both handshakes present; (iii) enforce “must color” only then; and (iv) make mixed pairs accept unconditionally.\n3) Give the seam tableau’s final-cell interface: define the neighboring cell’s states that encode (EDGE,Eq,FwdCol) and the constant-size forbidden/allowed pairs with S2 realizing (A) and (B).\n4) Produce a B=2 instance (explicit symbol names and tables) and run the O(kβ^2) DP to validate: probe bits, mixed-pair vacuity, and active-active acceptance policy.\n5) Add a short clarification to output.md (later): fixed-interior-input interpretation of Type(w) and a one-line bound |C| ≤ ℓ_pump; defer full hardness write-up until the three gadgets are tabled and DP-tested."
}