{
  "summary_md": "This round constructs a radius-1, type-local seam gadget split into two S-nodes (S1 on the variable side, S2 on the clause side) with explicit out–out edge tables at the left, central and right seams. The tables (i) forbid ⊥ at active seams, (ii) allow EqStart/NeqStart only when both sides offer, and (iii) enforce mutual exclusion and sign-gating of CAP/PAD. Equality/inequality certificates are implemented with pointer-integrity: RIDbits + HotRID on the variable side, Selected + ip_bits + sign on the clause side, and per-bit cursor tokens (EqL/EqR, NeqPick/NeqCheck). A radius-1 exclusivity lemma (E’) shows exactly one terminal (CAP or PAD) can succeed per active pair; any spoofing triggers an error-chain that removes Offer. Nearest-block barrier tokens placed one node past RUN footers kill cursors and force seam-neutrality beyond the nearest blocks, making (F2) independent of repetitions. A worked B=2 DP trace (ON vs OFF) is given. Pending: explicit out–out tile lists and a small symbol-count check. Source: prover-01.out.json (progress_md).",
  "highlights": [
    "Radius-1, type-local seam split into S1 (VT/VF/⊥/start/CAP/PAD) and S2 (O1/O2/O3/⊥/start/CAP/PAD) with explicit left/central/right seam edge tables enforcing offer/no-offer and central mutual exclusion.",
    "Equality/inequality certificates use RIDbits + HotRID (variable) and ip_bits + Selected + sgn (clause) with unary-addressed cursor tokens (EqL/EqR, NeqPick, NeqCheck); pointer integrity prevents spoofing.",
    "Exclusivity lemma E’: for any active (AccVar,AccCla) pair and chosen Op, exactly one of Eq (CAP) or Neq (PAD) can reach its terminal; mismatches trigger an error-chain that kills Offer.",
    "CAP emission is sign-gated: (CAP,CAP) allowed only when S1’s idle truth matches sgn[p] copied from RUN, preventing sign-cheats.",
    "Nearest-block barriers (BarVar/BarCla) placed immediately after block footers forbid cursor tokens and force seam-neutrality, removing dependence on repetition count z and closing the ⊥-trivialization gap.",
    "Worked B=2 trace: concrete RID=10 and clause occurrences show ON case produces (CAP,CAP) and OFF produces (PAD,PAD); outer seams reject ⊥ on active interfaces."
  ],
  "next_questions": [
    "Provide the explicit small set of out–out tile pairs that tie HotRID↔RIDbits and Selected↔RUN, plus the error-chain tiles that deactivate malformed blocks, and produce a concrete symbol count β = poly(s).",
    "Tabulate the full central-seam per-bit tile table for B=2 (b=0,1,2) and give the short radius-1 proofs that (i) EqStart/NeqStart cannot appear unless both outer seams are active and (ii) barriers block any cursor propagation in ≤1 step.",
    "Confirm locally that malformed blocks cannot emit Footer→Barrier (i.e., that the block grammar and tiles force malformed blocks into the error-chain and thus Neutral/NoOffer)."
  ]
}