{
  "summary_md": "Round 0004 (prover-04) converts the earlier sketches into explicit, radius-1 local-rule schemas that a DP verifier can check. Main deliverables: (i) a deterministic per-bit boundary probe (reserved boundary 4-tuples Q_j) with no ERR/⊥ escape and the Type-Separation claim E_{W_L(u)}(a⋆)[Q_j]=u_j, so 2^B left/right types; (ii) per-side GateL/GateR gating that permits colors at S only for canonical sides, ensures mixed pairs accept via neutral PAD plumbing, and enforces must-color only when both sides are canonical; (iii) a seam RUN_B tableau that writes VERD(FwdColor,EDGE,Eq) adjacent to S2 and enforces EDGE/Eq constraints purely by the S2↔VERD radius-1 pair; (iv) an explicit alphabet budget (|Σ_out| = Θ(B), choose β ≥ c·B) and a concrete B=2 skeleton plus DP audit plan. The construction neutralizes F2 by ⊥-plumbing and notes reliance on pumping/replacement lemmas to guarantee canonical contexts at lengths ℓ_pump/ℓ_pump+1. Cited file: prover-04.out.json (progress_md).",
  "highlights": [
    "Deterministic per-bit probe (Start_j→Head_j→Test_j→Accept_j) with ERR/⊥ disallowed in probe mode; under Q_j the probe accepts iff RIDbit at Addr=j equals 1, hence E_{W_L(u)}(a⋆)[Q_j]=u_j (Type-Separation).",
    "Per-side gating via GateL/GateR restricts S to {R,G,B} only when adjacent interior is canonical; mixed pairs (exactly one canonical side) accept unconditionally via neutral PAD; \"must-color\" is enforced only when both GateL and GateR are present.",
    "Seam tableau writes VERD(FwdColor,EDGE,Eq) next to S2; S2↔VERD pairs enforce (EDGE=1 ⇒ S2≠FwdColor) and (Eq=1 ⇒ S2=FwdColor) purely locally, so edge-inequality and equality constraints are checked radius-1.",
    "Alphabet budgeting made explicit: PORT and probe symbols O(B), other roles O(1); choose β≥c·B (authors suggest β≥c·B or β≥c·B^2 in earlier variants) so Cout–out tables fit.",
    "B=2 DP-checkable skeleton provided: symbol list, key Cout–out allowed pairs (probes, Addr monotonicity, gating, VERD checks), and an audit plan to run the O(kβ^2) DP on all 16 ordered pairs.",
    "F2 is neutralized with global ⊥-plumbing; existence of canonical contexts at desired lengths is assumed pending a short inclusion or citation of pumping/replacement lemmas (not yet in output.md)."
  ],
  "next_questions": [
    "Produce the parametrized, machine-readable Cout–out pair lists (explicit enumeration) for the probe state machine (Start_j, Head_j, Test_j, Accept_j), the PORT adjacency/Addr monotonicity rules, and the Cin–out mask tying PORT.RIDbit to Σ_in.",
    "Build and publish the B=2 instance (symbol list, Cin–out, Cout–out tables) and run the O(kβ^2) DP to validate: (i) probe separation bits for Q_1,Q_2 on all L(u); (ii) seam active-active behavior and mixed-pair vacuity on all 16 ordered pairs.",
    "Formalize or add (to output.md) the pumping/replacement lemma or an explicit padding construction guaranteeing canonical left/right contexts at lengths ℓ_pump and ℓ_pump+1 so the DP audit covers the intended context set."
  ]
}