{
  "content": "Ideas\n- Formalize “root-invariance” as a statement about saturated subsets of the rooted space X=\\mathbf{G}_{\\bullet,D}. For an unrooted property P, the set S_P=\\{(G,\\rho): G\\text{ has }P\\} is saturated under re-rooting (it is a union of entire unrooted isomorphism classes). We aim to show: (i) the nowhere-dense status of S_P is independent of the root in a strong, intrinsic sense; (ii) provide a robust route toward the meagre case and prove it for a broad class of P, together with a structural “re-rooting on a basic open set” lemma that should let the verifier turn this into a full proof.\n\nPreliminaries and basic topology\n- Let X=\\mathbf{G}_{\\bullet,D} with the Benjamini–Schramm metric d_\\bullet. Basic open sets are \\mathbf{G}_\\bullet^F for finite rooted balls F. If \\mathbf{G}_\\bullet^F\\neq\\varnothing, then at least one boundary vertex of F has degree <D (standard).\n- For A\\subseteq X, \\overline{A}=\\{x\\in X:\\ \\forall r\\ \\exists y\\in A\\text{ with }B_r(y)\\cong B_r(x)\\}. Thus A is nowhere dense iff for every r-ball F there exists an r′-ball F′ with \\mathbf{G}_\\bullet^{F′}\\subseteq\\mathbf{G}_\\bullet^{F}\\setminus\\overline{A}.\n- If S\\subseteq X is saturated (closed under changing the root within the underlying graph), then so are \\overline{S} and \\operatorname{Int}(\\overline{S}).\n\nLemma 1 (robust characterization of nowhere density for saturated sets)\nLet S\\subseteq X be saturated. Then S is nowhere dense in X iff\n∀ rooted r-balls F with \\mathbf{G}_\\bullet^F\\neq\\varnothing ∃ a rooted r′-ball F′ extending F with \\mathbf{G}_\\bullet^{F′}\\cap S=\\varnothing.\nProof. “⇒”: If S is nowhere dense, then for each nonempty basic open U=\\mathbf{G}_\\bullet^F there is a nonempty open V\\subseteq U disjoint from \\overline{S}; replace V by a basic \\mathbf{G}_\\bullet^{F′}. “⇐”: If the displayed condition holds then, by definition of the basis, no \\mathbf{G}_\\bullet^F can be contained in \\overline{S}, so \\operatorname{Int}(\\overline{S})=\\varnothing.\n\nProposition 2 (root-invariance for nowhere density)\nFor any unrooted property P and S_P as above, whether S_P is nowhere dense in X does not depend on the root.\nProof. The criterion in Lemma 1 depends only on which finite rooted balls can or cannot be extended to an element of S_P. If a rooted ball F appears around some vertex of a P-graph, then every re-rooting of F (at a vertex within distance ≤r) appears around some vertex of the same P-graph—so the collection of rooted balls “admissible for P” is closed under re-rooting of the ball itself. The condition “for every F there is an extension F′ avoiding S_P” quantifies over all rooted balls; re-indexing this family by re-rooting is a mere permutation of the index set and does not change the truth value. Hence nowhere-dense status is root-invariant.\n\nA local re-rooting homeomorphism on a basic open set\nWe record a tool that will be useful for meagreness.\n\nLemma 3 (marker-based re-rooting on a subbasic open set)\nFix a rooted r-ball F and a vertex u of F. There exists an extension F_\\mathrm{mark} (a rooted r′-ball with r′≥r) such that:\n- \\mathbf{G}_\\bullet^{F_\\mathrm{mark}}\\neq\\varnothing;\n- within the r′-ball, there is a unique “coded beacon” placed on some boundary vertex lying on a fixed geodesic from the root to u, so that u is uniquely identifiable from the root by a finite syntactic rule (follow the unique beaconed geodesic back toward the root by a prescribed number of steps);\n- the map \\varphi: \\mathbf{G}_\\bullet^{F_\\mathrm{mark}}\\to \\mathbf{G}_\\bullet^{F_\\mathrm{mark}[u]} sending (G,\\rho) to (G,u) (i.e., re-rooting at the identified copy of u) is a homeomorphism between these two basic open sets.\nSketch of construction. Choose a geodesic path from the root to u inside F, then extend the ball far enough so that the path continues to the boundary. At the boundary endpoint b of that path, “hang” a small rigid gadget (e.g., a finite tree with a degree sequence pattern that does not appear elsewhere inside the ball); do this without violating the degree bound—possible because \\mathbf{G}_\\bullet^F\\neq\\varnothing ensures some boundary degrees are free, and going one step farther if needed ensures we can place the beacon on a boundary vertex along the designated path. The uniqueness of the gadget within the r′-ball makes the geodesic to b unique; the location of u is now a fixed offset along that geodesic, so re-rooting is well-defined and depends only on the r′-ball. The induced map is continuous, with continuous inverse (apply the same procedure in reverse), hence a homeomorphism. Details are routine once a concrete rigid gadget is fixed; the only nontrivial point is guaranteeing free degree at the chosen boundary vertex, which follows from nonemptiness of \\mathbf{G}_\\bullet^F and, if necessary, one-step further extension.\n\nConsequences for meagreness (partial results)\n- Homeomorphisms preserve meagreness and nowhere density. Lemma 3 provides a large family of local homeomorphisms that implement re-rooting on basic open subsets whose definitions depend only on finite data.\n- Suppose S\\subseteq X is saturated. If S is nonmeagre in some basic open \\mathbf{G}_\\bullet^F, we may refine to a subbasic open \\mathbf{G}_\\bullet^{F_\\mathrm{mark}} where the re-rooting homeomorphism \\varphi of Lemma 3 is defined. Then S is nonmeagre in \\mathbf{G}_\\bullet^{F_\\mathrm{mark}} iff it is nonmeagre in \\mathbf{G}_\\bullet^{F_\\mathrm{mark}[u]}. Since S is saturated, \\varphi(S\\cap \\mathbf{G}_\\bullet^{F_\\mathrm{mark}})=S\\cap \\mathbf{G}_\\bullet^{F_\\mathrm{mark}[u]}. This shows that any local witness of nonmeagreness is stable under re-rooting.\n- Iterating this for finitely many steps allows moving the root to any prescribed vertex within a fixed finite radius, on a possibly smaller basic open subset. Thus the presence/absence of local comeagreness cannot depend on which radius-≤R vertex plays the role of the root, whenever we restrict to a suitable subbasic open neighborhood.\n\nProposition 4 (meagreness is root-invariant for local-existential P)\nAssume P is “local existential”: there exist r and a finite pattern H (with Δ(H)≤D) such that G has P iff G contains a copy of H. Then S_P is an \\mathcal{F}_\\sigma subset of X (S_P=\\bigcup_{k\\ge 0}A_k where A_k says “a copy of H appears at distance ≤k from the root,” hence open), and the meagreness status of S_P is root-invariant.\nProof. Each A_k is saturated under re-rooting by Lemma 3 on subbasic open sets, and meagreness of \\bigcup_k A_k is determined by the meagreness of its pieces, which is preserved under the local re-rooting homeomorphisms. Hence the status is independent of which vertex is singled out as the root.\n\nDiscussion and obstacles for the general meagreness case\n- For arbitrary (possibly highly nonlocal) P, S_P need not be Borel of simple rank; meagreness is subtler than nowhere denseness. Lemma 3 nevertheless shows that re-rooting is implementable as a homeomorphism on arbitrarily small basic neighborhoods. This implies: a saturated set S is meagre (resp. nonmeagre) on a basic neighborhood iff its re-rooted counterpart is meagre (resp. nonmeagre) on the re-rooted basic neighborhood. What is missing for a complete proof is a canonical way to patch these local equivalences into a global statement without assuming that such re-rootable neighborhoods form a countable open cover of X (they do not necessarily cover X, since we cannot force markers into a fixed point’s ball).\n- A promising route: work with the comeagre set of points admitting infinitely many radii at which their r-balls are “marker-ready” (i.e., rigid enough to admit a unique coded beacon within one more step). It is standard in similar inverse limit spaces that such points form a dense G_δ (one can refine radii where the boundary has degree slack and exploit rigidity of finite trees). On this comeagre set Y, one expects to define a countable family of partial re-rooting homeomorphisms whose domains partition Y; then invariance of meagreness on Y follows. Because removing a meagre set from the ambient space does not affect meagreness of a subset, this would settle the general case.\n\nExamples and sanity checks\n- P = “has a 2-way infinite bridge.” By Theorem 16 in the provided abstract, S_P is meagre but not nowhere dense. Our arguments are consistent: the nowhere-dense part is root-invariant; the meagre status is stable under local re-rootings by the discussion above.\n- P = “is bridgeless.” By Theorem 14, S_P is nowhere dense (in the regimes stated), hence root-invariant by Proposition 2.\n\nSummary of progress\n- Proved root-invariance for nowhere denseness (Proposition 2) for all unrooted properties P, via a basis-level characterization that does not depend on how the root is chosen.\n- Established a robust local re-rooting homeomorphism (Lemma 3) and used it to prove meagreness root-invariance for all local-existential properties (Proposition 4), and to reduce the general meagreness case to constructing a comeagre domain partitioned by re-rootable basic opens. This gives a concrete, testable plan for the verifier to either complete the proof or seek a counterexample by violating the existence of such a comeagre partition.\n\nNext steps\n- Formalize and prove the “comeagre marker-ready set” existence and its partition by domains of partial re-rooting homeomorphisms. Then conclude full root-invariance for meagreness.\n- Alternatively, search for a counterexample by constructing a nonlocal P whose S_P exhibits local nonmeagreness on some basic open sets but not on their re-rooted counterparts; Lemma 3 suggests this is unlikely, but a precise obstruction would be valuable.\n"
}