{
  "content": "# Ideas\n- Formalize and prove the general-K chain-based two-type certificate (pivot b), including exact minimization over two types and a clean dominance argument excluding other types for this targeted strategy.\n- Provide a safe data-driven sampling procedure via sample splitting: use one half to build the chain (e_j) and verify stability margins; use the other half to estimate only O(K^2) necessary top-of-S tallies and the pairwise t_c({b,c}).\n- Prove a Lipschitz/stability lemma ensuring the empirical chain equals the true chain when minimal gaps exceed 2τ, and bound the plug-in error of the mass formula by ≤ 6τ.\n- Record a crisp counterexample to the invalid first-round-only two-type claim, demonstrating the need for subset tallies t_w(S) beyond p_x.\n- Give a clean Ω((log K)/ε^2) lower bound for the two-type certificate via a reduction to best-arm identification over pairwise c-vs-y.\n\n# General-K chain-based two-type certificate (formal statement and proof)\nLet C be a set of K ≥ 3 candidates, fix a target c ∈ C and a pivot b ∈ C\\{c}, and fix a deterministic tie-breaking rule. For any nonempty S ⊆ C and a ∈ S, let t_a(S) = Pr[top_S(r) = a] under the population distribution over full rankings. Introduce a slack γ > 0 to enforce strict separations. Define the chain of remaining sets by S_1 := C and, for j = 1,…,K−2,\n- e_j := argmin_{e ∈ S_j\\{b,c}} t_e(S_j) (ties broken by the election’s rule),\n- S_{j+1} := S_j\\{e_j}.\nDefine\nA_b(γ) := max_{1≤j≤K−2} [ t_{e_j}(S_j) − t_c(S_j) + γ ]_+,\nB_b(γ) := max_{1≤j≤K−2} [ t_{e_j}(S_j) − t_b(S_j) + γ ]_+,\nD_{b,c}(γ) := t_b({b,c}) − t_c({b,c}) + γ.\nConsider augmentations restricted to two ballot types: c-first with total mass α ≥ 0, and b-first with total mass β ≥ 0. Then the following hold.\n\nTheorem (Chain-based two-type certificate).\n- Feasibility: If α ≥ A_b(γ), β ≥ B_b(γ), and α − β ≥ D_{b,c}(γ), then under IRV with the augmented profile: e_1,…,e_{K−2} are eliminated (in that order), and in the final round c strictly defeats b; in particular c is elected and tie-breaking is irrelevant.\n- Optimality over two types: Among augmentations supported only on c-first and b-first ballots, the minimum total added mass achieving the above eliminations and final is\n  ε^{(2)}_{b}(γ; c) = B_b(γ) + max{ A_b(γ), B_b(γ) + D_{b,c}(γ) }.\n- Global two-type certificate for c: ε^{(2)}(γ; c) := min_{b≠c} ε^{(2)}_{b}(γ; c) is a sound sufficient bound on the minimal augmentation to make c win. The exact minimal augmentation for K = 3 equals ε^{(2)}(γ; c), and ε^{(2)}(c) := lim_{γ→0^+} ε^{(2)}(γ; c).\n\nProof.\nFeasibility. Adding α c-first and β b-first ballots changes round-j tallies on S_j as: t'_x(S_j) = t_x(S_j) for x ∈ S_j\\{b,c}, t'_c(S_j) = t_c(S_j) + α, t'_b(S_j) = t_b(S_j) + β. By the definitions of A_b(γ) and B_b(γ), for every j we have t'_c(S_j) ≥ t_{e_j}(S_j) + γ and t'_b(S_j) ≥ t_{e_j}(S_j) + γ. Since the non-{b,c} tallies are unchanged, among S_j the unique minimum is e_j (ties do not occur because of the γ slack), so e_j is eliminated, producing S_{j+1}. By induction, e_1,…,e_{K−2} are eliminated in order, leaving {b,c}. In the final, each c-first ballot contributes +1 to t'_c({b,c}) and each b-first contributes +1 to t'_b({b,c}), hence t'_c({b,c}) − t'_b({b,c}) = (t_c({b,c}) − t_b({b,c})) + (α − β). The constraint α − β ≥ D_{b,c}(γ) yields a strict final-round win for c.\nOptimality over two types. Necessity of the three inequalities follows by the same per-round reasoning: at the round j where e_j is eliminated, both c and b must strictly exceed e_j’s tally, which is t_{e_j}(S_j); thus α ≥ [t_{e_j}(S_j) − t_c(S_j) + γ]_+ and β ≥ [t_{e_j}(S_j) − t_b(S_j) + γ]_+. The final-round strict win requires α − β ≥ D_{b,c}(γ). Minimizing α + β over the polyhedron {α ≥ A_b(γ), β ≥ B_b(γ), α − β ≥ D_{b,c}(γ)} is a two-variable linear program with optimum at β = B_b(γ) and α = max{A_b(γ), B_b(γ) + D_{b,c}(γ)}, giving ε^{(2)}_{b}(γ; c).\nDominance of two types for the targeted plan. Any added ballot that tops some e_j in some S_j increases t_{e_j}(S_j), tightening both A_b and B_b constraints; hence such ballots are weakly dominated by reallocating their mass to c-first or b-first without harming feasibility and not increasing α + β. Therefore, within the targeted plan “eliminate e_1,…,e_{K−2}, then c beats b,” it is sufficient and optimal to use only the two types. ∎\n\nRemarks.\n- This certificate is sufficient but not necessary for K ≥ 4; optimal augmentations may alter the chain (e_j) by using additional types to steer intermediate tallies. The theorem characterizes the optimal cost within the family of two-type strategies that keep the baseline chain.\n- For K = 3 the chain has length 1 and the theorem specializes to the exact closed-form derived previously: ε_a^*(γ) = B_γ + max{A_γ, B_γ + D_γ} and symmetrically for eliminating b first; the minimum over the two pivots is the true minimal augmentation.\n\n# Stability and sampling for the chain certificate\nDefine the chain gaps at each step j:\nΔ_j := min_{w ∈ S_j\\{b,c,e_j}} ( t_w(S_j) − t_{e_j}(S_j) ), with the convention Δ_j = +∞ if |S_j\\{b,c}| = 1.\nLet τ > 0 be an accuracy level.\n\nLemma (Chain stability under sup-norm error).\nIf sup_{S⊆C} sup_{a∈S} |\\hat t_a(S) − t_a(S)| ≤ τ and Δ_j ≥ 2τ for all j, then the empirical chain computed from \\hat t coincides with the true chain (same e_j and S_j), and moreover\n|\\widehat{A}_b(γ) − A_b(γ)| ≤ 2τ, |\\widehat{B}_b(γ) − B_b(γ)| ≤ 2τ, and |\\widehat{D}_{b,c}(γ) − D_{b,c}(γ)| ≤ 2τ.\nConsequently,\n|\\widehat{ε}^{(2)}_{b}(γ; c) − ε^{(2)}_{b}(γ; c)| ≤ 6τ.\n\nProof.\nBy Δ_j ≥ 2τ and the sup error ≤ τ, the argmin over S_j\\{b,c} is preserved at each j (standard stability of argmin under perturbations), so the empirical chain equals the true chain. For fixed j, the maps (t_{e_j}(S_j), t_c(S_j)) ↦ [t_{e_j}(S_j) − t_c(S_j) + γ]_+ and (t_{e_j}(S_j), t_b(S_j)) ↦ [t_{e_j}(S_j) − t_b(S_j) + γ]_+ are 2-Lipschitz under sup norm, and taking a maximum over j preserves Lipschitzness, giving |\\widehat{A}_b − A_b|, |\\widehat{B}_b − B_b| ≤ 2τ. Similarly, D_{b,c}(γ) depends on two pairwise tallies and is 2-Lipschitz. The map g(A,B,D) = B + max{A, B + D} changes by at most |δB| + max{|δA|, |δB| + |δD|} ≤ 3 max{|δA|,|δB|,|δD|}. A safe bound is 3·2τ = 6τ. ∎\n\nSampling procedure (sample splitting).\n- Inputs: ε, δ, γ > 0, target c and pivot b.\n- Draw m i.i.d. ballots and split into two halves of size ≈ m/2 each.\n- On the first half, compute empirical tallies \\tilde t_a(S) sequentially to build the empirical chain \\tilde e_j and \\tilde S_j: at step j use \\tilde t on \\tilde S_j to select \\tilde e_j = argmin_{e ∈ \\tilde S_j\\{b,c}} \\tilde t_e(\\tilde S_j), producing \\tilde S_{j+1} = \\tilde S_j\\{\\tilde e_j}.\n- On the second half, estimate the tallies needed only on the sets {\\tilde S_j} and the pair {b,c}: for each j and x ∈ \\tilde S_j, compute \\hat t_x(\\tilde S_j); also compute \\hat t_c({b,c}), \\hat t_b({b,c}). Check the empirical gap conditions \\hatΔ_j := min_{w∈\\tilde S_j\\{b,c,\\tilde e_j}}( \\hat t_w(\\tilde S_j) − \\hat t_{\\tilde e_j}(\\tilde S_j) ) ≥ 2τ for all j. If these hold, evaluate \\widehat{A}_b, \\widehat{B}_b, \\widehat{D}_{b,c} and certify c if\n  \\widehat{ε}^{(2)}_{b}(γ; c) = \\widehat{B}_b + max{ \\widehat{A}_b, \\widehat{B}_b + \\widehat{D}_{b,c} } ≤ ε − 6τ.\n- If the gap checks fail, abstain (certificate inconclusive for this pivot), or enlarge m.\n\nSample complexity. The second half estimates at most N = ∑_{j=1}^{K−1} |\\tilde S_j| + 2 ≤ (K + (K−1) + … + 2) + 2 = O(K^2) indicators of the form 1[top_S(r)=a]. By Hoeffding + union bound, choosing m = Θ((log(N/δ))/τ^2) = Θ((log K + log(1/δ))/τ^2) suffices to guarantee the sup error ≤ τ on the second half with probability ≥ 1 − δ/2. A similar union bound on the first half ensures the empirical chain equals the true chain whenever the true gaps Δ_j ≥ 4τ (to cover both halves). Overall, m = Θ((log K + log(1/δ))/ε^2) with τ = Θ(ε) certifies correctness with probability ≥ 1 − δ when margin conditions hold.\n\nRemark (computable upper envelope without gap checks). For robustness without verifying chain stability, define\nA_b^{env}(γ) := max_{1≤j≤K−2} max_{w∈S_j\\{b,c}} [ t_w(S_j) − t_c(S_j) + γ ]_+,\nB_b^{env}(γ) := max_{1≤j≤K−2} max_{w∈S_j\\{b,c}} [ t_w(S_j) − t_b(S_j) + γ ]_+.\nThese satisfy A_b^{env} ≥ A_b, B_b^{env} ≥ B_b and thus yield a sound but potentially looser certificate with the same two-type mass formula. They require estimating all top-of-S tallies on the chain sets S_j, still O(K^2) numbers.\n\n# Counterexample to first-round-only two-type claims (formalized)\nLet K = 4 with C = {a,b,c,y}. Suppose first-round shares (on S_1=C) are p = (0.26, 0.26, 0.23, 0.25) for (a,b,c,y), and after removing a the tallies on S = {b,c,y} are (t_b(S), t_c(S), t_y(S)) = (0.40, 0.25, 0.35). Any certificate that compares only first-round shares would compute A* ≈ max{p_w − p_c : w∈{a,b,y}}_+ = 0.03 and B* ≈ max{p_w − p_y : w∈{a,b}}_+ = 0.01 for pivot y, and might conclude that adding α ≥ 0.03 of c-first and β ≥ 0.01 of y-first suffices to keep b below c and y in the second round. But in S={b,c,y}, b’s tally is 0.40, so c remains the round-2 loser (0.25), contradicting the claimed sufficiency. Hence any sound certificate must use the relevant subset tallies t_w(S), not just first-round shares.\n\n# Lower bound: Ω((log K)/ε^2) for the two-type certificate\nWe exhibit a family of instances where certifying that c is an ε-winner via the two-type certificate reduces to identifying a favorable opponent among K − 1 possibilities.\n\nConstruction. Fix γ > 0 and set up profiles satisfying, for all b ≠ c and all S with {b,c} ⊆ S ⊆ C:\n- Dominance: for every w ∈ S\\{b,c}, t_w(S) ≤ min{ t_b(S), t_c(S) } − γ. Thus A_b(γ) = B_b(γ) = 0 for every pivot b.\n- Pairwise gaps: for exactly one b* we have t_c({b*,c}) = 1/2 − ε, and for all other b ≠ b*, t_c({b,c}) ≤ 1/2 − 2ε.\nThen ε^{(2)}(γ; c) ≤ ε iff there exists b with t_c({b,c}) ≥ 1/2 − ε (namely b = b*). Distinguishing H0: ∀b, t_c({b,c}) ≤ 1/2 − 2ε from H1: ∃! b*, t_c({b*,c}) = 1/2 − ε reduces to identifying the best among K − 1 Bernoulli means separated by ε. Standard lower bounds for best-arm identification (or Fano’s inequality with a (K − 1)-ary hypothesis) yield m = Ω((log K)/ε^2) samples to succeed with constant probability; scaling with log(1/δ) gives Ω((log K + log(1/δ))/ε^2). Therefore the log K factor in the sampling bound for the two-type certificate is information-theoretically necessary in this regime.\n\n# Example: applying the chain certificate for K = 4\nLet C = {a,b,c,d}, target c, pivot b, γ → 0^+. Suppose\n- On S_1 = {a,b,c,d}: (t_a,t_b,t_c,t_d) = (0.18, 0.26, 0.25, 0.31). Then e_1 = a.\n- On S_2 = {b,c,d}: (t_b,t_c,t_d) = (0.35, 0.32, 0.33). Then e_2 = d.\n- Pairwise c vs b: t_c({b,c}) = 0.49 (so D_{b,c}(0) = 0.02).\nCompute A_b(0) = max{ [0.18 − 0.25]_+, [0.33 − 0.32]_+ } = 0.01, B_b(0) = max{ [0.18 − 0.26]_+, [0.33 − 0.35]_+ } = 0. Hence ε^{(2)}_{b}(0; c) = 0 + max{0.01, 0.02} = 0.02. Adding 2% of c-first ballots suffices to certify c as an ε-winner via this chain.\n\n# Obstacles and clarifications\n- The chain-based two-type certificate is sufficient, not necessary, for K ≥ 4. Constructing an explicit K ≥ 4 instance where allowing a third ballot type strictly reduces the minimal augmentation below ε^{(2)}(γ; c) remains open; the natural approach is to design profiles where modest mass reorders the chain (e_j) to yield a cheaper path than any fixed-pivot two-type strategy.\n- Fixed-order LP sensitivity: bounding sup_{λ∈Λ} ||λ||_1 in the dual remains open when the negative term at j = pos_π(x) is kept; previous bounds that dropped it were incorrect. A possible route is to exploit the nested structure of S_j to express dual constraints via a telescoping potential over rounds or to design dual solutions supported on at most one competitor per round; this is a promising but unproven direction.\n\n# Next steps\n- Add the formal chain-based theorem and proof above to proofs.md and summarize its sampling corollary (sample splitting, O(K^2) tallies, m = Θ((log K + log(1/δ))/ε^2) under gap margins) in output.md.\n- Construct and verify a K = 4 separation example where a third ballot type reduces the required mass below ε^{(2)}(γ; c) (compute both the two-type bound and an LP-based feasible augmentation with three types).\n- Pursue a rigorous dual sensitivity bound by exploring structured duals (e.g., per-round single-competitor support) and potential-function decompositions; even a coarse poly(K) bound would yield polynomial-in-K sample guarantees for fixed orders.\n- Formalize the lower bound via Fano’s method for the dominance subclass above, making explicit a ranking distribution that realizes the required top-of-S and pairwise tallies.\n"
}