{
  "content": "Ideas\n- Formalize and prove the general-K chain-based two-type certificate (pivot b) with γ-slack and its exact two-type optimal cost B + max{A, B + D}. This provides a sound, efficiently checkable sufficient condition using only O(K^2) tallies from the chain sets S_j and the final pair.\n- Give a clean sampling corollary: Hoeffding + union bound over O(K^2) tallies; plug-in stability with a safe Lipschitz constant 6 for the cost map, yielding m = Θ((log K + log(1/δ))/ε^2) to certify using the chain certificate.\n- Record corrections: (i) the fixed-order LP dual sensitivity sup||λ||_1 remains open; previous attempted bounds (≤K or ≤K−1) were invalid due to the negative terms, (ii) for K=3 the safe Lipschitz constant is L ≤ 6 (not 3).\n\nGeneral-K chain-based two-type certificate (precise statement and proof)\nSetup. Let C be the candidate set, |C| = K ≥ 3. For any nonempty S ⊆ C and a ∈ S, let t_a(S) = Pr[top among S is a] under the baseline population distribution P over full rankings. Fix a target c ∈ C and a pivot b ∈ C \\ {c}. Fix a deterministic tie-breaking rule and a slack γ > 0 to enforce strict separations.\n\nDefine a chain of remaining sets by S_1 := C, and for j = 1,…,K−2:\n- Let e_j ∈ argmin_{e ∈ S_j \\ {b,c}} t_e(S_j), with ties broken by the election’s tie-breaking rule; set S_{j+1} := S_j \\ {e_j}.\nIntuition: e_j is the “baseline round-j loser among non-{b,c}” on S_j.\n\nDefine the thresholds\n- A_b(γ) := max_{1 ≤ j ≤ K−2} [ t_{e_j}(S_j) − t_c(S_j) + γ ]_+,\n- B_b(γ) := max_{1 ≤ j ≤ K−2} [ t_{e_j}(S_j) − t_b(S_j) + γ ]_+,\n- D_{b,c}(γ) := t_b({b,c}) − t_c({b,c}) + γ.\n\nConsider augmentations that add only two ballot types: α ≥ 0 mass of c-first rankings and β ≥ 0 mass of b-first rankings (the completions below the top are arbitrary but fixed). Let ε_b^{chain}(γ) be the minimal α+β that ensures the following IRV outcome under the augmented profile: the election eliminates e_1,…,e_{K−2} in this order and the final is c vs b with c strictly beating b by margin ≥ γ.\n\nTheorem (chain-based two-type certificate and exact two-type optimum). For any fixed b ≠ c and γ > 0:\n1) Feasibility: If α ≥ A_b(γ), β ≥ B_b(γ), and α − β ≥ D_{b,c}(γ), then under the augmented profile, in round j the candidate e_j is eliminated (with strict margin to both b and c), and in the final c strictly beats b; consequently c wins. Hence any ε ≥ B_b(γ) + max{A_b(γ), B_b(γ) + D_{b,c}(γ)} suffices to make c the winner via two-type additions.\n2) Optimality within two types: Among augmentations using only c-first and b-first ballots, the minimal total mass achieving the above outcome equals\n   ε_b^{chain}(γ) = B_b(γ) + max{A_b(γ), B_b(γ) + D_{b,c}(γ)}.\n\nProof.\nEffect of two types. A c-first ballot contributes +1 to t_c(S) for every S with c ∈ S, and leaves t_a(S) unchanged for a ≠ c. A b-first ballot symmetrically contributes +1 to t_b(S) for S containing b and leaves others unchanged. In particular, for every j ≤ K−2 (so S_j contains both b and c), we have\n  t'_c(S_j) = t_c(S_j) + α,  t'_b(S_j) = t_b(S_j) + β, and t'_{e_j}(S_j) = t_{e_j}(S_j).\nMoreover, in the final S = {b,c}, t'_c(S) − t'_b(S) = (t_c(S) − t_b(S)) + (α − β).\n\nFeasibility. By the definitions of A_b and B_b,\n  α ≥ A_b(γ) ⇒ t'_c(S_j) ≥ t_{e_j}(S_j) + γ for all j,\n  β ≥ B_b(γ) ⇒ t'_b(S_j) ≥ t_{e_j}(S_j) + γ for all j.\nTherefore at each round j, e_j is (weakly) below all other candidates in S_j, and strictly below both b and c. Since the other candidates’ tallies in S_j are unchanged and e_j was chosen as the argmin among S_j \\ {b,c} (with the same tie-breaking), e_j is the unique eliminated (ties, if any among S_j \\ {b,c}, resolve the same way as at baseline; strict gaps to b and c ensure e_j is still the minimum). After eliminating e_1,…,e_{K−2}, the final is between b and c. If in addition α − β ≥ D_{b,c}(γ), then t'_c({b,c}) ≥ t'_b({b,c}) + γ, so c strictly wins the final. Hence the stated inequalities are sufficient and the total mass α+β at any feasible point is an upper bound on ε.\n\nOptimal two-type cost. The feasible region in (α,β)-space is\n  { (α,β) ∈ R_+^2 : α ≥ A_b(γ), β ≥ B_b(γ), α − β ≥ D_{b,c}(γ) }.\nThis is a convex polyhedron. Minimizing α+β over it is achieved by taking β = B_b(γ) and α = max{A_b(γ), B_b(γ) + D_{b,c}(γ)} (any larger β enlarges α+β; any α below A_b violates feasibility; if A_b ≤ B_b + D then the α − β constraint is tight, otherwise α = A_b). Thus ε_b^{chain}(γ) equals the claimed expression. ∎\n\nRemarks.\n- This certificate depends only on the tallies t_x(S_j) for the chain sets S_j (j = 1,…,K−2) and the pairwise tallies on {b,c}. Computing the chain e_1,…,e_{K−2} uses the same deterministic tie-breaking as the election profile.\n- Dominance: For this targeted chain and final, any added ballot not topping b or c in S_j weakly worsens feasibility constraints at round j (it cannot lower t_{e_j}(S_j) and does not increase t_b(S_j) or t_c(S_j)), hence it is never needed in an optimal two-type plan for this chain.\n\nSampling corollary for the chain-based certificate\nDefine, for fixed c and b, the cost map\n  Φ_b(P; γ) := B_b(γ) + max{A_b(γ), B_b(γ) + D_{b,c}(γ)}.\nLet 𝒯_b be the multiset of tallies comprising, for j = 1,…,K−2, the triple (t_{e_j}(S_j), t_b(S_j), t_c(S_j)) and the pairwise (t_b({b,c}), t_c({b,c})). Note e_j depends on S_j’s full tally vector and the fixed tie-breaker; in sampling we compute e_j from estimates (and enforce a safety slack γ).\n\nLemma (uniform estimation over the chain tallies). For m i.i.d. ballots and any τ > 0, with probability at least 1 − δ, we have\n  sup_{x ∈ 𝒯_b} |\\hat t_x − t_x| ≤ τ\nwhenever m ≥ c · (log(2|𝒯_b|/δ))/τ^2 for a universal constant c. Here |𝒯_b| ≤ 3(K−2) + 2 = O(K).\n\nProof. Hoeffding’s inequality for each tally and a union bound over |𝒯_b|.\n\nProposition (plug-in stability and sample complexity). The map Φ_b(·; γ) is Lipschitz with constant at most 6 in the sup norm over the entries of 𝒯_b: for any two profiles P, Q,\n  |Φ_b(P; γ) − Φ_b(Q; γ)| ≤ 6 · sup_{x ∈ 𝒯_b} |t_x^P − t_x^Q|.\nConsequently, if m ≥ c (log(2|𝒯_b|/δ))/τ^2 and we declare c a certified ε-winner via pivot b whenever \\hat Φ_b ≤ ε − 6τ, then with probability ≥ 1 − δ the declaration is sound (c is an ε-winner).\n\nProof. Each difference t_{e_j}(S_j) − t_c(S_j) and t_{e_j}(S_j) − t_b(S_j) perturbs by at most 2τ under sup-norm τ perturbations of the inputs; taking positive part and a maximum over j preserves 2-Lipschitzness, so A_b and B_b are each 2-Lipschitz. The pairwise gap D_{b,c} is also 2-Lipschitz. The map (B, A, D) ↦ B + max{A, B + D} has Lipschitz constant ≤ 1 + max{1, 1 + 1} = 3 with respect to sup norm on (A, B, D). Composing gives ≤ 3·2 = 6 overall. The acceptance margin then follows.\n\nCorollary (choosing the pivot b). Since there are K − 1 choices of b ≠ c, a union bound adds only log(K) to the sample complexity. Declare c certified if min_{b≠c} \\hat Φ_b ≤ ε − 6τ; with m ≥ c (log(2K|𝒯_b|/δ))/τ^2 and τ = Θ(ε), this certifies c with probability ≥ 1 − δ whenever min_b Φ_b ≤ ε.\n\nConnections and consistency checks\n- K = 3: The chain has a single j (K−2 = 1) and recovers exactly the two-type closed form previously established: ε^*(γ; c) = min_{b≠c} Φ_b(P; γ). The safe plug-in Lipschitz constant is 6.\n- Soundness vs. first-round-only claims: The chain certificate crucially uses t_x(S_j) on the actual S_j; replacing these by first-round shares p_x can be arbitrarily wrong (see the verifier’s K=4 counterexample where post-transfer t_b(S) = 0.40 far exceeds p_b).\n\nObstacles (LP dual sensitivity remains open)\n- For a fixed elimination order π, the primal LP and its dual are correct as recorded in the notes. The dual constraint for a ranking r includes negative terms −∑_{a} λ_{j,a} when top_{S_j}(r) = π(j). Attempting to bound sup||λ||_1 by summing constraints over special r that place a fixed candidate first fails: the negative block at j = pos_π(·) cancels when one sums over candidates, yielding no nontrivial bound. Any future bound must leverage constraints for families of rankings r where the negative blocks are controlled jointly rather than naïvely dropped.\n\nExamples (sanity check instance for the chain certificate)\nConstruct K=4 with C={a,b,c,d}, target c, pivot b. Suppose\n- First round: t({a,b,c,d}) = (0.33, 0.30, 0.27, 0.10).\n- After removing d: t({a,b,c}) = (0.41, 0.31, 0.28).\n- Final pair: t_c({b,c}) − t_b({b,c}) = 0.02.\nChain (excluding {b,c}): S_1={a,b,c,d}, e_1=d; S_2={a,b,c}, e_2=a. Then\n  A_b(0) = max{ [0.10−0.27]_+, [0.41−0.28]_+ } = 0.13,\n  B_b(0) = max{ [0.10−0.30]_+, [0.41−0.31]_+ } = 0.10,\n  D_{b,c}(0) = −0.02.\nThus Φ_b(P; 0) = 0.10 + max{0.13, 0.08} = 0.23. Adding α=0.13 of c-first and β=0.10 of b-first ballots ensures elimination of d then a and a c-over-b final, for total mass 0.23. This illustrates how the chain-based certificate exploits the relevant S_j tallies beyond first-round shares.\n\nNext steps\n- Add the chain-based certificate theorem and sampling corollary (with L ≤ 6) to proofs.md and output.md. Keep the K=3 exact minimal-augmentation result and its sampling bound.\n- Computational search for separations: formulate a bilevel program that (i) chooses a small-support ranking distribution P (over, say, ≤10 ranking types) to maximize the gap between true minimal augmentation and min_b Φ_b(P; 0), and (ii) searches over augmentations with 2 vs. 3 types. This can produce concrete K≥4 instances where a third ballot type strictly reduces the required mass vs. any pivot-b two-type plan.\n- Dual sensitivity: explore averaging arguments over carefully chosen families of rankings that keep the negative dual terms bounded in aggregate, potentially yielding order-dependent bounds sup||λ||_1 = poly(K) (e.g., O(K^2)). Any such bound would convert per-order LP certification into a polynomial-sample scheme.\n- Lower bounds: pursue a Fano-style packing over pivots b (hiding the favorable opponent among K−1) to show a necessary Ω((log K)/ε^2) factor for certifying an ε-winner in the worst case.\n"
}