{
  "content": "Ideas\n- Repair and generalize the forcing for ≤D: “attach a leaf” fails because the leaf sits on the boundary of the refined ball and can gain new edges in completions. The correct forcing is to attach a finite pendant path entirely inside a larger ball so that the attachment edge lies strictly in the interior; then every completion preserves it as a 1‑way infinite bridge. This works for all D>2 and avoids parity obstructions (we do not saturate degrees to D on the finite side; the cylinder’s interior forbids new edges there).\n- Package this with a general invariance lemma for strongly local, cylinder‑open metrics to conclude: in X=G_{•,≤D} (D>2), “bridgeless” is nowhere dense for any such metric. In X=G_{•,=D} with odd D, use the sealed‑bubble gadget as before. Even D regular remains comeagre bridgeless by the meagreness of 2‑way bridges and parity.\n- We also formalize the D‑regular completion lemma (odd D) and the 2‑way bridge shielding in a succinct, verifiable way.\n\nDefinitions\n- Strongly local, cylinder‑open metric: A metric d on X is strongly local if ∃ψ:(0,1]→ℕ with d(x,y)<ε ⇒ B_{ψ(ε)}(x)≅B_{ψ(ε)}(y), and cylinder‑open if every local cylinder C(F)={x: B_r(x)≅F} is d‑open. Weighted local metrics d_w(x,y)=∑_{r≥0} w_r·1_{B_r(x)≄B_r(y)} (w_r↘0, ∑w_r<∞) are Polish, strongly local, and cylinder‑open.\n\nLemma A (robust nowhere‑denseness via cylinder forcing)\nLet d be strongly local and cylinder‑open on X and S⊂X satisfy: for every cylinder C(F)≠∅ there exists a refined cylinder C(F′)⊆C(F) with C(F′)≠∅ and C(F′)⊆X\\S. Then S is nowhere dense in (X,d).\nProof. As in earlier rounds: every nonempty d‑open U contains a cylinder C(F), which contains a smaller cylinder C(F′) disjoint from S; hence int_d(cl_d S)=∅.\n\nForcing in X=G_{•,≤D} (all D>2)\nLemma B (interior pendant‑path forcing). Fix D>2. Let C(F) be any cylinder in X=G_{•,≤D}, with F=B_r. Choose a boundary vertex u∈L_r(F) (existence trivial if F comes from an infinite graph). For an integer L≥2, form a refined ball F′ by adjoining a simple path P=u p_1 p_2 … p_L beyond u and then choosing r′=r+L+1. Finally, add one fresh leaf y attached to some vertex z at distance r′−1 to ensure L_{r′}(F′)≠∅ and has a vertex of degree <D. Then C(F′)⊆C(F) is nonempty and every extension of F′ contains the edge e=up_1 as a bridge.\nProof. In F′, every vertex of P has graph distance ≤r+L ≤ r′−1 from the root, so P⊂int(B_{r′}). In any extension of F′ within the cylinder, no vertex of P may gain new neighbors (else B_{r′} changes). Thus the only edge from P to V(F′)\\P is e, whence e is a 1‑way infinite bridge in every completion. Nonemptiness holds because L_{r′}(F′) contains the added leaf y (degree 1<D), so an infinite ≤D extension can be constructed by attaching rooted (D−1)‑ary trees to boundary vertices with spare capacity and proceeding outward.\nCorollary B1. For any strongly local, cylinder‑open metric d on X=G_{•,≤D} with D>2, “bridgeless” is nowhere dense.\n\nEven‑regular parity and odd‑regular forcing in X=G_{•,=D}\nProposition C (even D parity). In any D‑regular graph with even D, a 1‑way infinite bridge is impossible: if S is the finite side of a cut, then D|S|=2|E(S)|+|∂S| forces |∂S| even.\nLemma D (sealed bubble for odd D). For odd D≥3 there exists a finite connected graph T with degree sequence (D−1,D,…,D). Given any cylinder C(F) with a boundary vertex u of residual capacity, adjoin T and a single edge e=ut_0 (t_0 has degree D−1 in T) and choose r′ so that T⊂int(B_{r′}). Then in X=G_{•,=D} (odd D) every extension has e as a 1‑way infinite bridge. A D‑regular infinite completion exists by Lemma E.\nSketch. Erdős–Gallai shows (D−1,D,…,D) is graphic for odd n≥D+2. Place T inside the interior of a large ball; then it is sealed topologically (no new edges may be added to T in any completion). The unique interface e is a bridge.\nLemma E (D‑regular completion outside a finite preball). Let H be finite with max degree ≤D (odd D). Attach to each vertex v with deficit c(v)=D−deg_H(v) a disjoint rooted infinite (D−1)‑ary tree T_{v,i} and connect root to v; then every vertex attains degree D and the resulting graph is infinite, connected, and D‑regular.\n\nTwo‑way infinite bridges are meagre (all D>2)\nLemma F (shielding). For k∈ℕ, let P_k be the set of graphs with a 2‑way infinite bridge meeting B_k. For any cylinder C(F) with r≥k, classify edges e of F within distance ≤k as safe if in F−e some component has no boundary vertex, else critical. For each boundary vertex with spare capacity lying in a critical component, add one new neighbor outside B_r and connect all such new neighbors into a single simple cycle located at distances r+1 and r+2. Let F′ be the resulting (r+2)‑ball. Then no extension of F′ contains a 2‑way infinite bridge meeting B_k, so C(F′)⊆X\\P_k. Thus P_k is nowhere dense. The union ⋃_k P_k is meagre. It is dense by adding far‑away double rays connected by a single edge within any cylinder.\n\nConsequences for typicality under strongly local, cylinder‑open metrics\n- X=G_{•,≤D}, D>2: By Lemma B and Lemma A, “bridgeless” is nowhere dense (hence meagre if (X,d) is Baire/Polish, which holds for d_w). This strengthens and corrects the forcing for even D by using interior pendant paths, not degree saturation.\n- X=G_{•,=D}, odd D≥3: By Lemma D and Lemma A, “bridgeless” is nowhere dense (and meagre in Polish settings).\n- X=G_{•,=D}, even D≥4: By Proposition C and Lemma F, “bridgeless” is comeagre (2‑way bridges meagre; 1‑way bridges impossible).\n\nExamples and checks\n- Nonempty interior of 1‑way‑at‑distance‑k (≤D). For any k and D≥2, pick r≫k and let F be a ball containing a pendant path Q of length >k fully inside (i.e., its far end sits at distance <r). Then C(F)⊂{graphs with a 1‑way bridge at distance ≤k}. Hence these sets have nonempty interior (they are not meagre), consistent with “bridgeless” being meagre (its complement is comeagre) for odd D and with “has a bridge” being dense for ≤D.\n\nObstacles and clarifications\n- The earlier parity obstruction only blocks the degree‑saturation approach for even D; it does not apply to the interior pendant‑path forcing, which seals the finite side by topology (interiority of the ball), not by saturating degrees.\n- The cylinder refinement must ensure nonemptiness; adding an extra leaf at distance r′ suffices to maintain a boundary vertex with degree <D, guaranteeing infinite completions.\n\nNext steps\n- Formalize Polishness for the listed metric family (d_w, FO‑local) and record the transfer of nowhere‑denseness via Lemma A.\n- For =D odd, include a succinct construction of T (e.g., an appropriate subgraph of K_{D+2} with prescribed degrees) and a one‑page detailed proof of Lemma E.\n- Investigate whether any genuinely nonlocal, Polish topology can flip typicality (make “bridgeless” comeagre) in ≤D for odd D without making “has a bridge” open; current evidence suggests strong locality is the robust regime where typicality is invariant.\n\nSummary\n- We corrected the ≤D forcing by using an interior pendant path, yielding a clean, rigorous proof: under any strongly local, cylinder‑open metric, bridgeless graphs are nowhere dense in G_{•,≤D} for all D>2. Together with the sealed‑bubble gadget for odd D in =D and parity plus shielding for even D in =D, this settles the typicality of “bridgeless” across a broad class of natural metrics: no natural strongly local alternative makes bridgeless typical in regimes where it is not under d_•."
}