{
  "content": "Progress on Conjectures 1 and 2: root-invariance via the forgetful map; no-go for cylinder topologies; parity gadget for D-regular odd; density under a re-rooting pseudometric\n\nSetup and notation\n\n- X = G_{\\bullet,D}: rooted, connected, countably infinite graphs of maximum degree ≤ D or = D (as specified), with the Benjamini–Schramm (BS) topology generated by rooted cylinders G_\\bullet^F.\n- Y = G_{\\varnothing,D}: unrooted version (same underlying graphs, no distinguished root). Equip Y with the “rootless local” topology generated by sets U_F^Y = { G ∈ Y : ∃v ∈ V(G) with B_r(G,v) ≅ F }, where F is a rooted r-ball.\n- Forgetful map π: X → Y, π(G,ρ)=G.\n\nA. Conjecture 1 (root-invariance): full resolution\n\nLemma A1 (π is continuous, open, surjective). For any rooted r-ball F, π(G_\\bullet^F)=U_F^Y and π^{-1}(U_F^Y)=G_\\bullet^F. Hence π is continuous, open, and onto.\n\nLemma A2 (closure/interior commute with π^{-1}). For any A ⊆ Y,\n(1) cl_X π^{-1}(A) = π^{-1}(cl_Y A);\n(2) int_X π^{-1}(A) = π^{-1}(int_Y A).\nProof. For (1), the inclusion cl_X π^{-1}(A) ⊆ π^{-1}(cl_Y A) holds for every continuous map. For the reverse, take x ∈ π^{-1}(cl_Y A). For any open U ⊂ X with x∈U, π(U) is open (π open) and contains π(x) ∈ cl_Y A, so π(U)∩A ≠ ∅. Thus U∩π^{-1}(A) ≠ ∅. Hence x ∈ cl_X π^{-1}(A). For (2), use int = Y \\ cl(Y\\·) and (1), or note π is a quotient map so inverse images preserve interiors.\n\nProposition A3 (nowhere-dense equivalence). For any A ⊆ Y,\nA is nowhere dense in Y ⇔ π^{-1}(A) is nowhere dense in X.\nProof. A nowhere dense iff int_Y cl_Y A = ∅. Apply Lemma A2 twice: int_X cl_X π^{-1}(A) = π^{-1}(int_Y cl_Y A). Since π is surjective, π^{-1}(∅)=∅ and π^{-1}(B)=∅ implies B=∅. Hence equivalence.\n\nProposition A4 (meagre equivalence for sets with the Baire property). Assume X,Y are Baire (true here), and let A ⊆ Y have the Baire property. Then A is meagre in Y ⇔ π^{-1}(A) is meagre in X.\nProof. “⇒”: If A=⋃_n A_n with A_n nowhere dense in Y, then by A3, π^{-1}(A)=⋃_n π^{-1}(A_n) is meagre in X. “⇐”: Suppose π^{-1}(A) is meagre, but A is not meagre. Since A has the Baire property, there is a nonempty open V⊂Y such that A is comeagre in V. Then V∩(Y\\A) is meagre in Y and hence (by A3) π^{-1}(V∩(Y\\A)) is meagre in X. But π^{-1}(V) is nonempty open (π open), so π^{-1}(A) is comeagre in π^{-1}(V), contradicting that π^{-1}(A) is meagre in X (Baire). Thus A is meagre.\n\nCorollary A5 (Conjecture 1). For any property P of unrooted graphs and S_P={(G,ρ)∈X: G has P} = π^{-1}(T_P) with T_P⊆Y, the smallness status is root-invariant:\n- S_P is nowhere dense in X ⇔ T_P is nowhere dense in Y;\n- if T_P has the Baire property (e.g., Borel/analytic), then S_P is meagre in X ⇔ T_P is meagre in Y.\n\nBanach–Mazur/game remark. The above also yields a root-free criterion: for saturated S⊂X (equivalently S=π^{-1}(A)), S is nowhere dense iff for every unrooted ball B there is a refinement B′ with Cyl(B′)⊂Cyl(B)\\A, where Cyl(B)=⋃ rootings F of B G_\\bullet^F. This restates Lemma 13 in a rootless form and can be used to design root-free winning strategies in the Banach–Mazur game for meagreness.\n\nB. Conjecture 2: a no-go theorem for cylinder-based topologies\n\nDefinition B1 (ball-local topologies). A topology τ on X is ball-local if the rooted cylinders {G_\\bullet^F} form a base of τ. Equivalently, τ induces exactly the BS topology (possibly via a different metric scale).\n\nTheorem B2 (no-go). In any ball-local topology on X, the conclusions of Theorems 14–17 (nowhere denseness of bridgeless, etc.) remain true. In particular, bridgeless graphs are nowhere dense in every ball-local topology and cannot be typical there.\nProof sketch. The proofs of Theorems 14–17 proceed by: given a nonempty cylinder G_\\bullet^F, construct a refinement cylinder G_\\bullet^{F′}⊂G_\\bullet^F such that every extension of F′ has the desired obstruction (e.g., a bridge). This argument depends only on the extension poset of finite rooted balls, not on metric numerics. Since cylinders are basic opens in any ball-local topology, the same refinement shows the target set has empty interior of its closure, i.e., is nowhere dense.\n\nC. Odd D-regular case: a clean parity gadget forcing a bridge\n\nFor D odd ≥ 3, we give a compact “one-cut” counting gadget that repairs earlier parity flaws.\n\nNotation. For a finite connected graph F (intended as an r-ball), define S(F)=∑_{v∈V(F)}(D−deg_F(v))=D|V(F)|−2|E(F)|. In any D-regular supergraph H, the number of edges of H leaving V(F) equals S(F).\n- Parity identity: For odd D, S(F) ≡ |V(F)| (mod 2).\n\nProposition C1 (bridge-forcing refinement for =D odd). Let D be odd ≥ 3. Let F=B_r(G,ρ) be any rooted r-ball that occurs in some D-regular graph. Then there exists r′≥r+1 and a rooted extension F′=B_{r′}(G′,ρ) with maximum degree ≤D such that S(F′)=1. Consequently, in every D-regular extension of F′, the unique edge leaving V(F′) is a 1-way infinite bridge.\n\nProof. Start from F=B_r(G,ρ). Let L=L_r be its boundary. For each v∈L, denote δ(v)=D−deg_F(v)≥1. Let c=∑_{v∈L}δ(v)=S(F).\nAdd a new layer W of t vertices at distance r+1 from ρ; t will be chosen. Connect each v∈L to δ(v) distinct vertices of W (so total c cross edges). So far, degrees in L within the augmented graph F_1 are D, and vertices of W have degrees s_w∈{0,1,2,...} summing to c. Next add e_W edges inside W (no multiple edges), producing F′ on V(F)∪W. Then\nS(F′) = S(F) + D t − 2(c + e_W) = D t − (c + 2 e_W).\nChoose t≥c with parity t ≡ c+1 (mod 2) and so large that e_W defined below satisfies e_W ≥ t−1. Set\n e_W := (D t − c − 1)/2.\nThen S(F′)=1. Since t ≡ c+1 (mod 2) and D odd, e_W is an integer. Also e_W ≤ ⌊(∑_{w∈W}(D − s_w))/2⌋ = ⌊(tD − c)/2⌋, so a simple graph on W with e_W edges exists respecting degree bounds d_w ≤ D−s_w (e.g., greedily build a spanning tree on W, then add edges arbitrarily until reaching e_W). Finally, since vertices at distance ≤ r now have degree D within F′ (boundary L was saturated to D by the W-connections), F′ is an (r+1)-ball. In any D-regular extension H⊇F′, the number of edges in δ_H(V(F′)) equals S(F′)=1, so that edge is a bridge; since V(F′) is finite and H is infinite, it is a 1-way infinite bridge. ∎\n\nThis gives a clean, verifiable refinement step for Theorem 14(ii) (odd D case) and extends immediately to other cylinder-refinement no-go arguments (Section B).\n\nD. Section metrics and bounded re-rooting equivalence\n\nGiven a section s: Y→X choosing a root s(G)∈V(G), define a metric on Y by d_s(G,H):=d_\\bullet((G,s(G)),(H,s(H))).\n\nLemma D1 (bounded re-rooting yields homeomorphism). If s,t are sections with sup_G dist_G(s(G),t(G)) ≤ R, then the identity map (Y,d_s)→(Y,d_t) is a homeomorphism. In fact, B_r^{d_t}(G) ⊆ B_{r−R}^{d_s}(G) and vice versa (for r>R), so typicality cannot change across such section metrics.\nProof. If B_r(G,s(G)) ≅ B_r(H,s(H)), then B_{r−R}(G,t(G)) ≅ B_{r−R}(H,t(H)) since moving the root by ≤R only affects balls by R. This yields mutual continuity and topological equivalence.\n\nE. A natural coarser, root-insensitive pseudometric and two density results\n\nDefine on X a symmetric pseudometric d_any by\n d_any(x,y) = max{ 2^{-sup{r: ∃σ B_r(x) ≅ B_r(y,σ)}}, 2^{-sup{r: ∃ρ B_r(y) ≅ B_r(x,ρ)}} }.\nHere B_r(x) denotes the rooted r-ball of x=(G,ρ), and the sup is over re-rootings in the other graph. Two rooted graphs are close if each one’s r-ball occurs somewhere in the other and vice versa.\n\nLemma E1 (1-way infinite bridges are dense under d_any in ≤D). Fix D>2. For any x=(G,ρ) and r, there exists H with a 1-way infinite bridge and σ∈V(H) such that B_r(H,σ) ≅ B_r(G,ρ) and d_any(x,(H,σ)) ≤ 2^{-r}.\nProof. Let F=B_r(G,ρ). Build H by taking a copy of F, pick a boundary vertex v with deg_F(v) < D, attach a new vertex a to v by a single edge e and extend a by an infinite ray outside the r-ball. Complete the rest beyond distance r to a connected infinite graph with maximum degree ≤ D, ensuring no additional edges touch vertices inside distance r. Then e is a bridge whose outside component is infinite, and H contains σ (the copy of ρ) with the same r-ball. Symmetry of the construction gives the stated bound.\n\nLemma E2 (bridgeless graphs are dense under d_any in ≤D). Fix D>2. For any x=(G,ρ) and r, there exists a bridgeless H of maximum degree ≤ D and σ∈V(H) with B_r(H,σ) ≅ B_r(G,ρ), hence d_any(x,(H,σ)) ≤ 2^{-r}.\nProof. Let F=B_r(G,ρ), boundary L=L_r. Take an infinite 2-edge-connected scaffold S with degrees ≤ D and with infinitely many vertices of degree ≤ D−1 to serve as ports (examples: for D≥4, the 2D grid with some edges subdivided to create degree-2 ports; for D=3, the standard infinite ladder, which is 2-edge-connected and has many degree-2 vertices). Form H by taking a disjoint copy of F and of S. For each v∈L, attach one new edge from v to a distinct port p(v)∈V(S), choosing the ports pairwise far apart to keep degrees ≤ D. For each unordered pair {v,w} in a fixed pairing of L, select an edge-disjoint path P_{v,w} in S between p(v) and p(w) (possible since only finitely many ports are used) and ensure v—p(v)—P_{v,w}—p(w)—w plus an internal v–w path in F forms a cycle through both crossing edges. All crossing edges from L into S lie on cycles, hence are not bridges. Inside F we do not alter edges; in S all edges lie on cycles by construction. Therefore H is bridgeless. Since edges incident to L join at distance r+1 from ρ, B_r(H,σ) ≅ F for σ the copy of ρ. Degrees remain ≤ D because each v∈L gains at most one new edge (δ(v)≥1) and each chosen port has degree raised by at most 1. ∎\n\nConsequences. Under d_any, both “has a 1-way infinite bridge” and “is bridgeless” are dense. Determining typicality now hinges on whether (X/∼,d_any) is Baire; if it is, neither class can be comeagre. Establishing the Baire property (or failing it) is the key remaining step for this candidate topology.\n\nF. Obstacles and checks\n\n- The meagre equivalence in A4 required only that A has the Baire property and used the fact (A3) that preimages preserve nowhere denseness both ways. This avoids the incorrect claim that saturating a nowhere dense set remains nowhere dense.\n- In C1 we carefully ensured F′ is an (r+1)-ball by saturating all vertices in L to degree D within F′; the counting choice S(F′)=1 then forces a 1-edge cut in every D-regular extension.\n- In E2, we used only finitely many ports of S, making degree control trivial. 2-edge-connectedness of S and the explicit cycle formation guarantee absence of bridges.\n\nNext steps\n\n- Prove that (X/∼,d_any) is (or is not) a Baire space. One approach: characterize basic open sets via finite bidirectional appearance constraints and apply the Baire category theorem via a complete metric reformulation.\n- Extend the no-go region (B2) to larger “finite-lens” topologies where basic opens are defined by finitely many rooted balls around finitely many distinguished vertices; the parity gadget C1 still applies.\n- Explore other natural root-insensitive metrics on Y such as the pattern-occurrence metric d_occ(G,H)=∑_F w_F |1_{F occurs in G}−1_{F occurs in H}| (w_F summable). Analyze bridges’ category there.\n- Formalize a Banach–Mazur game on unrooted balls (Y) to give root-free proofs of meagreness for further properties (e.g., 2-way infinite bridges) and to test robustness beyond Borel/analytic sets.\n"
}