{
  "summary_md": "Round 0006 introduced a small, auditable unconditional lemma (UB) that reduces the |A|=4 one‑point CSP to two tiny 8‑entry local tables: if each triangle forbids ≤1 triple then the 6‑variable instance is satisfiable by a union‑bound count. A sharp O5‑image formula (p' = −ε off one coordinate) was proved to speed IsO5 membership tests. The 2+2 vertex‑sign ansatz (x_{ij}=w_iw_j) was sharpened: if certain (+,−,−) permutations lie in the local F(α,β) tables then Prop.11 yields a uniform solution; weaker, concrete prerequisites were distilled (Prop.11′). Structural lemmas (T, D, P) classify 5‑types as constant vs 2+2 on A, control which triangle‑triples appear under w choices, and give an even‑parity constraint on triangle products — all shrink the brute‑force search. A remaining, decisive computational task is to run IsO5 and populate F(+,+),F(+,−); note a discrepancy in the notes about whether (+++)∈F(+,−) (claimed excluded in one draft, later retracted), so enumeration is needed. Citations: prover-01.out.json, prover-02.out.json, prover-03.out.json.",
  "highlights": [
    "Lemma UB (union‑bound): if every triangle forbids at most one ordered triple, the 6‑edge CSP on K4 has ≥1 global solution (64−4·8≥1).",
    "O5‑image formula: any O5 image equals −ε on all but one coordinate (fast necessary‑and‑sufficient test for IsO5 membership).",
    "2+2 vertex‑sign ansatz narrowed: only a small set (≤12) of local F‑table memberships need checking to validate Prop.11 (uniform one‑point amalgam for |A|=4).",
    "Product‑pattern conjecture P+: hypothesizes F(α,β) = {triples with product +1}; if true, x_{ij}=w_iw_j solves all local constraints uniformly and would prove AP.",
    "Structural reductions: Lemma T (C5 vs H5 give constant vs 2+2 patterns), Lemma D (counts of (+++) occurrences under w choices), and Lemma P (even parity of triangle triple‑products) cut the search to a few macro‑profiles.",
    "Actionable verification plan: implement IsO5, run unit tests and 4 decisive 5‑vectors, then compute the two 8‑entry tables F(+,+),F(+,−) and apply UB/Prop.11 or fall back to tiny 2^6 brute force."
  ],
  "next_questions": [
    "Implement IsO5 (via Lemma 6), run the unit tests and the four decisive 5‑vectors, then publish the O5 orbit size and ε(τ) samples.",
    "Compute F(+,+) and F(+,−) (8 triples each) under the fixed coordinate convention; report the complements and sizes. If both complements have size ≤1 invoke Lemma UB; otherwise check the 12 (+,−,−) membership entries for Prop.11/11′.",
    "If the above fail to settle |A|=4, run the 2^6 brute‑force CSP per remaining macro‑profile (using Lemmas T/D/P to restrict profiles) and archive either SAT witnesses or an UNSAT certificate."
  ]
}