{
  "progress_md": "## Round 0004 — 2025-08-27T15:14:46.643398Z\n\nHousekeeping.\n- There is no output.md provided; I therefore cannot check curated results for gaps. I proceed with new, fully stated and checkable lemmas/proofs, and I highlight where they apply in the overall strategy.\n\nContext reminder.\n- Vertices are points in [n]×[n]. Edge types: 1 (NE–SW), 2 (NW–SE), 3 (vertical), 4 (horizontal).\n- Colors: type 1 and 2 have labels (type, α, β) using α = min x, β = min y; type 3 has (3, β); type 4 has (4, α).\n- Previously noted and used: local multiplicities for types 1 and 2 are exact and simple. I extend this with precise multiplicity formulas for types 3 and 4 and extract uniqueness criteria. Then I prove the target statement for |U| = 3 (complete case analysis) and record several structural lemmas useful going forward.\n\n### Precise multiplicity formulas (global) for all types\n\nClaim 1 (restate and sharpen Type 1 multiplicity). For any (α,β) ∈ [n]^2, the number of edges in G[U] with color (1,α,β) equals the number of vertices in U strictly north–east of (α,β). In particular, color (1,α,β) can occur only if (α,β) ∈ U, and then its multiplicity equals the count of NE-neighbors of (α,β).\n- Proof. Any type–1 edge with label (1,α,β) must have SW endpoint (α,β) (since label takes coordinate-wise minima). Conversely, each NE neighbor q of (α,β) yields exactly one edge of that color. Distinct NE neighbors give distinct edges. QED.\n\nClaim 2 (restate and sharpen Type 2 multiplicity). For any (α,β) ∈ [n]^2, let\n- r_U(α,β) = # { (α,y) ∈ U : y > β } and s_U(α,β) = # { (x,β) ∈ U : x > α }.\nThen the number of edges in G[U] with color (2,α,β) is r_U(α,β) · s_U(α,β). In particular, (2,α,β) is unique iff r_U(α,β) = s_U(α,β) = 1.\n- Proof. A type–2 edge with label (2,α,β) arises from choosing one point on the vertical ray {(α,y) : y>β} and one on the horizontal ray {(x,β) : x>α}, and conversely any such pair produces exactly one such edge. The choices multiply. QED.\n\nClaim 3 (Type 3 multiplicity). For β ∈ [n], define for each α ∈ [n] the integer v_α(β) = # { (α,y) ∈ U : y > β }, and the indicator 1_{α,β} = 1 if (α,β) ∈ U, 0 otherwise. Then the number of edges colored (3,β) equals\n- T_3(β) = ∑_{α=1}^n 1_{α,β} · v_α(β).\nConsequently, color (3,β) is unique in U iff there is exactly one column α with (α,β) ∈ U and v_α(β) = 1, and for all other columns either (α,β) ∉ U or v_α(β)=0.\n- Proof. Type–3 edges are vertical, and the label (3,β) means the lower endpoint has y-coordinate β. For a fixed column α, the eligible lower endpoint is (α,β) (if present), and it connects to each (α,y) with y>β, contributing v_α(β) edges. Sum over α. Uniqueness is equivalent to T_3(β)=1, which forces exactly one contributing α and exactly one upper neighbor there. QED.\n\nClaim 4 (Type 4 multiplicity). Fix α ∈ [n]. For β ∈ [n], define h_β(α) = # { (x,β) ∈ U : x > α } and the indicator 1'_{α,β} = 1 if (α,β) ∈ U, 0 otherwise. Then the number of edges colored (4,α) equals\n- T_4(α) = ∑_{β=1}^n 1'_{α,β} · h_β(α).\nConsequently, color (4,α) is unique in U iff there is exactly one row β with (α,β) ∈ U and h_β(α) = 1, and for all other rows either (α,β) ∉ U or h_β(α)=0.\n- Proof. Analogous to Claim 3, with rows/columns interchanged. QED.\n\nWhy useful here. Claims 3–4 turn the previously vague intuition (“types 3,4 repeat”) into precise numerical tests for uniqueness. They also yield immediate “single-row/column witness” lemmas below.\n\n### Immediate corollaries for types 3 and 4 (rigorous uniqueness triggers)\n\nLemma E (unique type 3 from a singleton row with a single vertical extension). Suppose there exists a row β containing exactly one vertex (α,β) ∈ U, and in column α there is exactly one vertex above it: exactly one y>β with (α,y) ∈ U. Then color (3,β) is unique in G[U] and is realized by the vertical edge between (α,β) and that unique (α,y).\n- Proof. By Claim 3, T_3(β) = ∑_α 1_{α,β} v_α(β). Only one α contributes (the unique α with (α,β) ∈ U), and there v_α(β)=1 by hypothesis. Hence T_3(β)=1. QED.\n\nLemma F (unique type 4 from a singleton column with a single horizontal extension). Suppose there exists a column α containing exactly one vertex (α,β) ∈ U, and in row β there is exactly one vertex to its right: exactly one x>α with (x,β) ∈ U. Then color (4,α) is unique in G[U] and is realized by the horizontal edge between (α,β) and that unique (x,β).\n- Proof. By Claim 4, only row β contributes and contributes h_β(α)=1. QED.\n\nThese are small but useful “certificates” of uniqueness of types 3–4 in concrete and checkable configurations that appear frequently when U is sparse along some row/column.\n\n### Previously stated and retained tools\n\n- Lemma A (antichain ⇒ unique type 2). Fully applies as stated in the prompt; it gives a robust way to certify a unique type–2 color when U itself is an antichain.\n- Lemma B (exactly one NE neighbor ⇒ unique type 1). Fully applies as stated; it certifies a unique type–1 color.\n\n### Verified special cases of the main theorem\n\nThe following sharpen the landscape of configurations for which the theorem is already settled by our toolkit.\n\nProposition P1 (All three-point sets U satisfy the theorem). For any U with |U|=3, there exists a uniquely colored edge in G[U].\n- Proof. Case split.\n  - If all 3 lie on a common row, say x_1<x_2<x_3 with common y, then the horizontal edges have colors (4,x_1),(4,x_1),(4,x_2). Thus (4,x_2) appears exactly once.\n  - If all 3 lie on a common column, similarly we obtain uniqueness via type 3: the vertical edges have colors (3,y_1),(3,y_1),(3,y_2) with y_1<y_2<y_3, so (3,y_2) is unique.\n  - Otherwise, not all three share a row or a column. If some pair shares a row, we are in the first subcase with only two on the row: then their edge has color (4,α_left) and no other edge has that color (because there is no third vertex in that same row to form a second edge with left endpoint α_left). Hence unique.\n    Likewise, if some pair shares a column, type 3 gives uniqueness.\n  - Finally, assume all three have distinct x- and y- coordinates. Order by x: p_1=(x_1,y_1), p_2=(x_2,y_2), p_3=(x_3,y_3) with x_1<x_2<x_3 and y_i all distinct.\n    • If y_1<y_2<y_3 (increasing), then p_2p_3 is type 1 with color (1,x_2,y_2), and no other edge in U bears that color (since the only possible SW endpoint yielding (1,x_2,y_2) would be (x_2,y_2), which is p_2 itself; but the other edges use p_1 as SW endpoint and thus have color (1,x_1,y_1)). Hence (1,x_2,y_2) is unique.\n    • If y_1>y_2>y_3 (decreasing), then U is an antichain. Lemma A applies: p_2p_3 has color (2,x_2,y_3) and is unique because r_U(x_2,y_3)=s_U(x_2,y_3)=1 with only p_2 above in column x_2 and only p_3 to the right in row y_3.\n    • For the remaining permutations (132, 213, 231, 312), at least one consecutive pair in x-order is of type 2 with the other point in that row/column uniquely positioned. For instance, for 132 (y_1<y_3<y_2), the edge p_2p_3 is type 2 with label (2,x_2,y_3), and exactly one point lies above (x_2,y_3) in column x_2 (namely p_2) and exactly one lies to the right of (x_2,y_3) in row y_3 (namely p_3). Hence unique. The three other patterns are symmetric variants.\n  In all cases a unique color exists. QED.\n\nProposition P2 (Three-or-more on a line). If some row (or some column) contains at least 3 points of U, then G[U] has a uniquely colored edge of type 4 (respectively, type 3).\n- Proof. For a row with x_1<⋯<x_k and k≥3, the multiset of colors over horizontal edges on that row is { (4,x_1) repeated k−1 times, (4,x_2) repeated k−2 times, …, (4,x_{k−1}) once }. Then (4,x_{k−1}) is unique. Vertical is analogous.\n\nProposition P3 (Singleton row/column with one extension gives unique 3/4). Lemmas E and F provide immediate certificates of uniqueness when a row (resp. column) has exactly one point and the corresponding column (resp. row) contains exactly one extension in the necessary direction.\n\nThese cover a large family of sparse/structured U and will be used as base cases in an inductive or decomposition argument.\n\n### Ideas toward the general case (and obstacles)\n\n- Idea: Two-phase dichotomy via types 1 and 2. Try to show: unless we can certify uniqueness via types 3–4 using Lemmas E–F or via Proposition P2, we must find either a vertex with exactly one NE neighbor (unique type 1) or an L-corner (α,β) with r_U(α,β)=s_U(α,β)=1 (unique type 2). This would reduce the full theorem to a rigorous structural analysis of the “no uniqueness via 3–4 and no single-NE” regime.\n\n- Attempted approach (minimal elements layering). Let L_0 be the set of minimal elements (in the product order), remove it, let L_1 be the minimals of the remainder, etc. Each L_t is an antichain. Consecutive points in L_t in x-order give candidate labels (2, α, β) with α from the left point and β from the right point. In the induced subgraph on L_t alone, these are unique; the challenge is to control r_U(α,β) and s_U(α,β) against points in other layers. The obstacle is that higher layers can add extra points in the same column above β or in the same row to the right of α, inflating r or s beyond 1. A clean “separation” invariant is needed.\n\n- Obstacles encountered:\n  1) Minimal-color lexicographic arguments fail: the minimal color in lex order need not be unique (e.g., points on a strictly increasing chain yield repeated (1,α,β) from a single SW endpoint with multiple NE neighbors).\n  2) Using an antichain subset S⊆U directly is insufficient: uniqueness of a type–2 color witnessed inside S can be destroyed by extra points of U in the witnessing column/row.\n\n- Concrete plan to proceed:\n  1) Strengthen the layering approach by marking, for each antichain layer L_t, its “x-successor gaps”: for consecutive m_i=(x_i,y_i), m_{i+1}=(x_{i+1},y_{i+1}), record (α,β)=(x_i,y_{i+1}). Investigate sufficient conditions ensuring r_U(α,β)=s_U(α,β)=1, e.g., emptiness of a certain open rectangle or “top-of-column/rightmost-in-row” properties. Goal: a lemma of the form “If no vertex has exactly one NE neighbor and no line has ≥3 points, then some such (α,β) is 1×1.”\n  2) Develop a counting contradiction in the regime where all type–1 colors have multiplicity 0 or ≥2 and all type–2 colors have multiplicity 0 or ≥2, while also forbidding the 3–4 uniqueness witnesses (P2, Lemma E, Lemma F). The aim is to show this regime cannot persist.\n\n### Small additional lemmas (useful triggers)\n\nLemma G (2×2 pure rectangle with clean margins ⇒ unique type 2). Suppose U contains exactly the four corners of a rectangle {(x_1,y_1),(x_1,y_2),(x_2,y_1),(x_2,y_2)} with x_1<x_2 and y_1<y_2, and contains no other point in column x_1 above y_1 and no other point in row y_1 to the right of x_1. Then the type–2 color (2,x_1,y_1) is unique.\n- Proof. Here r_U(x_1,y_1)=1 (only (x_1,y_2) above) and s_U(x_1,y_1)=1 (only (x_2,y_1) to the right), so multiplicity is 1 by Claim 2. QED.\n- Why useful: it isolates a frequent local pattern certifying uniqueness of type 2 without requiring the whole U to be an antichain.\n\n### Examples that probe edge cases\n\n- Example 1 (type–3 uniqueness via Lemma E). U = { (2,1), (2,3), (5,5) }. Row β=1 has a singleton at (2,1); column 2 has exactly one point above (2,3). Thus color (3,1) is unique (edge (2,1)–(2,3)).\n- Example 2 (type–4 uniqueness via Lemma F). U = { (1,4), (3,4), (2,2) }. Column α=1 is a singleton at (1,4); row 4 has exactly one to the right (3,4). Hence (4,1) is unique.\n- Example 3 (failure of naive minimal-color). U = { (1,1), (2,2), (3,3) }. Minimal color (1,1,1) occurs twice ((1,1)–(2,2) and (1,1)–(3,3)). Nevertheless, edge (2,2)–(3,3) has unique color (1,2,2), illustrating the need to look beyond the absolute minimal label.\n\n### Next steps (concrete and checkable)\n\n1) Formalize a “gap lemma” on antichain layers: Given L_t and consecutive m_i=(x_i,y_i), m_{i+1}=(x_{i+1},y_{i+1}), identify simple, verifiable conditions on U ensuring r_U(x_i,y_{i+1})=s_U(x_i,y_{i+1})=1 (e.g., that m_i is topmost in column x_i and m_{i+1} is rightmost in row y_{i+1}). Prove that if no such witness exists across all layers, then a vertex with exactly one NE neighbor must exist or a 3/4 uniqueness trigger (P2, E, F) is present.\n\n2) Extend the complete verification from |U|=3 to |U|=4 by case analysis, using P2, E, F, Lemma G, and Lemmas A–B. This builds confidence in the global dichotomy and may suggest an inductive invariant.\n\n3) Explore a parity/counting contradiction: Sum over β of T_3(β) and over α of T_4(α) under the assumption that none equals 1, while also controlling the sums of type–1 and type–2 multiplicities when “=1” is forbidden. The goal is to force at least one label to have multiplicity 1.\n\nSummary of progress.\n- I established precise, global multiplicity formulas for types 3–4 (Claims 3–4), yielding crisp uniqueness criteria and simple, usable triggers (Lemmas E–F).\n- I provided complete, rigorous proofs for the theorem in nontrivial families: all |U|=3 sets (Proposition P1), any row/column with ≥3 points (Proposition P2), and the local 2×2-with-clean-margins pattern (Lemma G).\n- I identified the key obstacle in extending antichain-based arguments to arbitrary U and outlined a concrete plan to tackle the remaining general case via layered antichains and counting.\n"
}