{
  "summary_md": "Round 0004 produced a suite of rigorous, checkable lemmas that settle many base cases and clarify the remaining obstruction. Exact global multiplicity formulas were proved for all four edge types: type-1 equals the number of NE neighbors of its SW endpoint; type-2 multiplicity is r_U(α,β)·s_U(α,β); types 3 and 4 are given by explicit row/column sums, yielding necessary-and-sufficient uniqueness tests. Single-row/column lemmas (C1/C2, E/F) and the unique-maximal lemma (C3) are proved and used. For multiple maxima, Lemma D shows a clean gap (R_i=S_i=1) between consecutive maxima gives a unique type-2 color. Theorem verified on many structured families (all |U|=3, any row/column with ≥3 points, certain 2×2 ‘‘clean margin’’ rectangles). Main remaining obstacle: configurations with |Max(U)|≥2 where every consecutive pair has at least one of R_i,S_i>1. Next steps propose a gap-dichotomy or symmetric minimal-element approach and counting checks on worst-case ‘‘staircase’’ examples. Citations: prover-01.out.json, prover-02.out.json.",
  "highlights": [
    "Exact multiplicity formulas for types 1–4 (type-1 = #NE neighbors; type-2 = r_U(α,β)·s_U(α,β); types 3/4 given by explicit row/column sums).",
    "Types 3/4 uniqueness criteria and single-row/column certificates (Lemmas C1/C2 and E/F) that give immediate unique edges in many sparse cases.",
    "Unique-maximal case resolved (Lemma C3): if |Max(U)|=1 then G[U] contains a uniquely colored edge.",
    "Clean-gap Lemma D: for consecutive maxima m_i,m_{i+1}, R_i=S_i=1 implies the type-2 color (2,x_i,y_{i+1}) is unique in G[U].",
    "Several families fully settled: all |U|=3 sets (Prop. P1); any row/column with ≥3 points (Prop. P2); 2×2 rectangle with clean margins (Lemma G).",
    "Remaining unresolved regime: |Max(U)|≥2 but for every consecutive pair at least one of R_i,S_i>1 — needs a global dichotomy or counting contradiction to force a unique color. "
  ],
  "next_questions": [
    "Prove the dichotomy for |M|≥2: either some consecutive maxima satisfy R_i=S_i=1 (Lemma D applies) or find a point with exactly one NE neighbor (unique type-1 edge).",
    "If that fails, develop the symmetric minimal-element (Min(U)) dichotomy to force a unique type-3 or type-4 edge, or derive a contradiction by combining both directions.",
    "Test and refine the gap / counting arguments on small worst-case constructions (dense staircase examples) and extend the complete verification to |U|=4 as a stepping stone."
  ]
}