{
  "feedback_md": "High-level assessment and triage\n- Both provers delivered clear and useful multiplicity formulas for types 3 and 4 that match the already-standard exact formulas for types 1 and 2. These are correct and valuable: they turn informal uniqueness triggers into precise, checkable conditions.\n- Several small structural lemmas are sound and broadly applicable (single-row/column uniqueness; Lemma E/F; the type-2 “clean gap” criterion between consecutive maxima). These should be curated.\n- Two items need correction:\n  1) Prover 02’s Proposition P2 (“three-or-more on a line ⇒ a unique type-4 (or type-3) color”) is false as a global statement. Counterexample: U = {(1,1),(2,1),(3,1),(2,2),(4,2)}. Row y=1 has three points; the color (4,2) occurs on (2,1)-(3,1) and also on (2,2)-(4,2), so it is not unique. What is true is the within-row uniqueness; to conclude global uniqueness one must use the global type-4 multiplicity formula to ensure the same left x does not also occur with a right-neighbor in another row.\n  2) Prover 01’s Lemma C3 proof (unique maximal ⇒ unique color) is incomplete. The subcase S≠∅ (“points strictly SW of the unique maximum exist”) argues that a maximal p∈S has m as its only NE neighbor; this fails if there are additional NE neighbors of p on the top row or rightmost column. Concrete counterexample: U = {(3,3),(4,5),(5,5)}. Maximal m=(5,5) is unique; for p=(3,3) there are two NE neighbors: (4,5) and (5,5). However, the statement itself may well be true; it just requires a refined case split or a different witness (e.g., via the type-3/4 formulas).\n\nWhat to keep and curate\n- Exact multiplicity formulas for types 1–4 (both provers): correct and central.\n- Single row/column uniqueness lemmas when U lies entirely in one line (Prover 01’s C1/C2): correct as stated.\n- Prover 02’s Lemmas E and F (singleton row/column with exactly one extension): correct and slightly more general than C1/C2.\n- The “clean gap” lemma for consecutive maxima (Prover 01’s Lemma D): correct, immediate from the type-2 formula.\n- Proposition P1 (all |U|=3): appears correct; the proof is sound under a full case split; we retain it with a slightly more explicit justification to avoid the pitfall that arose in P2.\n- Lemma G (2×2 rectangle with clean margins): correct, a direct application of the type-2 formula.\n\nWhat to correct/remove\n- Remove/flag P2 (three-or-more on a line ⇒ unique type-4/3) as stated; only the within-row uniqueness is guaranteed. Store the counterexample in notes.\n- Do not curate Lemma C3 as proven; store the gap and a refined plan. A plausible path is: in the unique-maximal case, either the top row or rightmost column (or both) yields a global type-3/4 unique color via the exact formulas; if not, arrange a point p in S whose NE neighbors are constrained to be within S, giving unique type 1. This needs a careful choice of p (e.g., maximizing both coordinates within S) and an explicit elimination of NE neighbors on the top row/right column.\n\nSuggested next steps (concrete)\n1) Finish the unique-maximal case rigorously: prove a correct version of Lemma C3. Suggested structure: Let m=(X,Y) be the unique maximal. First show X=max_x(U), Y=max_y(U). If either the top row Y or rightmost column X contributes T4(α)=1 or T3(β)=1 by the global formulas, we are done. Otherwise, both the top row and right column fail uniqueness in the specific senses required by Claims 3–4; show that then there exists p∈S with exactly one NE neighbor (necessarily m), using that no extra NE neighbors can come from rows y=Y or column x=X under the failure conditions. Make this precise.\n2) Work the |Max(U)|≥2 regime with the maxima sequence m_i=(x_i,y_i). Either R_i=S_i=1 for some i (unique type 2 via Lemma D), or else for every i at least one of R_i,S_i≥2. Try to force in the latter case one of the type-3/4 triggers (E/F) or a point with exactly one NE neighbor. A promising tactic: select the minimal y among all rows y_{i+1} for which S_i≥2, or the minimal “extra” above some y_{i+1} for which R_i≥2, and show this minimality yields a singleton row/column with exactly one extension.\n3) Record and prove small robust triggers like Lemma G; build a library of “local witnesses” (e.g., sparse L-corners) to be searched in an algorithmic pass. Validate on dense staircase configurations to refine the necessary minimality conditions.\n\nCuration plan\n- I have added exact type-3/4 multiplicity formulas and the safe uniqueness triggers (single-line, singleton+extension), the antichain type-2 lemma, the consecutive-maxima “clean gap” lemma, and the |U|=3 proposition to output.md with full proofs. I have flagged P2 as false in notes with a counterexample and documented the gap in Lemma C3 together with a roadmap to fix it.",
  "new_notes_md": "Setup and terminology.\n- U ⊆ [n]×[n]. For p=(x,y) and q=(x',y'), say q is NE of p if x'>x and y'>y, and q is SE of p if x'>x and y'<y. Let G[U] be the graph on vertex set U with one edge for every unordered pair {p,q}. Each edge receives one of four types:\n  • Type 1 (NE–SW): endpoints differ in both coordinates and one is NE of the other. The color label is (1,α,β) with α = min{x,x'} and β = min{y,y'}; equivalently the SW endpoint’s coordinates.\n  • Type 2 (NW–SE): endpoints differ in both coordinates and one is NW of the other. The color label is (2,α,β) with α = min{x,x'} (the NW x) and β = min{y,y'} (the SE y).\n  • Type 3 (vertical): same x; the color label is (3,β) where β = min{y,y'} (the lower y).\n  • Type 4 (horizontal): same y; the color label is (4,α) where α = min{x,x'} (the left x).\n\nExact multiplicities (global; now established).\n- Type 1: For (α,β)∈U, the multiplicity of color (1,α,β) equals the number of NE neighbors of (α,β) in U. No edge receives label (1,α,β) unless (α,β)∈U.\n- Type 2: For any (α,β)∈[n]^2, set r_U(α,β)=# { (α,y)∈U : y>β } and s_U(α,β)=# { (x,β)∈U : x>α }. Then the multiplicity of color (2,α,β) equals r_U(α,β)·s_U(α,β). In particular it is unique iff r_U(α,β)=s_U(α,β)=1.\n- Type 3: For any β, the multiplicity of (3,β) equals T_3(β)=∑_α 1_{(α,β)∈U} · # { (α,y)∈U : y>β }. It is unique iff exactly one α contributes and contributes 1.\n- Type 4: For any α, the multiplicity of (4,α) equals T_4(α)=∑_β 1_{(α,β)∈U} · # { (x,β)∈U : x>α }. It is unique iff exactly one β contributes and contributes 1.\n\nSafe uniqueness triggers (now established).\n- Single-line uniqueness: If U⊆[n]×{y0} with |U|≥2, list its x-coordinates x_1<⋯<x_m. Then the edge between (x_{m−1},y0) and (x_m,y0) is the only edge in G[U] colored (4,x_{m−1}). Dually, if U⊆{x0}×[n] with |U|≥2, then the edge between (x0,y_{m−1}) and (x0,y_m) is the only edge colored (3,y_{m−1}).\n- Singleton+extension uniqueness (global): If a row β contains exactly one vertex (α,β) and in column α there is exactly one vertex above it, then (3,β) is unique. Dually, if a column α contains exactly one vertex (α,β) and in row β there is exactly one vertex to its right, then (4,α) is unique. These follow immediately from the type-3/4 formulas.\n- Antichain ⇒ unique type 2: If U is an antichain (no two share a row or a column), then ordering its points by increasing x (hence decreasing y), any consecutive pair (x_i,y_i),(x_{i+1},y_{i+1}) yields r_U(x_i,y_{i+1})=s_U(x_i,y_{i+1})=1, hence (2,x_i,y_{i+1}) is unique.\n- Clean gap between consecutive maxima: Let M=Max(U) in the product order, list M as (x_1,y_1),…,(x_k,y_k) with x_1<⋯<x_k and y_1>⋯>y_k. For i∈{1,…,k−1} set R_i=# { (x_i,y)∈U : y>y_{i+1} } and S_i=# { (x,y_{i+1})∈U : x>x_i }. If R_i=S_i=1, then the color (2,x_i,y_{i+1}) is unique.\n- 2×2 rectangle with clean margins: If U contains the four corners of {(x_1,y_1),(x_1,y_2),(x_2,y_1),(x_2,y_2)} with x_1<x_2, y_1<y_2 and has no other point in column x_1 above y_1 and no other point in row y_1 to the right of x_1, then (2,x_1,y_1) is unique.\n- All three-point sets: If |U|=3, then G[U] has a uniquely colored edge. (Full case analysis is recorded in output.)\n\nCorrections and counterexamples.\n- “Three or more on a row/column ⇒ unique type 4/3” is false without further global conditions. Counterexample: U = {(1,1),(2,1),(3,1),(2,2),(4,2)}. On row y=1 we get a single occurrence of (4,2) within that row, but globally (4,2) occurs again on row y=2 (edge (2,2)–(4,2)). One must apply the global T_4(α) formula across all rows.\n- Gap in “unique maximal ⇒ unique color” (as previously sketched). The subcase S≠∅ must rule out extra NE neighbors lying on the top row or rightmost column. Example showing the gap: U = {(3,3),(4,5),(5,5)}. Here p=(3,3) has two NE neighbors (4,5) and (5,5). A correct proof should either find a different witness (types 3/4 via T_3/T_4) or choose p to avoid such extra NE neighbors. This remains an open item to be fixed.\n\nOpen directions.\n1) Complete the unique-maximal case rigorously, as outlined above (identify conditions under which T_3/T_4 already gives uniqueness; otherwise find p∈S with unique NE neighbor).\n2) For |Max(U)|≥2, either certify a clean gap (R_i=S_i=1) for some consecutive pair, or force a type-3/4 trigger (singleton+extension) or a unique type-1 via a minimality argument on the “extra” points counted by R_i−1 and S_i−1.\n3) Extend the small-case verification from |U|=3 to |U|=4 to stress-test the dichotomies and expose the right minimality invariants.\n",
  "new_notes_append": "True",
  "new_outputs_md": "Setup and notation\n- U ⊆ [n]×[n]. For p=(x,y) and q=(x',y'), say q is NE of p if x'>x and y'>y, and q is SE of p if x'>x and y'<y. G[U] has an (undirected) edge for every unordered pair {p,q}⊆U, each labeled by one of four types and a color as follows:\n  • Type 1 (NE–SW): if one endpoint is NE of the other. Color (1,α,β) with α = min{x,x'} and β = min{y,y'} (coordinates of the SW endpoint).\n  • Type 2 (NW–SE): if one endpoint is NW of the other. Color (2,α,β) with α = min{x,x'} (the NW x) and β = min{y,y'} (the SE y).\n  • Type 3 (vertical): if x=x'. Color (3,β) with β = min{y,y'} (the lower y).\n  • Type 4 (horizontal): if y=y'. Color (4,α) with α = min{x,x'} (the left x).\n\nTheorems currently established\n1) Exact multiplicity formulas for types 1–4.\n2) Single-line uniqueness: If U lies in a single row (resp. a single column) and has at least two points, then G[U] has a uniquely colored edge of type 4 (resp. type 3).\n3) Singleton+extension triggers: A singleton row (resp. singleton column) with exactly one extension above (resp. to the right) forces a unique type-3 (resp. type-4) color.\n4) Antichain ⇒ a unique type-2 color.\n5) Consecutive-maxima clean gap ⇒ a unique type-2 color.\n6) All three-point sets U admit a uniquely colored edge.\n\nProofs\nTheorem 1 (Exact multiplicities).\n- Type 1. Fix (α,β)∈[n]^2. An edge has color (1,α,β) iff its SW endpoint is (α,β), hence necessarily (α,β)∈U. Each NE neighbor q of (α,β) produces exactly one edge of that color, and distinct NE neighbors yield distinct edges. Conversely, any edge of that color arises this way. Therefore the multiplicity of (1,α,β) equals the number of NE neighbors of (α,β) in U.\n- Type 2. Fix (α,β)∈[n]^2 and define r_U(α,β)=# { (α,y)∈U : y>β } and s_U(α,β)=# { (x,β)∈U : x>α }. Choosing any (α,y) with y>β and any (x,β) with x>α produces a NW–SE pair whose color is (2,α,β); distinct choices yield distinct edges of that color. Conversely, any edge of color (2,α,β) has its NW endpoint on the vertical ray { (α,y) : y>β } and its SE endpoint on the horizontal ray { (x,β) : x>α }. Hence the multiplicity is r_U(α,β)·s_U(α,β). In particular, uniqueness holds iff r_U(α,β)=s_U(α,β)=1.\n- Type 3. Fix β. For each α with (α,β)∈U, the lower endpoint (α,β) connects vertically to each (α,y) with y>β, contributing v_α(β)=# { (α,y)∈U : y>β } edges of color (3,β). Summing over α gives the total multiplicity T_3(β)=∑_α 1_{(α,β)∈U}·v_α(β). Uniqueness holds iff exactly one α contributes and v_α(β)=1.\n- Type 4. Fix α. For each β with (α,β)∈U, the left endpoint (α,β) connects horizontally to each (x,β) with x>α, contributing h_β(α)=# { (x,β)∈U : x>α } edges of color (4,α). Summing over β gives T_4(α)=∑_β 1_{(α,β)∈U}·h_β(α). Uniqueness holds iff exactly one β contributes and h_β(α)=1.\n\nTheorem 2 (Single-line uniqueness).\n- Row case. Suppose U⊆[n]×{y0} and |U|≥2. Let the distinct x-coordinates be x_1<⋯<x_m with m≥2. The only horizontal edges in G[U] are those between (x_i,y0) and (x_j,y0). The multiset of colors on these edges is { (4,x_1) repeated m−1 times, (4,x_2) repeated m−2 times, …, (4,x_{m−1}) once }. In particular, (4,x_{m−1}) occurs exactly once in G[U].\n- Column case. The vertical analogue holds by symmetry: if U⊆{x0}×[n] with |U|≥2 and y_1<⋯<y_m, then (3,y_{m−1}) occurs exactly once.\n\nTheorem 3 (Singleton+extension triggers).\n- If a row β contains exactly one point (α,β)∈U and in column α there is exactly one point (α,y) with y>β, then by Theorem 1 (type 3) we have T_3(β)=1 and hence the color (3,β) is unique. The column/row dual gives the type-4 trigger.\n\nTheorem 4 (Antichain ⇒ unique type 2).\n- Assume U is an antichain (no two share a row or a column). List U as (x_1,y_1),…,(x_m,y_m) in increasing x, which forces y_1>y_2>⋯>y_m. For any i∈{1,…,m−1} consider (α,β)=(x_i,y_{i+1}). In column α there is exactly one point above β, namely (x_i,y_i); in row β there is exactly one point to the right of α, namely (x_{i+1},y_{i+1}). Thus r_U(α,β)=s_U(α,β)=1, and by Theorem 1 (type 2) the color (2,α,β) is unique.\n\nTheorem 5 (Consecutive-maxima clean gap ⇒ unique type 2).\n- Let M=Max(U) under the product order, listed as m_i=(x_i,y_i) with x_1<⋯<x_k and y_1>⋯>y_k (k≥2). For i∈{1,…,k−1} define R_i=# { (x_i,y)∈U : y>y_{i+1} } and S_i=# { (x,y_{i+1})∈U : x>x_i }. If R_i=S_i=1, then with (α,β)=(x_i,y_{i+1}) we have r_U(α,β)=R_i and s_U(α,β)=S_i, hence r_U·s_U=1 and color (2,α,β) is unique by Theorem 1 (type 2).\n\nTheorem 6 (All three-point sets admit a uniquely colored edge).\n- Let U have three distinct points.\n  • If all three lie on a common row, with x_1<x_2<x_3, the three horizontal edges on that row have colors (4,x_1),(4,x_1),(4,x_2), so (4,x_2) is unique.\n  • If all three lie on a common column, the vertical analogue yields a unique (3,y_2).\n  • Otherwise, if some pair lies on a row (resp. column) but not all three do, the edge of that pair has a type-4 (resp. type-3) color that cannot be duplicated elsewhere in U because there is no second edge on that same row (resp. column).\n  • Finally, if all x- and y-coordinates are distinct, order by x: p_1=(x_1,y_1),p_2=(x_2,y_2),p_3=(x_3,y_3).\n    – If y_1<y_2<y_3, then p_2p_3 is type 1 with color (1,x_2,y_2) and is unique (its SW endpoint is p_2, which has exactly one NE neighbor, namely p_3).\n    – If y_1>y_2>y_3, then p_2p_3 is type 2 with label (2,x_2,y_3) and is unique since r_U(x_2,y_3)=s_U(x_2,y_3)=1.\n    – In each of the remaining permutations of (y_1,y_2,y_3), one of the consecutive pairs in x-order forms a type-2 edge (NW–SE) with exactly one point above the L-corner in its column and exactly one point to the right on its row, giving a unique type-2 color by Theorem 1 (type 2). Hence at least one unique color exists in all cases.\n",
  "new_outputs_append": "True",
  "verdict": "success"
}