{
  "progress_md": "## Gaps in output.md\n- The LP approach is stated but lacks a precise, sample-to-decision bound (no explicit Lipschitz/sensitivity constant). This blocks turning it into a polynomial-sample certifier.\n- For K = 3, an exact minimal-augmentation formula allowing mixed added ballots is missing; only a counterexample to c-first exactness is given.\n\n## Ideas\n- Give an explicit LP for a fixed elimination order π, derive its dual, and prove a coarse but explicit Lipschitz bound O(K^2) for the optimal value with respect to uniform perturbations of the RHS tallies b = {t_a(S_j)}. This yields a polynomial-in-K sample bound for any fixed π.\n- For K = 3 and target winner c, derive a closed-form expression for the exact minimal added mass under each of the two feasible “first elimination” strategies (eliminate a first vs eliminate b first), then take the minimum. This uses only t_a({a,b,c}) and pairwise t_c({c,a}), t_c({c,b}).\n\n## Results (checkable lemmas/propositions)\n\nLemma 1 (LP for a fixed elimination order and its dual).\nFix π ∈ Perm(C), and let S_j = {π(j),…,π(K)}. Introduce variables y(r) ≥ 0 for each full ranking r, and set total mass ||y||_1 = ∑_r y(r). For each j ∈ {1,…,K−1} and a ∈ S_j \\ {π(j)}, define the constraint\n∑_r y(r) [1[top_{S_j}(r)=a] − 1[top_{S_j}(r)=π(j)]] ≥ t_{π(j)}(S_j) − t_a(S_j).\nMinimize ||y||_1 subject to all constraints and y ≥ 0. Denote the optimal value by v_π(t).\nIts dual is\nmaximize ∑_{j} ∑_{a≠π(j)} λ_{j,a} [t_{π(j)}(S_j) − t_a(S_j)]\nsubject to for all rankings r: ∑_{j} (λ_{j, top_{S_j}(r)} − λ_{j,π(j)} 1[top_{S_j}(r)=π(j)]) ≤ 1, and λ ≥ 0.\nWhy useful: v_π(t) gives the exact minimal augmentation to realize π, and the dual yields sensitivity bounds.\n\nLemma 2 (Coarse sensitivity bound for fixed π).\nLet M = ∑_{j=1}^{K−1} (|S_j|−1) = K(K−1)/2 be the number of constraints. If the RHS vector b = {t_{π(j)}(S_j) − t_a(S_j)} is perturbed by at most τ in sup norm, then v_π changes by at most M τ: for all b,b′ with ||b−b′||_∞ ≤ τ,\n|v_π(b) − v_π(b′)| ≤ M τ.\nProof sketch: Given a primal feasible y for b, to satisfy b′ ≥ b coordinate-wise by ≤ τ, add for each constraint (j,a) an extra τ mass on any ranking r with top_{S_j}(r)=a and top_{S_j}(r)≠π(j). This increases that constraint’s LHS by τ without decreasing any other; summing over all M constraints adds total mass M τ and yields feasibility for b′. Symmetrically for b ≥ b′. Thus the optimal value is M-Lipschitz in ||·||_∞.\nWhy useful: Converts uniform estimation error τ of the involved tallies into ≤ M τ error in the LP optimum; gives a polynomial-in-K sample bound for certifying a fixed π.\n\nProposition 3 (Exact minimal augmentation for K = 3 via two strategies).\nLet C = {a,b,c} and target winner c. Define first-round deficits against a:\nD_b := [t_a({a,b,c}) − t_b({a,b,c})]_+, D_c := [t_a({a,b,c}) − t_c({a,b,c})]_+.\nDefine pairwise deficit of c vs b: m_{cb} := [t_b({c,b}) − t_c({c,b})]_+ (similarly m_{ca} for c vs a).\nThen the exact minimal added mass needed to make c win under IRV equals\nmin{ φ_a, φ_b }, where\nφ_a = max{ D_b + D_c, m_{cb} + 2 D_b },\nφ_b = max{ D_a′ + D_c′, m_{ca} + 2 D_a′ },\nwith D_a′ := [t_b({a,b,c}) − t_a({a,b,c})]_+, D_c′ := [t_b({a,b,c}) − t_c({a,b,c})]_+.\nProof sketch: Consider strategy “eliminate a first.” In the first round, using only b-first and c-first additions (a-first is never optimal since it raises the opposing side of the inequalities), the constraints are y_b ≥ D_b and y_c ≥ D_c, where y_x is the mass of x-first added ballots (these fully characterize top_{S} increments for S={a,b,c}). In the final between c and b, any b-first ballot ranks b over c, and any c-first ballot ranks c over b, hence the net pairwise margin change is y_c − y_b. To ensure c wins vs b, we need y_c − y_b ≥ m_{cb}. Minimizing y_b + y_c under y_b ≥ D_b, y_c ≥ D_c, y_c − y_b ≥ m_{cb} yields y_b = D_b, y_c = max{D_c, m_{cb} + D_b}, and total mass φ_a = max{D_b + D_c, m_{cb} + 2 D_b}. Feasibility is realized by choosing b>c>a for b-first and c>b>a for c-first additions (and adding an arbitrarily small slack to break ties). The symmetric argument gives φ_b.\nWhy useful: This gives an exact, closed-form characterization at K=3 using only five observable tallies, enabling tighter certifiers and sharper lower bounds/benchmarks.\n\nCorollary 4 (Sample complexity for K = 3 sandwiched certifier).\nTo decide whether min{φ_a, φ_b} ≤ ε with probability ≥ 1−δ, it suffices to estimate t_a({a,b,c}) for a ∈ {a,b,c} and t_c({c,a}), t_c({c,b}) within ±τ = Θ(ε), which requires m = Θ((log(1/δ))/ε^2) samples by Hoeffding. The map (these five scalars) ↦ min{φ_a,φ_b} is Lipschitz with constant ≤ 6 (sup norm), so choosing τ = ε/12 leaves 2τ safety margin.\n\n## Examples / sanity checks\n- Counterexample in notes: a=0.38, b=0.35, c=0.27 with m_{cb}=0 (c beats b head-to-head). D_b=0.03, D_c=0.11, so φ_a = max{0.14, 0 + 0.06} = 0.14, matching the exhibited 0.14 construction and strictly less than the c-first certificate 0.20.\n- Symmetric case: if c trails both in pairwise (m_{cb}, m_{ca} > 0) and a leads first round by Δ over both opponents (D_b=D_c=Δ), then φ_a = max{2Δ, m_{cb} + 2Δ}. If m_{cb} ≥ 0, φ_a = m_{cb} + 2Δ; eliminating b first analogously yields φ_b = m_{ca} + 2Δ; choose the smaller.\n\n## Obstacles / caveats\n- Lemma 2’s Lipschitz constant M = K(K−1)/2 is crude and likely very loose; improving it (e.g., to O(K)) would strengthen sample bounds for the LP approach.\n- The LP-based certifier still requires selecting or searching over elimination orders π; naive enumeration is infeasible. A data-driven pruning of candidate orders is needed.\n- For K > 3, deriving similarly clean closed forms seems challenging; however, the fixed-π LP and Lemma 2 already provide a path to polynomial-in-K sample complexity per candidate order.\n\n## Next steps\n- Prove rigorously that a-first additions are dominated in the K=3 optimization (tightening Proposition 3’s proof) and document tie-breaking slack handling.\n- Extend the K=3 formula to include the case where c’s pairwise ties occur; incorporate an explicit ξ > 0 slack and show limits as ξ → 0^+ recover the stated form.\n- For general K and fixed π, attempt to improve the Lipschitz constant using the dual by bounding sup_{λ feasible} ||λ||_1, potentially via combinatorial properties of the top_{S_j} structure (aim for O(K)).\n- Design a two-tier algorithm: (i) run the c-first certificate; (ii) if inconclusive, infer a shortlist of plausible first eliminations or orders from estimated t_a(S) (e.g., candidates with small first-round deficits), and solve the corresponding LPs with confidence intervals propagated using Lemma 2.\n- Explore K-dependent lower bounds using Fano/packing over profiles differing on disjoint sets of S’s tallies; start with top-of-triplet events to get Ω((log K)/ε^2).\n"
}