{
  "progress_md": "## Ideas\n- K = 3 exact minimal-augmentation with mixed additions: Give a closed-form expression for the minimum total added mass to make a target candidate c win that allows mixtures of c-first and one other candidate-first ballots. This addresses the counterexample and yields a sharper, sample-efficient certifier in the 3-candidate case.\n- LP for a fixed elimination order π: formalize primal and dual, isolate the sensitivity constant as sup ||λ||₁ over the dual feasible region; prove a tight, small bound for K = 3 and lay out what remains for general K.\n\n## Lemma (K = 3: exact two-type reduction for a targeted first elimination)\nSetup: Candidates {a,b,c}. We seek to make c the IRV winner by forcing a to be eliminated in round 1 and then ensuring c defeats b in the final. Let γ > 0 be an arbitrarily small slack (to remove tie-breaking dependence). Define tallies under the baseline profile P:\n- First-round shares: t_x(abc) for x ∈ {a,b,c}.\n- Pairwise shares on {b,c}: t_b(bc), t_c(bc).\nLet A := [t_a(abc) − t_c(abc) + γ]_+, B := [t_a(abc) − t_b(abc) + γ]_+, D := t_b(bc) − t_c(bc) + γ. Consider only adding mass in two types: c-first ballots (amount α ≥ 0) and b-first ballots (amount β ≥ 0). Then the elimination constraints t'_a + γ ≤ t'_b and t'_a + γ ≤ t'_c become\n- β ≥ B,\n- α ≥ A,\nand the final-round constraint t'_c(bc) ≥ t'_b(bc) + γ becomes\n- α − β ≥ D.\nThe minimum total added mass α + β equals\n\nε_a^*(P) = min_{α,β ≥ 0} {α + β : α ≥ A, β ≥ B, α − β ≥ D} = B + max{A, B + D}.\n\nMoreover, for this targeted strategy (eliminate a first), an optimal augmentation exists supported on only c-first and b-first ballots; any a-first ballots are strictly dominated.\n\nWhy useful here: This yields an exact minimal mass for the “eliminate a first, then beat b” strategy and, together with the symmetric expression for eliminating b first, gives a tight K = 3 certification strictly stronger than the c-first certificate.\n\nProof sketch: The constraints follow from linearity:\n- First-round: α increases t_c(abc) by α; β increases t_b(abc) by β; t_a(abc) unchanged.\n- Final bc: α adds entirely to t_c(bc); β adds entirely to t_b(bc).\nThus α ≥ A, β ≥ B, and α − β ≥ D are necessary and sufficient for this strategy. Minimizing α + β under α ≥ max{A, β + D} and β ≥ B is achieved at the smallest β, namely β = B, giving α = max{A, B + D}. Hence ε_a^* = B + max{A, B + D}.\nDominance of a-first: Any unit of a-first mass decreases both t_b(abc) − t_a(abc) and t_c(abc) − t_a(abc) by 1, while its effect on bc pairwise is either +1 (if a-first ranks c ≻ b) or −1 (if a-first ranks b ≻ c). In the +1 case, one c-first ballot strictly improves both elimination margins and matches/improves the bc margin, so a-first is dominated by c-first. In the −1 case, one b-first ballot strictly improves the relevant elimination margin and matches the bc effect, so a-first is dominated by b-first. Therefore, a-first ballots are never optimal for the targeted elimination of a.\n\n## Corollary (K = 3: exact minimal augmentation for c)\nLet ε_A(P) := f_c(P) = max{ [min{t_a(abc), t_b(abc)} − t_c(abc)]_+, [t_a(ac) − t_c(ac)]_+, [t_b(bc) − t_c(bc)]_+ } (the c-first certificate specialized to K = 3). Define ε_a^* as above and ε_b^* symmetrically (targeting b’s first-round elimination). Then the true minimal added mass to make c win equals\n\nε^*(P;c) = min{ ε_A(P), ε_a^*(P), ε_b^*(P) }.\n\nWhy: Any winning plan in K = 3 must either (i) ensure c survives round 1 and beats the round-2 opponent (captured by ε_A), or (ii) force elimination of a in round 1 and then beat b (ε_a^*), or (iii) force elimination of b in round 1 and then beat a (ε_b^*). The two-type reduction shows (ii) and (iii) have exact costs, and a-first mass is never helpful under (ii) or (iii). Hence the minimum over these three strategies is exact.\n\nVerification on the counterexample: With t_a(abc)=0.38, t_b(abc)=0.35, t_c(abc)=0.27, and t_c(bc) − t_b(bc)=0.10 (so D = −0.10), we get A = 0.11, B = 0.03, and ε_a^* = 0.03 + max{0.11, 0.03 − 0.10} = 0.14, matching the exhibited augmentation (α,β)=(0.11,0.03).\n\n## Sampling complexity for the K = 3 certifier\nTo compute ε_A, ε_a^*, ε_b^* within ±2τ, it suffices to estimate the five numbers t_a(abc), t_b(abc), t_c(abc), t_b(bc), t_c(bc) within ±τ. Hoeffding + union bound over 5 events yields m = O((log(1/δ))/τ^2). A sound certifier: compute the plug-in values and declare c an ε-winner if min{ĥε_A, ĥε_a^*, ĥε_b^*} ≤ ε − 2τ. This provides a K = 3 sample bound m = Θ((log(1/δ))/ε^2), improving on the general K-dependent union bound.\n\n## LP for a fixed elimination order π: primal/dual and sensitivity hook\nPrimal (fixed π ending in c, slack γ>0): variables y(r) ≥ 0; minimize ∥y∥₁ subject to, for each round j and each a ∈ S_j\\{π(j)}:\n\n(t_a(S_j) − t_{π(j)}(S_j)) + ∑_r y(r)(1[top_{S_j}(r)=a] − 1[top_{S_j}(r)=π(j)]) ≥ γ.\n\nDual: maximize ∑_{j} ∑_{a≠π(j)} λ_{j,a} (γ − (t_a(S_j) − t_{π(j)}(S_j))) subject to, for every ranking r,\n\n∑_{j} ∑_{a≠π(j)} λ_{j,a} (1[top_{S_j}(r)=a] − 1[top_{S_j}(r)=π(j)]) ≤ 1, and λ ≥ 0.\n\nSensitivity: Let g_{j,a} := γ − (t_a(S_j) − t_{π(j)}(S_j)). The optimal value v(g) = max_{λ∈Λ} g^T λ is 1-Lipschitz in g with respect to the norm ∥·∥_Λ defined by sup_{λ∈Λ} |·^T λ|. A crude bound is |v(g+Δg) − v(g)| ≤ (sup_{λ∈Λ} ∥λ∥₁) ∥Δg\n∥_∞. Thus, a uniform sample bound follows once we upper-bound R_K := sup_{λ∈Λ} ∥λ∥₁ by poly(K).\n\n- For K = 3 targeted elimination (as above), the two-type reduction collapses Λ to a 2-variable dual, yielding R_3 ≤ 2 and recovering the Θ((log(1/δ))/ε^2) sample complexity.\n- For general K, deriving an explicit bound R_K = poly(K) remains open. The main obstacle is coupling across rounds in the column constraints (each ranking contributes at most one +1 per round and at most one −(∑_a λ_{j,a}) when it tops the round-j loser), so max-over-round arguments must respect consistency of tops across S_j induced by a single ranking.\n\n## Obstacles and gaps relative to output.md\n- Output.md has a sufficient c-first certificate and uniform convergence; it does not yet capture the exact mixed-addition minimality for K = 3. The above lemma/corollary fill this gap with a simple, closed-form expression matching the counterexample.\n- The LP approach is noted in the notes/output but lacks a rigorous sensitivity bound. We have formalized the dual; bounding sup ∥λ∥₁ by poly(K) is the key missing step.\n\n## Next steps\n1) Formalize and prove the K = 3 corollary in full detail (including the symmetric ε_b^* case) and add the sampling-based certifier with its tight sample complexity to output.md.\n2) Explore whether an analogous two-type (or few-type) reduction holds for K = 4 when targeting a specific first elimination and then relying on c-first thereafter; even a provable upper bound would be useful.\n3) For the LP sensitivity, attempt to construct a canonical dual feasible λ with controlled ∥λ∥₁ (e.g., geometric decay along rounds) that achieves a constant-factor approximation to the optimum; this would imply a polynomial Lipschitz constant for an approximate value function and suffice for sample complexity via a bicriteria certifier.\n4) Investigate whether M_c(P) can be bounded within a constant factor by the maximum over |S| ∈ {2,3} (if true, this would reduce the exponential dependence in the union bound). Try to find a counterexample or proof using elimination-path structure.\n"
}