{
  "feedback_md": "Overall, there is substantial progress, especially on the K = 3 case. However, a few rigor and correctness issues must be addressed before incorporating everything into output.md.\n\n1) LP formulation and sensitivity.\n- Prover 01: The stated dual in Lemma 1 is incorrect. There is no dual variable λ_{j,π(j)}; the correct dual constraint for each ranking r is ∑_{j}∑_{a≠π(j)} λ_{j,a} (1[top_{S_j}(r)=a] − 1[top_{S_j}(r)=π(j)]) ≤ 1 with λ ≥ 0, and the dual objective is ∑_{j,a} λ_{j,a}·(γ − (t_a(S_j) − t_{π(j)}(S_j))) if we move the baseline tallies to the RHS with slack γ > 0. Prover 02’s dual matches this standard form.\n- Prover 01: Lemma 2’s M = K(K−1)/2 Lipschitz/sensitivity bound obtained by fixing constraints independently (adding τ mass per constraint) is not valid. Adding mass for one constraint can decrease other constraints’ LHS when the added ranking tops the round-j′ loser π(j′). The claimed “without decreasing any other” feature does not generally hold. A valid route is the dual-norm sensitivity: |v(b+Δ) − v(b)| ≤ (sup_{λ∈Λ} ||λ||_1) ||Δ||_∞. Establishing a poly(K) bound for sup ||λ||_1 remains the key open step. For K = 3, this constant is small (≤ 2) under the two-variable reduction.\n\n2) K = 3 exact minimal augmentation.\n- Prover 01’s Proposition 3 gives a correct closed form for the strategy “eliminate a first” (and symmetrically for “eliminate b first”) and matches the counterexample. However, the proof sketch needs a rigorous dominance argument excluding a-first ballots and a clean handling of tie-breaking via a small slack γ > 0.\n- Prover 02 provides precisely these missing pieces: a two-type reduction with γ-slack, the linear constraints α ≥ A, β ≥ B, and α − β ≥ D, and the exact optimum α + β = B + max{A, B + D}. The dominance argument that a-first ballots are never optimal is sound: if an a-first ballot ranks c≻b, it is dominated by a c-first ballot; if it ranks b≻c, it is dominated by a b-first ballot. This yields an exact formula for each targeted first elimination, hence the global minimum for c is min{ε_a^*, ε_b^*}.\n- Prover 02’s corollary includes ε_A (the c-first certificate specialized to K = 3) inside a minimum with ε_a^*, ε_b^*. This is redundant: any c-wins path must eliminate either a or b first, and ε_a^*, ε_b^* are exact for those two possibilities. Moreover, one can check ε_A ≥ min{ε_a^*, ε_b^*}, so min{ε_A, ε_a^*, ε_b^*} = min{ε_a^*, ε_b^*}. Including ε_A is harmless but unnecessary.\n\n3) Sampling complexity for K = 3.\n- Both provers converge on the key point: one needs only five numbers (the three first-round shares and two pairwise tallies) to evaluate ε^*(P;c) for K = 3. Thus a Hoeffding + union bound with m = Θ((log(1/δ))/ε^2) suffices. A coarse Lipschitz bound of ≤ 6 for the plug-in map is fine; any constant works with appropriate safety margin.\n\nAction items for the next round:\n- We will add to output.md a rigorous K = 3 theorem with γ-slack, the two-type reduction, the exact formulas ε_a^*(γ), ε_b^*(γ), and the limit as γ→0^+. Include the sampling corollary specialized to K = 3.\n- Keep the general c-first certificate and uniform convergence results already in output.md (they are correct and broadly applicable), but do not add Prover 01’s Lemma 2; instead, add the correct primal/dual LP statement to notes and mark the sensitivity bound as open (per Prover 02).\n- Next steps: (i) attempt to bound sup_{λ∈Λ} ||λ||_1 by poly(K), starting with structured dual constructions; (ii) explore whether a few-type reduction extends to K = 4 for targeted first eliminations; (iii) develop K-dependent lower bounds via packing over triplet/top-of-S events.",
  "summary_md": "",
  "verdict": "partial success",
  "blocking_issues": [
    "Prover 01’s dual LP is incorrectly written.",
    "Prover 01’s coarse sensitivity bound (Mτ) is invalid; per-constraint independent fixes can decrease other constraints.",
    "General-K LP sensitivity (sup ||λ||_1 bound) remains open; we cannot yet state a polynomial sample bound for fixed π in output.md."
  ],
  "per_prover": [
    {
      "prover_id": "01",
      "brief_feedback": "Good progress on the K = 3 closed form and on formulating the LP, but the dual is misstated and the Mτ sensitivity lemma is incorrect. Please switch to the dual-norm approach for sensitivity and avoid per-constraint additive fixes. Your K = 3 formula matches the counterexample; add a formal dominance proof excluding a-first ballots and include a small γ > 0 slack.",
      "score": "promising"
    },
    {
      "prover_id": "02",
      "brief_feedback": "Excellent two-type reduction with γ-slack for K = 3; the dominance argument is sound and yields an exact formula. The LP dual is correctly stated; next, try to bound sup ||λ||_1 for general K or provide a controlled approximate scheme. The corollary’s inclusion of ε_A is redundant, but harmless.",
      "score": "promising"
    }
  ],
  "notes_update": {
    "mode": "append",
    "content_md": "## K = 3: exact minimal augmentation via two-type reduction\n\nLet C = {a,b,c} and fix target winner c. Denote first-round shares p_x := t_x({a,b,c}) and pairwise shares t_x({b,c}), t_x({a,c}). To remove dependence on tie-breaking, introduce a slack γ > 0 and require strict separations in all inequalities.\n\nTargeting elimination of a in round 1 and a c vs b final, it suffices to consider only two added ballot types: c-first (amount α ≥ 0) and b-first (amount β ≥ 0). These induce the linear constraints\n- First round: p_a + 0 ≤ p_b + β − γ and p_a + 0 ≤ p_c + α − γ, i.e.,\n  β ≥ B_γ := [p_a − p_b + γ]_+ and α ≥ A_γ := [p_a − p_c + γ]_+.\n- Final: t'_c({b,c}) ≥ t'_b({b,c}) + γ, i.e., α − β ≥ D_γ := t_b({b,c}) − t_c({b,c}) + γ.\nThe minimum total mass is then\n  ε_a^*(γ) = min_{α,β≥0} {α+β : α ≥ A_γ, β ≥ B_γ, α − β ≥ D_γ} = B_γ + max{A_γ, B_γ + D_γ}.\nBy a dominance argument, a-first additions are never optimal for this targeted strategy: if an a-first ballot ranks c ≻ b, it is dominated by a c-first ballot (strictly improves both elimination inequalities and matches the bc margin); if it ranks b ≻ c, it is dominated by a b-first ballot (improves the relevant elimination inequality and matches the bc margin). The symmetric expression ε_b^*(γ) is obtained by swapping a and b. The exact minimal augmentation to make c win is\n  ε^*(γ; c) = min{ε_a^*(γ), ε_b^*(γ)}, and ε^*(c) = lim_{γ→0^+} ε^*(γ; c).\nThis matches the counterexample in the notes (a=0.38, b=0.35, c=0.27 with c beating b head-to-head): A_0=0.11, B_0=0.03, D_0=−0.10, hence ε_a^*(0) = 0.03 + max{0.11, −0.07} = 0.14.\n\nSampling for K = 3: Computing ε^*(γ; c) requires only five tallies: p_a, p_b, p_c, t_c({b,c}), t_c({a,c}). A Hoeffding + union bound over these five quantities gives m = Θ((log(1/δ))/ε^2) samples to decide whether ε^*(c) ≤ ε with probability ≥ 1 − δ.\n\n## LP approach: primal/dual and sensitivity status (general K)\n\nFor a fixed elimination order π with remaining sets S_j = {π(j),...,π(K)}, add slack γ > 0 and consider variables y(r) ≥ 0 over rankings r. The primal is\n- Minimize ∥y∥_1 subject to, for each j and a ∈ S_j \\ {π(j)}:\n  (t_a(S_j) − t_{π(j)}(S_j)) + ∑_r y(r)(1[top_{S_j}(r)=a] − 1[top_{S_j}(r)=π(j)]) ≥ γ.\nMoving baseline tallies to the RHS gives constraints Ay ≥ b, with b_{j,a} = γ − (t_a(S_j) − t_{π(j)}(S_j)). The dual is\n- Maximize ∑_{j}∑_{a≠π(j)} λ_{j,a}·(γ − (t_a(S_j) − t_{π(j)}(S_j))) subject to, for every ranking r,\n  ∑_{j}∑_{a≠π(j)} λ_{j,a}(1[top_{S_j}(r)=a] − 1[top_{S_j}(r)=π(j)]) ≤ 1, and λ ≥ 0.\nSensitivity: v(b) = max_{λ∈Λ} b^T λ is 1-Lipschitz in the dual norm: |v(b+Δ) − v(b)| ≤ (sup_{λ∈Λ} ∥λ∥_1) ∥Δ∥_∞. Bounding R_K := sup_{λ∈Λ} ∥λ∥_1 by poly(K) would yield a polynomial-in-K sample bound for certifying a fixed π. For K = 3, the two-type reduction collapses Λ to two variables, giving R_3 ≤ 2. For general K, obtaining a good bound on R_K remains open; the per-constraint additive mass approach is invalid because a single added ranking can decrease other constraints when it tops the round-j loser.\n\n## Checklist / next steps\n- Formalize the K = 3 theorem and sampling corollary in output.md.\n- Keep general c-first certifier and uniform convergence in output.md; use the K = 3 exact result when K = 3.\n- Pursue a dual-based sensitivity bound sup_{λ∈Λ} ∥λ∥_1 = poly(K) or an approximate scheme with provable stability.\n- Investigate few-type reductions for K ≥ 4 when targeting specific first eliminations."
  },
  "output_update": {
    "mode": "append",
    "content_md": "Theorem 5 (K = 3: exact minimal augmentation to make a target c win under IRV).\nLet C = {a,b,c} and fix a target winner c. Write first-round shares p_x := t_x({a,b,c}) for x ∈ {a,b,c}, and pairwise tallies t_x({b,c}) and t_x({a,c}). Fix a deterministic tie-breaking rule and introduce a slack parameter γ > 0 to enforce strict separations so that tie-breaking is irrelevant.\n\nDefine, for the strategy that eliminates a in round 1 and then pits c against b in the final,\n- A_γ := [p_a − p_c + γ]_+,\n- B_γ := [p_a − p_b + γ]_+,\n- D_γ := t_b({b,c}) − t_c({b,c}) + γ.\nLet ε_a^*(γ) be the minimum total mass of added ballots required to realize this strategy. Then\n  ε_a^*(γ) = B_γ + max{A_γ, B_γ + D_γ}.\nSymmetrically, for the strategy that eliminates b first and then pits c against a, with\n- A'_γ := [p_b − p_c + γ]_+,\n- B'_γ := [p_b − p_a + γ]_+,\n- D'_γ := t_a({a,c}) − t_c({a,c}) + γ,\nwe have\n  ε_b^*(γ) = B'_γ + max{A'_γ, B'_γ + D'_γ}.\nConsequently, the exact minimal total added mass to make c the IRV winner with strict margins γ is\n  ε^*(γ; c) = min{ε_a^*(γ), ε_b^*(γ)},\nand the exact minimal augmentation without slack is ε^*(c) = lim_{γ→0^+} ε^*(γ; c).\n\nProof.\nConsider the strategy targeting a’s elimination in round 1 and a final between c and b. It suffices to consider added ballots of only two types: c-first ballots (total mass α ≥ 0) and b-first ballots (total mass β ≥ 0). Indeed, any added a-first ballot either ranks c ≻ b, in which case a c-first ballot strictly improves both first-round inequalities (it raises p_c and leaves p_b unchanged while an a-first raises p_a) and matches the bc final margin; or it ranks b ≻ c, in which case a b-first ballot strictly improves the relevant first-round inequality (it raises p_b while an a-first raises p_a) and matches the bc final margin. Thus a-first ballots are strictly dominated and never appear in an optimal solution.\nUnder α and β, the first-round tallies become p'_a = p_a, p'_b = p_b + β, and p'_c = p_c + α. Enforcing that a is strictly below both b and c in round 1 yields α ≥ A_γ and β ≥ B_γ. In the final between b and c, each added c-first ballot contributes 1 to t'_c({b,c}) and each added b-first ballot contributes 1 to t'_b({b,c}); hence t'_c({b,c}) − t'_b({b,c}) = (t_c({b,c}) − t_b({b,c})) + (α − β). The strict final-round win requires α − β ≥ D_γ. Therefore the feasible region is exactly\n  { (α,β) ∈ R_+^2 : α ≥ A_γ, β ≥ B_γ, α − β ≥ D_γ }.\nMinimizing α + β over this polyhedron is achieved at β = B_γ and α = max{A_γ, B_γ + D_γ}, yielding ε_a^*(γ) = B_γ + max{A_γ, B_γ + D_γ}. The expression for ε_b^*(γ) follows symmetrically. Any winning IRV run with three candidates must eliminate either a or b in the first round and then elect c in the final; hence the minimal total added mass is the minimum of the two strategy optima. Finally, sending γ → 0^+ gives ε^*(c).\n\nCorollary 6 (Sampling complexity for K = 3 exact certifier).\nFix ε, δ ∈ (0,1). Let \\hat p_x, \\widehat{t}_x({b,c}), \\widehat{t}_x({a,c}) be empirical estimates of p_x and the pairwise tallies from m i.i.d. ballots. There exists a universal constant c such that if\n  m ≥ c · (log(5/δ)) / τ^2,\nthen with probability at least 1 − δ we have sup error ≤ τ simultaneously for the five quantities {p_a, p_b, p_c, t_c({b,c}), t_c({a,c})}. The maps (p_a,p_b,p_c,t_c({b,c}),t_c({a,c})) ↦ ε_a^*(γ), ε_b^*(γ), and ε^*(γ; c) are Lipschitz with a universal constant (e.g., ≤ 6) under the sup norm. Consequently, the plug-in decision “declare c an ε-winner if \\min{\\widehat{ε}_a^*(γ), \\widehat{ε}_b^*(γ)} ≤ ε − 2Lτ” is correct with probability at least 1 − δ, where L is a Lipschitz constant (e.g., L = 6). Choosing τ = Θ(ε) yields m = Θ((log(1/δ))/ε^2).\n\nRemarks.\n- This exact characterization for K = 3 strictly improves the c-first sufficient certificate (Theorem 2) and matches the counterexample in the notes.\n- For general K, an exact minimal-augmentation characterization for a fixed elimination order can be written as a linear program. A dual-based sensitivity analysis suggests that a polynomial-in-K sample bound per fixed order will follow from a poly(K) bound on sup_{λ∈Λ} ∥λ∥_1 over the dual feasible region; establishing such a bound remains open."
  }
}