{
  "content": "Ideas\n- Strengthen the meagre‑part framework by eliminating the main obstacle: prove that ambiguity sets Amb_k (existence, within distance ≤k, of two neighbor vertices that are globally rooted‑isomorphic) are nowhere dense for all D≥3. This, together with the re‑rooting template covering lemma, yields that the saturation of any nowhere‑dense set is meagre.  \n- Provide explicit, degree‑respecting “beacon” attachments that intrinsically distinguish neighbors in Δ≤D and Δ=D; and a completion (reservoir) lemma ensuring non‑emptiness of the refined cylinders in the D‑regular space.  \n- Note a sharp exception: D=2 is a counterexample (Amb_1 is comeagre in the double ray), so we restrict to D≥3.\n\nDefinitions\n- Amb_k⊂G_{•,D}: (G,ρ)∈Amb_k if ∃ w with dist(ρ,w)≤k and distinct neighbors u≠v of w such that (G,u)≅(G,v) as rooted graphs.  \n- A k‑step template Θ is a composition of 1‑step re‑rooting templates along a path of length k, each uniquely determined on a clopen domain (as in previous rounds).  \n\nReservoir completion for Δ=D\nLemma R (D‑regular completion). Fix D≥3. Let H be a finite connected graph with max degree ≤D, and let d_H(x) denote its degree. Suppose there exists at least one vertex z with d_H(z)<D. Then there exists a countably infinite connected D‑regular graph G containing H as an induced subgraph.\nProof. Let s=∑_{x∈V(H)}(D−d_H(x))≥1 be the number of free “stubs” required at H. Take an infinite D‑regular tree T. Remove a matching M of size s from T; let A be the set of 2s endpoints of M in T (each now has degree D−1). For each deficit at a vertex x∈H, add one new edge from x to a distinct vertex of A. This restores degrees at x (increase by 1) and at the chosen vertex of A (back to D). After consuming s vertices from A, there remain s extra vertices in A; pair them arbitrarily by s disjoint paths within T (re‑adding those s edges) to restore D‑regularity everywhere. T remains infinite and connected, and the union with H is connected and D‑regular. ∎\n\nNowhere density of ambiguity (D≥3)\nProposition A. Fix D≥3 and k∈ℕ. Then Amb_k is nowhere dense in G_{•,≤D} and in G_{•,=D}.\nProof. Let G_{•}^{F} be a nonempty cylinder; write r for the radius of F and let W={w∈V(F): dist_F(root,w)≤k}. For each w∈W, let N_F(w) denote the set of neighbors of w that lie in F; in Δ= D, also plan to create the missing neighbors so that in the refined ball we will explicitly realize all D neighbors of w.\nStep 1 (choose disjoint anchor pipes). Choose s≫r so large that we can, for every ordered pair (w,x) with w∈W and x a neighbor of w that we intend to control, reserve a simple path P_{w,x} of length L_{w,x}≥1 starting with its first edge at x and otherwise vertex‑disjoint from F and from all other reserved paths; ensure all L_{w,x} are distinct across the finite family. This choice is made inside the finite refinement we build and enforces disjointness already at the cylinder level.\nStep 2 (preallocate neighbors). For Δ≤D: if x∈N_F(w), we anchor P_{w,x} at x; if x is a “future neighbor” of w not present in F (i.e., deg_F(w)<D), we first add a new vertex x′ adjacent to w (thus using one unit of the degree budget of w), and anchor P_{w,x′} at x′. For Δ=D: for each w∈W, add exactly D−deg_F(w) new neighbors x′ of w and anchor P_{w,x′} at each; current degrees remain ≤D.\nStep 3 (attach beacons). Fix a countable family {B_i}_{i≥1} of pairwise non‑isomorphic finite rooted graphs with maximum degree ≤D; e.g., B_i a simple path of length i rooted at its endpoint (valid for all D≥2). For each anchored pipe P_{w,x} choose a distinct index i(w,x), and attach B_{i(w,x)} at the far endpoint of P_{w,x} by identifying its root with that endpoint. Because the family over (w,x) is finite, indices can be chosen pairwise distinct.\nLet F′ be the resulting finite refinement (an s′‑ball for some s′). By construction, G_{•}^{F′}⊂G_{•}^{F} and is nonempty in Δ≤D (extend by attaching infinite trees within degree budget). In Δ=D, nonemptiness follows from Lemma R since at least one vertex on the outer sphere has degree <D in F′ (this can be ensured by leaving some remote boundary vertex unsaturated; we used only finitely many degree budgets around W). Now take any (H,ρ)∈G_{•}^{F′}. Consider any w∈W (identified inside H) and two distinct neighbors u≠v of w in H. By construction, exactly one neighbor edge out of u (into its anchored pipe) leads after a unique path length L_{w,u} to a beacon B_{i(w,u)}, and similarly for v with B_{i(w,v)}; moreover, i(w,u)≠i(w,v). Hence the rooted graphs (H,u) and (H,v) are not isomorphic (the multiset of anchored beacon types around the root differs). Therefore no such w witnesses membership in Amb_k. Since this holds for every H extending F′, we have G_{•}^{F′}⊂G_{•}^{F}∖Amb_k. Thus Amb_k is nowhere dense. ∎\nRemark. The argument fails for D=2: in the double ray every vertex has two neighbors with isomorphic rooted types; indeed Amb_1 is the whole space G_{•,=2}. Hence the restriction D≥3 is tight.\n\nSaturation of nowhere‑dense sets is meagre (D≥3)\nLemma B (re‑root covering, recalled). For any nowhere‑dense N⊂G_{•,D} and k∈ℕ,\nSat_k(N) ⊆ Amb_k ∪ ⋃_{Θ∈𝒯_k} τ_Θ(N∩Dom(Θ)),\nwhere 𝒯_k is the countable set of k‑step templates and each τ_Θ is a homeomorphism between clopen sets.\nProof. As in the previous round: along any length‑k re‑rooting path from (G,ρ)∈N to (G,σ), either at some step the next vertex is not uniquely identifiable among neighbors (placing (G,ρ)∈Amb_k), or all steps are locally unique and realized by some template Θ with τ_Θ(G,ρ)=(G,σ). ∎\nCorollary C. For D≥3 and any nowhere‑dense N⊂G_{•,D}, Sat(N)=⋃_{k}Sat_k(N) is meagre. Indeed, Amb_k is nowhere dense by Proposition A and τ_Θ(N) is nowhere dense as the homeomorphic image of a nowhere‑dense set. Hence each Sat_k(N) is meagre and a countable union over k is meagre.\n\nConsequences and checks\n- This completes the saturation step promised earlier: for D≥3, re‑rooting a nowhere‑dense set yields a meagre set. It applies immediately to properties P whose S_P can be written as a saturation of a union of root‑local nowhere‑dense witnesses (e.g., “has a 2‑way infinite bridge” in Theorem 16). The meagre status for such P is therefore root‑invariant.  \n- D=2 caveat: Amb_k need not be small (e.g., in G_{•,=2}, Amb_1=the whole space), so the corollary fails; special treatment is required for D=2.\n\nNext steps\n- Extend the corollary into a full meagre‑invariance theorem for all saturated S (D≥3): Using that ⋃_k Amb_k is meagre (countable union of nowhere‑dense sets), attempt to extract a nowhere‑dense transversal N⊂S with S=Sat(N) by selecting representatives inside S∖⋃_k Amb_k (comeagre in S). This requires a careful diagonal selection on a countable base of cylinders, ensuring N remains nowhere dense.  \n- Provide explicit, written beacon libraries and degree bookkeeping for even/odd D in Δ= D (although the above proof uses only max degree ≤D beacons, a catalogue will be useful in other constructions).  \n- Treat D=2 separately: classify meagre/n.d. saturated sets in the double‑ray/ray space and identify which parts of the conjecture can hold there.\n\nSummary\n- Established: For D≥3 and each k, Amb_k is nowhere dense via intrinsic beacon gadgets anchored beyond a finite radius, both in Δ≤D and Δ= D (using the reservoir completion).  \n- Hence, for D≥3, the re‑root saturation of any nowhere‑dense set is meagre. This advances the meagre half of the conjecture substantially and yields root‑invariance for broad classes of unrooted properties expressible via root‑local nowhere‑dense witnesses.  \n- D=2 is exceptional; a separate analysis is needed there."
}