{
  "content": "Ideas\n- Generalize the “cohesive core” existence result to multiple cohesive blocks R^1,…,R^m that can each be polarized/consensual independently, with a residual set S. This yields a block-wise sufficient condition ensuring a global PNE with prescribed actions on all blocks simultaneously.\n- Provide a bounded-length best-response (BR) path construction for unsigned components: from all −1, a monotone BR schedule flips each player at most once; this bounds the BR-path length by the component size. Combine with SCC composition to bound global BR-path lengths when each SCC is unsigned after a gauge.\n\nDefinitions and notation\n- Binary actions x_i∈{±1}. Utilities u_i(x)=h_i x_i + x_i∑_j W_{ij}x_j.\n- For A⊆V, w_i^A=∑_{j∈A}|W_{ij}|. For a signature σ∈{±1}^V, gauge-transformed data: W^{[σ]}=[σ]W[σ], h^{[σ]}=[σ]h; and u_i^{[σ]}(x)=u_i([σ]x).\n\nTheorem (multi-core cohesive existence)\nLet V=R^1 ⊔ … ⊔ R^m ⊔ S. For each t=1,…,m, suppose there exists τ^{(t)}∈{±1}^{R^t} such that\n(1) τ_i^{(t)} W_{ij} τ_j^{(t)} ≥ 0 for all i,j∈R^t (i.e., G_{R^t}^{[τ^{(t)}]} is unsigned);\n(2) w_i^{R^t} + τ_i^{(t)} h_i ≥ w_i^{V\\R^t} for all i∈R^t.\nLet τ_R be the concatenation of τ^{(1)},…,τ^{(m)} on R=⊔_t R^t. Assume the S-restricted game with R frozen at τ_R admits a PNE z^*∈{±1}^S. Then the full game admits a PNE x^* with x^*_{R^t}=τ^{(t)} for all t and x^*_S=z^*.\nProof. Define σ∈{±1}^V by σ_i=τ_i^{(t)} if i∈R^t, and σ_i=1 if i∈S. Consider the [σ]-transformed game. By (1), each block (G_{R^t})^{[σ]} is unsigned; w_i^{R^t} and w_i^{V\\R^t} are invariant under gauge. Moreover h_i^{[σ]}=σ_i h_i=τ_i^{(t)} h_i for i∈R^t, and u_i^{[σ]}(1_{R},z)=u_i(τ_R,z) for i∈S, so z^* is a PNE for the S-restricted transformed game with R frozen at 1_R. By (2), for each i∈R^t one has w_i^{R^t}+h_i^{[σ]} ≥ w_i^{V\\R^t}, which implies that in the transformed game, given (1_R,z^*), player i’s unique best response is +1 (the marginal 2(w_i^{R^t}+h_i^{[σ]}+(W_{i,S}z^*) ) is ≥ 2(w_i^{R^t}+h_i^{[σ]}−w_i^{S}) ≥ 0). Hence x̃^*=(1_R,z^*) is a PNE of the transformed game. Mapping back via x^*=[σ]x̃^* yields u_i(x^*)=u_i^{[σ]}(x̃^*), so x^* is a PNE of the original game with x^*_{R^t}=τ^{(t)} and x^*_S=z^*. ∎\nRemarks.\n- This strictly generalizes the single-core result (m=1) and the polarized-core case (each τ^{(t)} encodes the block’s two factions).\n- Sufficient conditions for the S-restricted existence include: G_S undirected (exact potential) or structurally balanced (gauge to unsigned).\n\nLemma (monotone bounded-length BR-path in unsigned components)\nLet U⊆V and suppose W_{ij}≥0 for all i,j∈U (unsigned subgame), external field f∈ℝ^U arbitrary. Then there exists a BR-path from −1_U to a PNE of the U-restricted game of length at most |U|; moreover the path is monotone (coordinates only flip from −1 to +1).\nProof. Define the marginal Δ_i(x)=u_i(+1,x_{−i})−u_i(−1,x_{−i})=2(f_i+∑_{j∈U} W_{ij}x_j). If W≥0, then Δ_i(·) is nondecreasing in x. Start at y^{(0)}=−1_U. Iteratively, if some i satisfies Δ_i(y^{(k)})>0, pick one and set y^{(k+1)} by flipping i from −1 to +1. Monotonicity implies that once a player flips to +1, her marginal cannot decrease below 0 in subsequent steps, so no player flips back; thus at most |U| flips occur. When no Δ_i>0 remains, y^{(ℓ)} is a PNE: each +1 has Δ_i≥0 and each −1 has Δ_i≤0. Each step is a best response flip, so (y^{(0)},…,y^{(ℓ)}) is a BR-path. ∎\n\nCorollary (BR-path bounds under SCC composition with unsigned SCCs)\nSuppose the SCCs U_1,…,U_m of the condensation DAG are such that for each k there exists a signature σ^{(k)} with (W_{U_k U_k})^{[σ^{(k)}]}≥0 (e.g., U_k structurally balanced). Then, fixing any h, there exists a BR-path to a PNE whose length is at most ∑_{k=1}^m |U_k|: process SCCs in reverse topological order, apply the monotone lemma within each (after the corresponding gauge) with external fields induced by later SCCs, and concatenate the within-SCC paths.\n\nExamples\n- Two cohesive blocks. Let R^1,R^2 be disjoint unsigned subgraphs, S arbitrary undirected. If for some τ^{(1)}=1_{R^1}, τ^{(2)}=−1_{R^2}, the bounds w_i^{R^1}+h_i ≥ w_i^{V\\R^1} for i∈R^1 and w_i^{R^2}−h_i ≥ w_i^{V\\R^2} for i∈R^2 hold, and the S-restricted game with R frozen at (1_{R^1},−1_{R^2}) has a PNE, then the full game has a PNE with x_{R^1}=1, x_{R^2}=−1.\n- SCC BR-length. If the graph is a single structurally balanced SCC of size n, then after the appropriate gauge the game is unsigned and there is a BR-path from −1 to a PNE of length ≤ n. For a condensation with SCC sizes n_1,…,n_m, the concatenated path has length ≤ ∑ n_k.\n\nObstacles\n- The bounded-length BR-path construction relies on unsignedness (after a gauge) within SCCs. For undirected SCCs (exact potential but not unsigned), existence is guaranteed but no comparable uniform length bound follows from monotonicity.\n- A full characterization of universally PNE-admitting SCCs (for all external fields) beyond the unsigned-after-switching and exact-potential cases remains open. Negative signed cycles that are not “dominant” do not automatically preclude PNE for fixed W and arbitrary fields.\n\nNext steps\n- Extend multi-core existence to hierarchical cores (R decomposed into layers) with nested cohesiveness inequalities, yielding controlled prescriptions on multiple groups simultaneously.\n- Develop per-SCC BR-length bounds under weaker conditions (e.g., quasi-Metzler after switching with bounded negative part relative to positive couplings).\n- Implement the SCC pipeline with (a) structural-balance switching test, (b) undirectedness test, (c) functional SCC positive-cycle test; then apply the monotone BR schedule to produce explicit BR-paths with provable length bounds where applicable.\n"
}