{
  "content": "Ideas\n- We add three auditable, constructive results for binary signed network coordination (SNC) games u_i(x)=h_i x_i + x_i∑_j W_{ij}x_j (dependency i→j iff W_{ij}≠0):\n  1) A robust obstruction via dominant negative directed cycles (nonexistence, even with extra edges present).\n  2) A complete characterization of universally PNE-admitting (UPA) SCCs for functional digraphs (outdegree ≤1): UPA ⇔ every directed cycle has positive sign.\n  3) A linear-time structural-balance (directed) feasibility test (existence of σ with [σ]W[σ]≥0) via parity labeling.\n- These complement: DAG ⇒ PNE; SCC composition with UPA SCCs (undirected or structurally balanced) ⇒ PNE; 2-player UPA classification (W_{12}W_{21}≥0).\n\nLemma A (Dominant negative directed cycle ⇒ no PNE)\nLet C=(i_1→i_2→⋯→i_k→i_1) be a directed cycle. Choose signs s_r∈{±1} with ∏_{r=1}^k s_r = −1 and set W_{i_r i_{r+1}}=s_r L, h=0. Let all other edges have arbitrary nonzero weights independent of L. If\nL > 2 max_{r} ∑_{j≠i_{r+1}} |W_{i_r j}|,\nthen the SNC game has no pure NE.\nProof. For each r, the BR condition at i_r is sign(h_{i_r}+∑_j W_{i_r j} x_j)=sign(s_r L x_{i_{r+1}}+η_r) with |η_r|<L/2, hence x_{i_r}=s_r x_{i_{r+1}} (unique). Composing along C yields x_{i_1}=(∏ s_r) x_{i_1}=−x_{i_1}, a contradiction. ∎\nCorollary. Any digraph with a directed cycle fails to uniformly guarantee PNE over all W,h (necessity direction for the “uniform guarantee ⇔ DAG”). Lemma A is robust to extra neighbors and nonzero weights off-cycle.\n\nProposition B (Functional SCCs are UPA ⇔ all cycle-signs positive)\nAssume outdegree(i)≤1 for all i. Each SCC U is either a singleton or a simple directed cycle C=(i_1→⋯→i_k→i_1) with weights a_r=W_{i_r i_{r+1}}≠0. Then the restricted subgame on U is universally PNE-admitting (for every external field f∈ℝ^U) iff ∏_{r=1}^k sgn(a_r)=+1.\nProof. If the product is −1, with f=0 BR constraints x_{i_r}=sgn(a_r) x_{i_{r+1}} are inconsistent. If +1, define σ by σ_{i_{r+1}}=σ_{i_r} sgn(a_r); consistency follows from the positive product. Then [σ]W_{UU}[σ] has all cycle entries |a_r|>0 (unsigned). For any f, the transformed restricted subgame is an unsigned network coordination game (supermodular), hence admits a PNE; mapping back by x=[σ]y preserves PNE. ∎\nCorollary C (Functional digraphs with positive cycles ⇒ existence and BR-path). If every SCC is functional and every directed cycle has positive sign, then for every h the game admits a PNE. Construct it SCC-wise in reverse topological order; concatenate within-SCC BR-paths to obtain a global BR-path.\n\nLemma D (Linear-time check for directed structural balance)\nThere exists σ∈{±1}^V with [σ]W[σ]≥0 iff the parity constraints σ_i σ_j = sgn(W_{ij}) are simultaneously satisfiable over the (undirected) constraint graph on V with an edge {i,j} for each directed arc (i,j). This can be checked by BFS/DFS in O(|V|+|E|): fix σ on one node per component, propagate constraints; any contradiction implies infeasibility.\nJustification. Feasibility is equivalent to making all transformed weights nonnegative, which is precisely the cycle-parity consistency condition; any directed cycle then has positive sign and vice versa.\n\nExamples\n- Functional positive cycle (UPA). 1→2→3→1 with W_{12}=2, W_{23}=3, W_{31}=5 (>0). For any f, choose σ=+1; the cycle subgame is unsigned ⇒ PNE exists; feedforward singletons choose BR to their unique successor; global PNE by SCC composition.\n- Robust nonexistence by Lemma A. On 1→2→3→1 choose W_{12}=L, W_{23}=L, W_{31}=−L with L big; h=0; add arbitrary nonzero off-cycle edges. No PNE.\n\nObstacles\n- Beyond undirected/structurally balanced/functional SCCs, a full UPA characterization is open. Mixed asymmetric weights over multi-cycle SCCs can destroy UPA even if some cycles are positive.\n\nNext steps\n- Enlarge UPA classes: (i) SCCs switchable to monotone (all edges nonnegative after σ) on a feedback edge set; (ii) identify polymatrix blocks admitting ordinal potentials (edge-symmetric sums). Prove PNE existence or give counterexamples.\n- Algorithmic pipeline (summary): (1) If DAG, construct PNE by backward pass. (2) Else, SCC-decompose. For each SCC U: test undirected (exact potential), structural balance via Lemma D, or functional-positive via Proposition B. If all SCCs pass, construct PNE by reverse topological order; else use cohesive-core criteria (from the paper) or output an obstruction (e.g., Lemma A).\n- Complexity: SCC decomposition O(|V|+|E|); each SCC test O(|U|+|E_U|); construction uses per-SCC solvers for unsigned (supermodular) or undirected (potential) subgames.\n\nClaims to add to proofs.md / output.md\n- Lemma A (dominant negative cycle obstruction) with proof.\n- Proposition B and Corollary C (functional UPA characterization and construction).\n- Lemma D (structural-balance linear-time check) with justification."
}