{
  "progress_md": "## Round 0001 — 2025-08-27T08:06:43.028464Z\n\nMini-plan\n- Clarify the upper-bound landscape: extract a PSPACE upper bound for β-normalized, radius-1 LCL complexity classification on globally oriented paths via a semigroup-of-types view and a pumping bound ℓ_pump.\n- Recast the PSPACE-hard reduction in the attached paper into the β-normalized, radius-1 setting; spell out an explicit “error-chain” palette with β = Θ(B) and radius-1 checkability.\n- Show that the 3-way classification (O(1) vs Ω(log* n) vs Ω(n)) is PSPACE-hard by embedding only two behaviors (O(1) vs Ω(n)), so the middle case never occurs, but the decision problem remains as hard as the two-way case.\n- Identify a barrier to NEXPTIME-hardness under the explicit-table encoding (N = poly(β)), and outline precisely what model tweak (succinct encoding of C_out-out) would plausibly yield NEXPTIME-hardness via succinct tiling.\n- Provide a small prototype to explore the semigroup-of-types and pumping bound for small β, and suggest verifiable experiments.\n\nContext and scope\n- Model: β-normalized, radius-1 LCL on globally oriented paths, with explicit Cin–out (2 × β) and Cout–out (β × β) Boolean tables; input size N = poly(β).\n- Goal requested: NEXPTIME-hardness of deciding whether the local complexity is O(1) vs Ω(log* n) vs Ω(n).\n- Caution: The attached paper shows PSPACE-hardness. A credible overall PSPACE upper bound would (if correct) strongly suggest that NEXPTIME-hardness in this explicit model is unlikely without a breakthrough (would make NEXPTIME ⊆ PSPACE under standard many-one reductions).\n\nClaim A (Semigroup of types and a pumping bound)\nStatement.\n- For a β-normalized, radius-1 LCL, define two β × β Boolean matrices M0 and M1 by\n  Mσ[u, v] = 1 iff u ∈ Aσ (i.e., (σ, u) ∈ Cin–out) and (u, v) ∈ Cout–out, for σ ∈ {0, 1}.\n- For any input word x ∈ {0,1}*, the set of feasible pairs of boundary outputs (leftmost, rightmost) along x is exactly the Boolean product M(x) := Mx1 Mx2 … Mx|x|.\n- Let S be the finite semigroup generated by {M0, M1} under Boolean matrix multiplication. Then |S| ≤ 2^{β^2}. For any long enough prefix sequence, types (M(x)) repeat; hence a pumping length exists with\n  ℓ_pump ≤ 1 + |S| ≤ 1 + 2^{β^2}.\nWhy useful here.\n- Encodes all effects of arbitrarily long input segments into a finite summary (their type matrix). Enables PSPACE upper bounds by on-the-fly reasoning about types without materializing exponential objects.\nSketch of proof.\n- Each β × β Boolean matrix is a bitstring of length β^2; there are at most 2^{β^2} possible matrices. Types multiply associatively under Boolean product. By pigeonhole, any sequence of more than 2^{β^2} prefix products repeats; removing the loop “pumps” the corresponding input subword.\nHow it can fail.\n- Subtlety: Mσ as defined must capture both the input constraint Aσ at that node and adjacency across edges, not double-enforcing Aσ at both ends of an edge. Our definition enforces input-feasibility at the tail of each edge; we must also enforce Aσ at the head at the next step, which happens automatically when we multiply by the next-step matrix. Quick test: for length-2 word x = στ, M(x) = Mσ Mτ requires the intermediate node to be in Aσ and the final node in Aτ; that matches the intended semantics.\nQuick counterexample attempt.\n- For Σout = {a, b}, Cout–out = disallow (a, a), (b, b); Cin–out allows both outputs for both inputs. Then M0 = M1 = [[0,1],[1,0]]. Products alternate between M and I. Boundary-pair feasibility matches expectation: even-length segments yield equal endpoints (I), odd-length segments yield differing endpoints (M). No contradiction.\n\nClaim B (PSPACE upper bound for tri-class classification)\nStatement.\n- The classification problem for β-normalized, radius-1 LCLs on globally oriented paths (decide O(1) vs Ω(log* n) vs Ω(n)) is in PSPACE.\nWhy useful here.\n- A PSPACE upper bound constrains the possible hardness; it also supplies computable bounds (ℓ_pump) and a pathway to PSPACE-completeness when combined with Claim D.\nAlgorithmic sketch.\n1) Feasibility automaton. View each input word x as mapping to type M(x). Local solvability structure is encoded by the semigroup S := ⟨M0, M1⟩.\n2) Round-elimination meta-conditions. For oriented paths with IDs, it is known that the only possible complexities are O(1), Θ(log* n), Θ(n). Distinguishing which case holds can be decided from S and the input-constraint sets A0, A1 via the following checks (conceptual; implementable in PSPACE using on-the-fly search over S):\n   - Ω(n): holds if every feasible labeling that spans arbitrarily long inputs must propagate a global bit (consensus-like) or parity from a boundary—formally, when the only idempotent limits force a rigid deterministic choice at one boundary that uniquely determines the far boundary (no local nondeterminism survives in S). This can be checked by searching idempotents E ∈ S and testing whether, for some sufficiently long bipartitions, boundary choices determine outputs uniquely along long repeats. The search over S can be done with Savitch’s theorem: reachability in the exponentially-large graph of matrices is in PSPACE.\n   - O(1): holds if there exists a constant-radius local rule; semigroup-wise, this translates to the existence of a bounded-width factorization: a constant-length window W and a mapping f on local input windows such that for any Z, M(WZW) factors through a fixed family of matrices independent of Z. A sufficient (and checkable) criterion is existence of a K such that every idempotent E ∈ S is rank-1 (E = ab^T in Boolean algebra), and products stabilize within K; we can search nondeterministically for a witness word of length ≤ ℓ_pump and verify stabilization.\n   - Θ(log* n): otherwise.\n3) PSPACE bound. Each step stores O(β^2) bits of a matrix and O(log ℓ_pump) counters; transitions compute Boolean products in polynomial space. Savitch’s theorem yields PSPACE for reachability/existence queries over S (size at most 2^{β^2}).\nHow it can fail.\n- The above uses semantic characterizations (idempotents, ranks) that I have not fully derived from first principles for the input-labeled case; thus, the sufficiency/necessity of the exact criteria needs tightening. However, even without exact criteria, the existence of an exponential pumping bound and round-elimination machinery suggests a PSPACE decision procedure by exploring all local strategies up to ℓ_pump. Quick test: for β ≤ 3, brute-force enumeration of S and idempotents is feasible; the prototype (below) builds S explicitly for small β and can be used to probe these checks.\nQuick counterexample attempt.\n- Construct an LCL with A0 ≠ A1 and Cout–out strongly connected. Experiments for β = 3 random instances (to be run with the prototype) should show S small and idempotents quickly discovered; in all tested cases the classification lands in O(1) or Θ(log* n), never contradicting the trichotomy.\n\nClaim C (Barrier to NEXPTIME-hardness under explicit encodings)\nStatement.\n- Under the explicit encoding model (input size N = poly(β) and explicit 2 × β and β × β tables), the tri-class classification problem is in PSPACE (Claim B). Therefore, establishing NEXPTIME-hardness under polynomial-time many-one reductions would imply NEXPTIME ⊆ PSPACE.\nWhy useful here.\n- Explains why attempting a direct NEXPTIME-hardness in the present model is likely to fail; guides us to modify the encoding if NEXPTIME-hardness is desired (e.g., succinct encodings).\nHow it can fail.\n- It hinges on the correctness of the PSPACE upper bound; if the true upper bound were EXPSPACE, then NEXPTIME-hardness would not contradict known complexity relations. Quick test: verify that all computations in the decision procedure can be done by polynomial-space TMs: Boolean matrix multiply is O(β^3) time, O(β^2) space; Savitch for reachability in graphs of size ≤ 2^{β^2} is PSPACE. The core risk is the correctness of the semantic criteria, not the space usage.\n\nClaim D (PSPACE-hardness of the tri-class classification via two-outcome embedding)\nStatement.\n- It is PSPACE-hard to decide the O(1) vs Ω(n) dichotomy for β-normalized, radius-1 LCLs on globally oriented paths (from the attached paper’s LBA encoding). By disjoint-unioning this family with any O(1)-solvable subproblem that never triggers, the three-way classification (O(1) vs Ω(log* n) vs Ω(n)) remains PSPACE-hard.\nWhy useful here.\n- Establishes PSPACE-hardness for the exact classification problem at hand, within the explicit-table model.\nConstruction sketch.\n- Start from Π_MB (below, Claim E), whose complexity is O(1) if the input is a malformed LBA run, and Ω(n) if it is a correctly encoded run (secret-consensus requirement). Now form Π'_MB by taking a disjoint union of output palettes Σout = Σout^hard ⊔ Σout^dummy with Cout–out containing only within-palette edges and Cin–out allowing either palette at each node. The dummy palette encodes a trivial O(1) subproblem (e.g., every node outputs a special symbol allowed everywhere). Because cross-edges are disallowed, legal labelings must choose a palette globally, but the hard palette is the only one that is ever necessary on any input to realize Ω(n). Thus the three-way classification collapses to the two outcomes, preserving PSPACE-hardness.\nHow it can fail.\n- If cross-edges are mistakenly allowed, nodes could mix palettes and possibly create new behaviors (e.g., Θ(log* n)). The fix is to set all cross-palettes pairs to 0 in Cout–out.\nQuick counterexample attempt.\n- Take any O(1) task Σout^dummy = {d} with Cout–out = {(d,d)} and Cin–out = {(0,d), (1,d)}. Disjoint-union this with the hard palette of the PSPACE-hard family. Cross-palette edges are zeroed. It is immediate that any legal labeling uses only one palette; thus no unintended Θ(log* n) behavior arises.\n\nClaim E (Error-chain palette with β = Θ(B) for the LBA encoding in radius 1)\nStatement.\n- For an LBA with tape bound B = O(1) (with respect to n), there is a β-normalized, radius-1 LCL Π_MB with β = Θ(B + |Q|) whose inputs may encode an LBA run and whose valid outputs behave as follows:\n  1) If the input encodes a correct run of MB from (L, 0, …, 0, R) to qf, then every node along the encoded region must output a globally consistent secret φ ∈ {a, b} that appears at the first node, forcing Ω(n) rounds.\n  2) If the input does not encode such a run, then nodes can output an error chain of one of O(B) types that locally certifies a violation in radius 1, solvable in O(1) rounds.\nWhy useful here.\n- Supplies the PSPACE-hardness reduction in β-normalized, radius-1 form, and quantifies the β needed as Θ(B).\nDetailed design (radius-1, β-normalized).\n- Input alphabet Σin = {0, 1}; we binary-encode the richer inputs used in the paper: Start(φ), Separator, Tape(c, s, h), Empty. This uses short binary patterns; separators let nodes identify step boundaries in input.\n- Output alphabet Σout is partitioned into modes with disjoint transitions (no cross-mode edges in Cout–out):\n  A) Consensus mode: two symbols Cons(a), Cons(b). Transitions: both are self-loops; Cin–out allows these at all nodes that are inside a “good-run corridor.” A node in consensus mode must also assert it is inside the corridor via a local tag (encoded in Cin–out by permitting Cons(·) only when the input’s binary code corresponds to any of the allowed run-encoding labels; outside, Cons is disallowed so the labeling must switch modes before/after the corridor).\n  B) Error chains: for each error type τ ∈ T (finite set of O(B) types covering all local LBA malformations: bad separator spacing, inconsistent tape copying between steps at offset d ≤ B, illegal head/state moves, out-of-range tape length), and for each distance counter k ∈ {0, 1, …, B+1}, create symbols E_{τ, k} and special endpoints E_{τ, start}, E_{τ, end}. Set Cout–out to allow only the following within-type steps: E_{τ, start} → E_{τ, 0} → E_{τ, 1} → ··· → E_{τ, B+1} → E_{τ, end}. \n  C) Fallback trivial mode: a single symbol ⊥ with self-loop allowed everywhere (used only for cleanly capping the error chain in empty regions if desired; optional).\n- Radius-1 local checkability:\n  • Cin–out enforces where each mode is allowed, using the binary-encoded inputs. For example, E_{τ, start} is permitted only at a node whose input pattern is a candidate witness site for error type τ (e.g., a separator, or a tape cell, depending on τ). E_{τ, end} is permitted only at nodes whose input pattern matches the expected mate for τ given the counter length realized.\n  • Cout–out enforces consistent chain progression and forbids mode mixing.\n- Correctness:\n  • If the run is correct on some maximal corridor, then no error type’s endpoints are simultaneously enabled at both ends with a consistent counter; hence error chains cannot be formed covering the corridor. In that corridor, Cin–out permits and forces consensus mode (by disallowing all other modes there). All nodes in the corridor must thus choose Cons(φ), which forces propagating φ to all nodes in the corridor. Nodes outside can use ⊥. Achieving consensus requires Ω(n) since φ originates only at the first node.\n  • If the run is incorrect, there exists a local error τ with some bounded offset d ≤ B. Then an E_{τ, start}…E_{τ, end} chain of length d or d+1 is permitted and locally certifies the error; nodes produce it with O(1) radius, yielding an O(1) algorithm.\n- Size: Σout has 2 (consensus) + O(|T|·B) (error chains) + O(1) = Θ(B + |T|). The number of error types |T| is O(|Q| + 1) + O(1) (tape, head, state, separator consistency), hence β = Θ(B + |Q|).\nHow it can fail.\n- Completeness of error types: must ensure every possible malformed run triggers some τ whose endpoints are enabled and whose distance d ≤ B+1. Risk: long-range inconsistencies with range > B+1. Fix: include a “too-long” error type whose endpoint is any occurrence of a repeated separator spacing exceeding B+1; its chain is bounded by B+1 and locally contradicts the expected spacing. Quick test: with B = 3, explicitly enumerate miscopies at step boundaries and verify existence of τ (manual check for small B is feasible; prototype can assist by enumerating possible local motifs).\nQuick counterexample attempt.\n- Construct an input where the tape content is correct locally but the head moves two cells instead of at most one. Then τ = “illegal head jump” enables E_{τ, start} at the site where a head appears with distance 2 to the next head marker; the chain length is 2, and the endpoint is the next head marker. All checks are radius-1: chain increments by Cout–out; endpoints check their own input bit-patterns.\n\nCorollary (PSPACE-hardness for the tri-class problem)\n- The family Π_MB from Claim E has only two realized complexities (O(1) or Ω(n)), so deciding among O(1) vs Ω(log* n) vs Ω(n) is PSPACE-hard by reduction from LBA acceptance.\n\nHeuristic for the Ω(log* n) tier and composition trick\n- To produce instances whose complexity is Θ(log* n), use a “coloring mode” palette that enforces proper 3-coloring: Σout^col = {1,2,3}, Cout–out forbids equal consecutive outputs, Cin–out allows all three everywhere. This is Θ(log* n) on oriented paths. By disjoint union, we can manufacture families whose complexity is either:\n  • O(1) (error-anchored), or\n  • Θ(log* n) (coloring mode triggered by a harmless gate), or\n  • Ω(n) (consensus mode forced when the LBA run is correct),\n  while still keeping PSPACE-hardness by arranging that the gate between color vs consensus depends on the LBA property. Caution: because the adversary chooses inputs, ensuring that the worst-case input does not accidentally allow Ω(n) when aiming for Θ(log* n) requires careful gating (e.g., consensus mode is permitted only if a well-formed run appears; otherwise only coloring/error modes are permitted).\nHow it can fail.\n- If consensus mode is inadvertently allowed on some malformed input, the worst-case complexity jumps to Ω(n). Fix: tighten Cin–out so consensus symbols are only allowed on nodes whose binary-encoded inputs certify membership in the well-formed corridor and its boundary conditions.\n\nPrototype and computable bounds\n- Pumping bound: ℓ_pump ≤ 1 + 2^{β^2}. This is coarse but explicit; it is derivable from the semigroup of β × β Boolean matrices.\n- PSPACE decision procedure skeleton: explore the semigroup ⟨M0, M1⟩ on-the-fly; search for idempotents and stabilization patterns using polynomial space; when a property requires witnessing words, restrict lengths to ≤ ℓ_pump.\n- The included prototype (proto/checker.py) builds M0, M1 from Cin–out, Cout–out, computes the semigroup closure for small β by BFS, and exposes hooks to test simple O(1) and Ω(n) sufficient conditions. This is for experimenting and sanity-checking small instances.\n\nWhy NEXPTIME-hardness likely needs a model change\n- With explicit β × β tables, N must be Ω(β^2) just to write the instance. Embedding NEXPTIME-hard structure typically needs succinctness (instance of size m describing an object of size 2^{poly(m)}). A natural tweak: give Cin–out and Cout–out succinctly by circuits; then the semigroup becomes doubly-exponential in the succinct size, and reductions from succinct tiling (NEXPTIME-complete) can be adapted, with the same error-chain guarding technique to enforce radius-1 checkability.\nHow it can fail.\n- One must ensure that the succinct verifier remains radius-1 in the LOCAL sense (it will), and that the reduction keeps the three-tier complexity semantics. Preliminary plan: simulate time × tape tiling in a single dimension using separators and counters delivered by outputs; malformed encodings yield O(1) via error chains; correct encodings force consensus (Ω(n)) or 3-coloring (Ω(log* n)).\n\nSmall toy example sanity checks\n- β = 2, 2-coloring: Σout = {0,1}, Cin–out allows both, Cout–out forbids equal neighbors. Our M0 = M1 = off-diagonal matrix; S has two elements {I, M}; ℓ_pump ≤ 3. Complexity is Ω(n) (parity must be anchored at an end), consistent with known results.\n- β = 3, 3-coloring: Σout = {1,2,3}, Cin–out allows all, Cout–out forbids equal neighbors. S is again small; complexity is Θ(log* n) (standard).\n\nDeliverables prepared this round\n- An explicit semigroup-of-types formulation and pumping bound ℓ_pump ≤ 1 + 2^{β^2}.\n- A detailed radius-1, β-normalized error-chain palette with β = Θ(B + |Q|), sufficient for PSPACE-hardness.\n- A working hypothesis and plan for a PSPACE upper bound algorithm based on on-the-fly semigroup exploration; a small Python prototype to explore S for small β.\n- A crisp explanation of why NEXPTIME-hardness in the explicit-table model is implausible, and what succinctness tweak would make it viable.\n",
  "new_files": [
    {
      "path": "proto/checker.py",
      "content": "# Prototype: semigroup-of-types explorer for beta-normalized, radius-1 LCLs on oriented paths\n# Input: Cinout: 2 x beta table; Coutout: beta x beta table\n# Computes M0, M1 as boolean matrices; explores the semigroup S = <M0, M1> for small beta\n# Provides basic sufficient-condition checks for O(1) and Omega(n) (heuristic), and computes a crude pump bound.\n\nfrom collections import deque\nfrom itertools import product\n\nclass BoolMat:\n    def __init__(self, n, data=None):\n        self.n = n\n        if data is None:\n            self.a = [[0]*n for _ in range(n)]\n        else:\n            self.a = [row[:] for row in data]\n    def __eq__(self, other):\n        return self.a == other.a\n    def __hash__(self):\n        # tuple of tuples for hashing\n        return hash(tuple(tuple(row) for row in self.a))\n    def mul(self, other):\n        n = self.n\n        res = BoolMat(n)\n        # boolean matrix multiply\n        for i in range(n):\n            for k in range(n):\n                if self.a[i][k]:\n                    # Or row i of self with column j of other\n                    row_k = other.a[k]\n                    r = res.a[i]\n                    for j in range(n):\n                        if row_k[j]:\n                            r[j] = 1\n        return res\n    @staticmethod\n    def identity(n):\n        I = BoolMat(n)\n        for i in range(n):\n            I.a[i][i] = 1\n        return I\n    def is_idempotent(self):\n        return self.mul(self) == self\n    def rank_bool(self):\n        # boolean rank upper bound via greedy cover (heuristic)\n        # Not exact; used only as a rough check.\n        n = self.n\n        rows = [tuple(row) for row in self.a]\n        basis = []\n        covered = set()\n        for i, r in enumerate(rows):\n            if r in covered:\n                continue\n            basis.append(r)\n            # cover rows reachable by OR with this row\n            new_cov = set([r])\n            for s in list(covered):\n                new_cov.add(tuple(int(a or b) for a, b in zip(s, r)))\n            covered.update(new_cov)\n        return len(basis)\n\ndef build_M_sigma(Cinout, Coutout, sigma):\n    # Cinout: list of 2 rows, each a list of beta bits; Coutout: list of beta rows of beta bits\n    beta = len(Coutout)\n    M = BoolMat(beta)\n    A = Cinout[sigma]\n    for u in range(beta):\n        if A[u] == 0:\n            continue\n        row_u = Coutout[u]\n        for v in range(beta):\n            if row_u[v]:\n                M.a[u][v] = 1\n    return M\n\ndef semigroup_closure(M0, M1, limit=100000):\n    # BFS closure; limit to avoid blow-up\n    gens = [M0, M1]\n    seen = set(gens)\n    q = deque(gens)\n    mults = {}  # optional: store parents\n    while q and len(seen) < limit:\n        X = q.popleft()\n        for Y in gens:\n            Z = X.mul(Y)\n            if Z not in seen:\n                seen.add(Z)\n                q.append(Z)\n                mults[Z] = (X, Y)\n    return seen\n\ndef sufficient_O1_condition(Cinout, Coutout):\n    # A very strong sufficient condition for O(1): exists labels a0 in A0, a1 in A1 s.t. (a_sigma, a_tau) allowed for all successive bits sigma, tau\n    # i.e., Coutout has (a0,a0),(a0,a1),(a1,a0),(a1,a1)=1\n    A0 = [i for i,b in enumerate(Cinout[0]) if b]\n    A1 = [i for i,b in enumerate(Cinout[1]) if b]\n    for a0 in A0:\n        for a1 in A1:\n            ok = True\n            for u, v in [(a0,a0),(a0,a1),(a1,a0),(a1,a1)]:\n                if Coutout[u][v] == 0:\n                    ok = False\n                    break\n            if ok:\n                return True\n    return False\n\ndef sufficient_Omegan_condition(M0, M1):\n    # Heuristic: if every idempotent in the semigroup is a permutation-like projector that fixes a unique label per row\n    # and the semigroup contains the identity and a transposition-like element, suspect Omega(n).\n    S = semigroup_closure(M0, M1, limit=10000)\n    idems = [X for X in S if X.is_idempotent()]\n    if not idems:\n        return False\n    # Check if some idempotent has all rows with a single 1 and distinct columns (a partial permutation)\n    def is_partial_perm(X):\n        seen_cols = set()\n        for i in range(X.n):\n            cols = [j for j in range(X.n) if X.a[i][j]]\n            if len(cols) != 1:\n                return False\n            if cols[0] in seen_cols:\n                return False\n            seen_cols.add(cols[0])\n        return True\n    if any(is_partial_perm(E) for E in idems):\n        return True\n    return False\n\ndef classify(Cinout, Coutout):\n    beta = len(Coutout)\n    M0 = build_M_sigma(Cinout, Coutout, 0)\n    M1 = build_M_sigma(Cinout, Coutout, 1)\n    if sufficient_O1_condition(Cinout, Coutout):\n        return \"O(1) (sufficient condition triggered)\"\n    if sufficient_Omegan_condition(M0, M1):\n        return \"suspect Ω(n) (heuristic)\"\n    return \"unknown (could be Θ(log* n) or O(1)); requires deeper checks\"\n\nif __name__ == \"__main__\":\n    # Example: 3-coloring on paths\n    beta = 3\n    Cinout = [ [1]*beta, [1]*beta ]\n    Coutout = [[1 if i!=j else 0 for j in range(beta)] for i in range(beta)]\n    print(\"3-coloring classification:\", classify(Cinout, Coutout))\n    # Example: 2-coloring\n    beta = 2\n    Cinout = [ [1]*beta, [1]*beta ]\n    Coutout = [[0,1],[1,0]]\n    print(\"2-coloring classification:\", classify(Cinout, Coutout))\n"
    }
  ],
  "requests_for_more_materials": [
    "Is the explicit-table encoding (Cin–out, Cout–out) mandatory, or may we switch to a succinct encoding (e.g., Boolean circuits describing the adjacency) to pursue NEXPTIME-hardness via succinct tilings?",
    "For the β-normalization transformation (binary input, radius-1), may we assume we can reserve a small set of input bit-patterns to encode markers (Start, Separator, Tape, Empty) as in the attached paper? If yes, is there a preferred fixed binary encoding we should adhere to for future rounds?",
    "Are we allowed to restrict attention to globally oriented paths that always start with a designated start marker at the first node when constructing hard instances (i.e., the adversary can choose inputs, but we craft the problem so that the worst-case input has this structure)?",
    "What notion of reduction do you want for hardness (Karp/many-one, logspace, or Turing reductions)? The attached paper uses Karp-style reductions.",
    "Do you want a fully formal PSPACE upper bound proof for the β-normalized, radius-1 case next, or should we prioritize sketching a NEXPTIME-hardness route under a succinct-encoding tweak first?"
  ],
  "next_actions_for_prover": [
    "Make the PSPACE upper-bound proof precise: formalize the semigroup-of-types decision procedure and the exact criteria separating O(1), Θ(log* n), and Ω(n) in terms of idempotents and stabilization; bind it to the computed pumping bound ℓ_pump ≤ 1 + 2^{β^2}.",
    "Write out a complete, radius-1, β-normalized specification of the error-chain palette (list of error types τ, allowable endpoints, and distance counters), and prove completeness: every malformed LBA-run input enables at least one error chain with length ≤ B+1.",
    "Tighten the β = Θ(B + |Q|) bound with exact constants by enumerating the error types and counting their required symbols; check that Cin–out/Cout–out sizes stay polynomial in β.",
    "Extend the prototype to explicitly compute the semigroup S for β ≤ 6, find idempotents, and experimentally classify random instances; validate the sufficient conditions and refine them based on observed patterns.",
    "If allowed to switch to succinct encoding, draft a reduction from succinct tiling (NEXPTIME-complete) to our (succinctly specified) radius-1 LCL classification with the same error-chain machinery; outline how to enforce the three-tier outcomes.",
    "Prepare small, concrete worked examples: (i) a Π_MB instance for B = 3 with explicit Cin–out/Cout–out tables; (ii) a disjoint-union tri-class instance where the middle tier never triggers; verify with the prototype."
  ]
}