{
  "content": "Ideas\n\n- Clarify structural features of Whitney triangulations of the disc (with boundary) that are relevant for clique dynamics. In particular: (i) which subgraphs are forbidden, (ii) what are the maximal cliques in kG (the clique graph), and (iii) how k^2G can be interpreted in terms of G.\n- Extract and prove elementary lemmas that hold for any finite Whitney triangulation of the disc, independent of degree hypotheses, to serve as a base for later “peeling”/inductive arguments toward k-nullness. These are auditable and testable on small examples.\n- For Question 2 (sphere), isolate necessary structural obstructions to convergence beyond K4 via small lemmas and examples; full resolution remains open, but we can sharpen the landscape.\n\nResults and Proofs\n\nLemma 1 (K4 cannot properly occur in a Whitney triangulation of the disc).\nStatement. Let G be the underlying graph of a finite Whitney triangulation of the disc (i.e., every 3-cycle in G bounds a triangular 2-cell). Then G contains no K4 as a subgraph.\nProof. Suppose four vertices a,b,c,d induce a K4 in G. Then its four 3-cycles abc, abd, acd, bcd are all triangles in G. By the Whitney property on the disc, each such 3-cycle must be the boundary of a (triangular) face of the triangulation. But these four triangular 2-cells cannot be realized in a 2-dimensional cell-decomposition of the disc without overlap: in any planar embedding of K4, exactly three of the four triangular cycles can be realized as bounded faces, and the remaining one is the outer cycle. That outer cycle is not a 2-cell of the triangulated disc (the disc boundary is a single closed curve supplied by the triangulation; it cannot simultaneously serve as a 2-cell). Thus one of the four triangles would fail to be a face, contradicting the Whitney condition. ∎\n\nRemark. The single-triangle disc (K3) is compatible with the Whitney property; the above argument uses the specific combinatorics of K4, not K3.\n\nLemma 2 (Maximal cliques of G are precisely the triangular faces).\nStatement. Let G be the underlying graph of a finite Whitney triangulation of the disc. Then every maximal clique in G is a triangle (equivalently, the set of vertices of a triangular face). In particular, there is a bijection between V(kG) and the set of triangular faces of the triangulation.\nProof. In a Whitney triangulation all 3-cycles bound triangular faces; there are no 4-cliques by Lemma 1. Thus the clique number of G is 3. Every edge of G lies in at least one triangular face (by maximality of the triangulation: every bounded face is a triangle and every boundary edge belongs to a boundary triangle). Hence every maximal clique has size 3 and is a facial triangle. ∎\n\nLemma 3 (Degree formula in kG from local data in G).\nStatement. Let T = xyz be a triangular face of G, and let t ∈ V(kG) be the vertex corresponding to T. Denote deg_G(x) by d(x), and let t_e be the number of triangles in G containing edge e (so t_e ∈ {1,2}, with t_e = 1 iff e is a boundary edge). Then\n\ndeg_{kG}(t) = d(x) + d(y) + d(z) − (t_{xy} + t_{yz} + t_{zx}).\n\nProof. The neighbours of t in kG are exactly the facial triangles other than T that meet T in at least one vertex. For a fixed vertex x, the number of facial triangles through x equals d(x), and exactly one of them is T, hence we have d(x) − 1 triangles counted from x. Summing over x,y,z gives d(x)+d(y)+d(z) − 3. This double-counts those triangles that meet T in an edge (two vertices); for an edge e of T there are t_e − 1 triangles different from T that also contain e, and these have been counted twice; subtracting (t_{xy} − 1) + (t_{yz} − 1) + (t_{zx} − 1) yields the claimed formula. ∎\n\nCorollary 4. If T is an interior face (all three edges interior), then deg_{kG}(t) = d(x)+d(y)+d(z) − 6. If T has exactly b boundary edges, then deg_{kG}(t) = d(x)+d(y)+d(z) − (6 − b).\n\nProposition 5 (Structure of maximal cliques in kG: a reduction principle).\nStatement. Let G be a finite Whitney triangulation of the disc. For each vertex v ∈ V(G), let T(v) denote the set of facial triangles incident with v. Then:\n- T(v) induces a clique in kG (since any two of its triangles intersect in v).\n- If a clique C in kG has the property that its triangles are pairwise intersecting and G is K4-free (Lemma 1), then C ⊆ T(v) for some v ∈ V(G).\n\nProof (first bullet). Immediate: any two triangles through v meet in v, hence are adjacent in kG.\n\nProof sketch (second bullet). Suppose C is a family of facial triangles pairwise intersecting. Pick two triangles in C that meet in an edge ab (if no two meet in an edge, pick any pair meeting in a vertex; the ensuing argument is easier). Let T1, T2 ∈ C be the two triangles containing ab. Let T ∈ C be arbitrary. If T contains neither a nor b, then it must meet both T1 and T2 at their respective third vertices, say c (for T1) and d (for T2). This forces edges ac, bc, ad, bd to lie in G; then {a,b,c,d} induces a K4, which is impossible by Lemma 1. Hence every T ∈ C contains a or b, that is, C ⊆ T(a) ∪ T(b). If both sets T(a) \\ T(b) and T(b) \\ T(a) are non-empty, pick T_a ∈ T(a) \\ T(b) and T_b ∈ T(b) \\ T(a). For pairwise intersection we require T_a ∩ T_b ≠ ∅; since neither contains a common endpoint, their common vertex would have to be some w ≠ a,b with aw, bw ∈ E(G). Then the 3-cycle abw exists and, by the Whitney property, must be a face F. But then any triangle in T(a) not using w fails to meet T_b, contradicting the pairwise intersection of C unless T(a) ⊆ T(w) and T(b) ⊆ T(w), which again forces a K4 on {a,b,w} plus the third vertices. Thus one of T(a) or T(b) contains C. (A fully rigorous case analysis along these lines can be organized by induction on |C|, using the Whitney property to forbid the necessary 3-cycles unless all triangles share a common vertex.) ∎\n\nConsequences and Interpretation\n\n- From Lemma 2 and Proposition 5, the maximal cliques of kG are precisely the collections T(v) for v ∈ V(G), except for possible identifications when T(u) = T(v). In particular, the vertex set of k^2G can be identified with the set {T(v) : v ∈ V(G)} of distinct incident-face-stars.\n- Adjacency in k^2G: Two distinct stars T(u), T(v) intersect iff there exists a facial triangle containing both u and v, i.e., iff uv ∈ E(G). Thus k^2G is canonically isomorphic to the quotient of G obtained by identifying vertices u,v with T(u) = T(v). This description is testable on small examples and gives a concrete handle on k^2.\n\nExamples\n\n- Single-triangle disc (K3). Here T(u) = {the unique face} for all three boundary vertices u; thus all stars coincide, and the quotient collapses to a single vertex. Hence kG is K1 and the graph is k-null (in one step).\n- Two triangles sharing an interior edge. There are exactly two facial triangles; their stars are distinct only at the two interior-edge endpoints. In kG we obtain K2; consequently, k^2G is K1 (again k-null).\n- Small Δ2 patch of the triangular lattice with boundary. All maximal cliques in G are triangular faces; K4-free holds. The stars T(v) are pairwise distinct for interior vertices v, and several boundary vertices have |T(v)| = 1 or 2 and may be identified with neighbours in k^2. This demonstrates the quotient effect in k^2 and aligns with the “peeling-by-layers” heuristic: boundary vertices with small |T(v)| collapse early; deeper vertices survive longer.\n\nHeuristic for Question 1 (toward k-nullness for all disc triangulations)\n\n- The quotient description of k^2G suggests a systematic peeling: after passing to k^2, all boundary vertices with degree 2 (equivalently |T(v)| = 1) merge with their neighbours, and more generally vertices with small |T(v)| are absorbed into larger stars. Repeating this two-step operation should strictly reduce the number of distinct stars until a single star remains, i.e., the sequence becomes k-null. This strategy is compatible with the known result “if every interior vertex has degree ≥ 6, then k-null,” since boundary stars are smallest and are absorbed layer by layer from the boundary inward.\n- A rigorous implementation would proceed by defining a potential Φ(G) = number of distinct stars T(v) and showing Φ(k^2G) < Φ(G) whenever Φ(G) > 1. For discs, the absence of K4 (Lemma 1) and Proposition 5 make Φ well-defined and natural. This provides a concrete target to prove k-nullness by induction on Φ.\n\nObstacles\n\n- Completing the proof that every maximal clique of kG is exactly a star T(v) requires a more careful argument ruling out the possibility of a pairwise-intersecting family of facial triangles without a common vertex in K4-free Whitney triangulations of discs. The proof sketch given can be turned into a rigorous induction, but the case distinctions (especially when the initial pair of triangles intersects in only a single vertex) need to be written carefully.\n- Showing strict decrease of Φ under k^2 in full generality demands quantitative control of when two distinct vertices can generate identical stars after two iterations. This likely requires a refined “ear decomposition” or “boundary shelling” argument on triangulations of the disc.\n\nProgress on Question 2 (Sphere)\n\n- For sphere triangulations, Lemma 2 still applies (maximal cliques in G are facial triangles), but Lemma 1 fails: K4 may appear (and does, e.g., in the octahedron). Thus Proposition 5 cannot be applied without additional hypotheses; K4-configurations can create maximal cliques in kG that are not vertex-stars, complicating the k^2-quotient picture.\n- Nevertheless, the quotient view of k^2 persists locally in K4-free regions; this suggests a hybrid approach: decompose a sphere triangulation into K4-bubbles and K4-free parts; in K4-free parts the k^2-quotient is close to the identity, whereas around K4s the dynamics can create “amplification” leading to divergence (as in the octahedron, known to be k-divergent). Formulating and proving a general decomposition lemma that forces divergence whenever a nontrivial K4-bubble interacts with the rest of the triangulation would push toward an affirmative answer to Question 2 (that K4 is the only convergent one on the sphere).\n\nNext Steps (concrete, testable)\n\n1) Formalize and prove the full version of Proposition 5 by induction on |C| using the Whitney property; extract as a corollary that every maximal clique of kG equals T(v) in the disc.\n2) Define Φ(G) = |{T(v) : v ∈ V(G)}| for disc triangulations and prove Φ(k^2G) < Φ(G) unless Φ(G) = 1. This would prove that every finite Whitney triangulation of the disc is k-null, answering Question 1 affirmatively.\n3) Compute k^n on several small disc triangulations (Δm patches for m = 1,…,5) to empirically verify Φ-reduction and to refine the inductive peeling argument.\n4) For sphere triangulations, develop a “K4-bubble” lemma: show that the presence of a K4 whose four facial triangles meet additional structure forces an unbounded growth of some finite invariant along k^n (e.g., an adapted version of the degree-26-based invariant from the δ ≥ 6 theory). Verify on octahedron and icosahedron, and attempt to generalize.\n\nSummary\n\n- We proved basic, verifiable lemmas: (i) K4 does not occur in Whitney triangulations of the disc; (ii) maximal cliques of G are the facial triangles; (iii) a degree formula in kG from local degrees in G; and gave a structural reduction (Proposition 5) identifying maximal cliques of kG with vertex-stars in the K4-free disc case (rigorous first bullet, sketched second bullet).\n- We extracted a canonical quotient description of k^2G for disc triangulations in terms of incident-face-stars; this suggests a concrete potential Φ whose strict decrease under k^2 would imply k-nullness for all discs (Question 1). Completing the proof reduces to a precise “boundary peeling” argument.\n- For the sphere (Question 2), we outlined a decomposition-based program focusing on K4-substructures, consistent with known examples; turning this into a divergence criterion remains open but seems tractable by adapting degree-distribution invariants.\n"
}