{
  "content": "Ideas\n\n- Tackle Q1 (discs) via special but nontrivial subclasses and structural identities that the verifier can check directly.\n- Derive an exact degree formula for kG at a face triangle in a Whitney triangulation with boundary; this feeds quantitative arguments and sanity checks.\n- For maximal outerplanar discs (triangulated polygons, i.e., Whitney triangulations of a disc with no interior vertex), analyze k in terms of the dual tree and clique-Helly properties, and identify k^2(D) explicitly. Prove k-nullness in important families (fans, zig-zag triangulations), and reduce the general case to a clean combinatorial operation (3-core) that seems to shrink under two iterations of k.\n- For Q2 (sphere), record a general degree identity for kG and an average degree lower bound, supporting divergence heuristics; point out the gap to a full proof.\n\nLemmas and proofs\n\nLemma 1 (Triangle-degree in kG for Whitney triangulations with boundary).\nLet G be the underlying graph of a finite Whitney triangulation of a disc (so every face is a triangle, boundary allowed). For a face triangle f = {a,b,c}, let Eb(f) be the number of boundary edges of f (0,1,2, or 3) and let B(f) be the number of boundary vertices among a,b,c. Then the degree of the vertex f in kG (i.e., the number of other face triangles intersecting f) is\n\ndeg_{kG}(f) = deg_G(a) + deg_G(b) + deg_G(c) - 6 - B(f) + Eb(f).\n\nIn particular, for closed triangulations (no boundary) we recover\n\ndeg_{kG}(f) = deg_G(a) + deg_G(b) + deg_G(c) - 6.\n\nProof.\nA triangle t contributes to deg_{kG}(f) iff t shares either an edge or exactly one vertex with f. Edge-sharing: each interior edge of f (there are 3−Eb(f) of them) lies in exactly two triangles, so contributes one neighbor. Vertex-sharing without an edge: fix v ∈ {a,b,c}. The number of triangles incident with v equals deg_G(v) if v is interior and deg_G(v)−1 if v is on the boundary. Among these, one is f itself; and additionally, for each interior edge of f incident to v we exclude the unique triangle that shares that edge with f. The count at v therefore is deg_G(v) − χ_B(v) − 1 − (2 − b_v), where χ_B(v) is 1 if v is on the boundary and 0 otherwise, and b_v is the number (0,1,2) of boundary edges of f incident to v. Summing over v ∈ f gives vertex-only contributions (∑_v deg_G(v)) − (∑_v χ_B(v)) − 3 − (6 − ∑_v b_v). Adding the edge-sharing part (3 − Eb(f)) yields\n\ndeg_{kG}(f) = (∑_v deg_G(v)) − (∑_v χ_B(v)) − 3 − (6 − ∑_v b_v) + (3 − Eb(f))\n= (∑_v deg_G(v)) − 6 − (∑_v χ_B(v)) + (∑_v b_v) − Eb(f).\nFinally, ∑_v b_v = 2 Eb(f), giving the claimed expression. The boundary-free case follows by setting B(f)=Eb(f)=0. ∎\n\nCorollary 2 (Fans are k-null in ≤ 2 steps).\nLet D be a fan: a triangulated disc with a single interior vertex x adjacent to all boundary vertices. Then k(D) ≅ K_{deg_D(x)}, hence k^2(D) ≅ K_1.\n\nProof.\nEach face triangle has exactly one boundary edge; Lemma 1 yields deg_{kD}(f) = deg(x) + deg(u) + deg(v) − 6 − 2 + 1 = deg(x) − 1 when f = {x,u,v} with boundary neighbors u,v. Thus every face has the same k-degree, and two faces intersect iff they share x, hence the face-intersection graph is K_{deg(x)}. The clique graph of a clique is K_1. ∎\n\nMaximal outerplanar discs\n\nHere D is a triangulated n-gon with all vertices on the boundary (no interior vertices). Let Tri(D) be the set of face triangles, and for a boundary vertex v let P_v be the set of face triangles incident with v.\n\nLemma 3 (Helly for triangles in maximal outerplanar graphs).\nIn a maximal outerplanar graph D, the family Tri(D) of face triangles (which are the maximal cliques of D) has the Helly property: any pairwise-intersecting subfamily of Tri(D) has nonempty total intersection (i.e., a common vertex).\n\nProof sketch.\nMaximal outerplanar graphs are chordal (indeed 2-trees). In a chordal graph, the family of maximal cliques is Helly (the clique tree yields the running-intersection property implying Helly). ∎\n\nProposition 4 (Structure of k(D) and k^2(D) for maximal outerplanar D).\nLet D be a maximal outerplanar disc. Then:\n- The maximal cliques of k(D) are exactly the sets P_v (v a boundary vertex with deg_D(v) ≥ 3). In particular, each P_v induces a clique in k(D), and any maximal clique equals some P_v.\n- The vertices of k^2(D) are in bijection with S := {v in V(D): deg_D(v) ≥ 3}.\n- Two vertices u,v ∈ S are adjacent in k^2(D) iff uv is an edge of D that lies in a face triangle (equivalently, any edge of D). Consequently,\n\nk^2(D) ≅ D[S],\n\nthe induced subgraph of D on S.\n\nProof.\nFirst bullet: any two triangles in P_v meet at v, so P_v is a clique in k(D). Conversely, by Lemma 3 any maximal clique in k(D) has nonempty total intersection, hence equals P_v for the common vertex v; if deg_D(v)=2 then P_v has size 1 and is not maximal. Second and third bullets: vertices of k^2(D) correspond to maximal cliques of k(D), i.e., to P_v with v∈S. Two such cliques P_u,P_v intersect iff there is a face containing both u and v, i.e., iff uv is an edge of D. ∎\n\nCorollary 5 (Zig-zag triangulations are k-null in ≤ 3 steps).\nLet D be a maximal outerplanar triangulation whose dual (by edge-adjacent faces) is a path (equivalently, a “zig-zag” triangulation of a polygon). Then k(D) collapses to K_1 in at most three steps.\n\nProof.\nIn such D, exactly two boundary vertices have degree 2, and the others form a path S of length at most two when induced in D. By Proposition 4, k^2(D) ≅ D[S] is either K_1, K_2, or a triangle. Then k^3(D) is K_1. ∎\n\nRemark 6 (General maximal outerplanar discs: a 3-core viewpoint).\nProposition 4 shows that two iterations of k implement “ear pruning”: k^2(D) is the induced subgraph on boundary vertices of degree at least 3. In particular, |V(k^2(D))| < |V(D)| unless D is already a triangle. Iterating this pruning suggests k-nullness of every maximal outerplanar disc; a clean inductive proof would follow if one shows that D[S] is again maximal outerplanar (or at least that repeating the mechanism continues to prune until ≤ 2 vertices remain). This holds in all small and structured cases we checked (fans, zig-zags), and fits the known 2-tree decomposition of maximal outerplanar graphs; formalizing this as a proof-by-pruning is a promising next step.\n\nSphere triangulations (towards Q2)\n\nLemma 7 (Triangle-degree identity, closed case).\nLet G be a Whitney triangulation of the sphere (no K4 case so triangles are maximal cliques). For a face f = {a,b,c},\n\ndeg_{kG}(f) = deg_G(a) + deg_G(b) + deg_G(c) − 6.\n\nConsequently,\n\n(1)  Sum_{f∈Tri(G)} deg_{kG}(f) = ∑_{v∈V(G)} deg_G(v)^2 − 3F,\n\nwhere F is the number of faces of G. In particular, the average degree of kG satisfies the lower bound\n\n(2)  2|E(kG)|/|V(kG)| ≥ 3·(2|E|/|V|) − 6 = 3·avgdeg(G) − 6.\n\nProof.\nThe formula is the boundary-free specialisation of Lemma 1. Summing over triangles and using “#triangles at v = deg_G(v)” yields (1). Cauchy–Schwarz then gives ∑deg^2 ≥ (∑deg)^2/|V| = (2|E|)^2/|V| and F = 2|E|/3, which implies (2). ∎\n\nExample 8.\n- Octahedron (4-regular): each face has k-degree 4+4+4−6 = 6.\n- Icosahedron (5-regular): each face has k-degree 5+5+5−6 = 9.\nThese re-confirm high degrees in kG on the sphere outside K4. While this does not prove divergence, it supports the heuristic that non-K4 spherical triangulations should be k-divergent.\n\nObstacles\n\n- Maximal outerplanar general case: to conclude k-nullness uniformly, we need a robust invariant across two-step iterations. Proposition 4 expresses k^2(D) as the induced subgraph on S = {deg≥3}. A clean proof that repeating this mechanism keeps us in the “same” class and terminates (e.g., that D[S] remains maximal outerplanar, or that its triangles are exactly the maximal cliques generating the next step) would settle the case. This is plausible via the 2-tree structure but requires careful induction (simultaneous ear removals may interact).\n- Spherical case: Lemma 7 gives strong degree growth at the first iteration, but convergence vs divergence depends on more than average degree. Bridging to existing divergence machinery (e.g., via substructure inflation as in the δ≥6 theory) for δ=4,5 remains open.\n\nNext steps\n\n- Formalize and prove: for maximal outerplanar D, D[S] from Proposition 4 is again maximal outerplanar (equivalently: the “3-core” of a 2-tree is again a 2-tree or trivial). Then an induction on |V| (prune all degree-2 vertices, iterate) would give k-nullness of all maximal outerplanar discs.\n- Extend the Helly-based argument to Whitney discs with a bounded number of interior vertices: characterize maximal cliques of k(D) as “stars” around interior or boundary vertices; identify k^2(D) as an induced subgraph obtained by simultaneous pruning of degree-2 boundary vertices and “fan-like” interior vertices. Verify on small families (two-center fans, ladders).\n- Computational check: exhaustive enumeration of triangulated discs up to, say, 9 boundary vertices and small counts of interior vertices to search for a counterexample to k-nullness or to test the two-step pruning hypothesis.\n- Sphere: attempt a “no 2-cycle” invariant. For non-K4 spherical triangulations, try to show that some finite graph parameter (e.g., the number of induced C4’s in k^n(G), or diameter/average distance) is strictly increasing along a subsequence, preventing eventual periodicity. Start with near-regular cases obtained from octahedron/icosahedron by a few edge flips.\n\nSummary of progress\n\n- Derived and proved an exact degree formula for vertices of kG corresponding to face triangles, valid with and without boundary (Lemma 1). This can be used to check computations and bound degrees in examples.\n- For maximal outerplanar discs, identified the maximal cliques of k(D) and computed k^2(D) explicitly as an induced subgraph on boundary vertices of degree ≥ 3 (Proposition 4). Proved k-nullness for nontrivial subfamilies (fans and zig-zags) and reduced the general case to a natural ear-pruning iteration.\n- For sphere triangulations, established a general degree identity and a lower bound on the average degree of kG (Lemma 7), supporting divergence heuristics for non-K4 cases.\n"
}