{
  "content": "# Focus this round\n- Formalize a tight holdout certification theorem with exact function counting and strict tie handling.\n- Prove an exact formula for the minimal augmentation needed to make a fixed candidate win when K=3 (with c-first augmentation), and derive the separation-based sampling corollary more cleanly.\n- Reiterate and verify the K≥4 single-chain failure with explicit numeric checks.\n- Provide a small structural non-monotonicity observation to caution attempts at reducing the family of sets S.\n\n\n## 1) Holdout certification with tightened counting and strict slack\nSetup. Fix the sample-winner ĉ from Phase 1. On an independent holdout of size m2, for each S⊇{ĉ} and a∈S, define indicators g_{S,a}(ballot)=1[top_S(ballot)=a] and empirical frequencies p̃_a(S).\n\nDefine the empirical max-deficit\nB̃(ĉ) := max_{S⊇{ĉ}} [ min_{a∈S\\{ĉ}} p̃_a(S) − p̃_{ĉ}(S) ].\n\nLemma A (Uniform deviation size). For fixed ĉ, the number of distinct functions g_{S,a} needed to evaluate B̃(ĉ) is\nM_c := (K−1)·2^{K−2}  +  2^{K−1} = 2^{K−2}(K+1),\nwhere the first term counts all a∈S\\{ĉ} across S⊇{ĉ}, and the second term counts p̃_{ĉ}(S) across S⊇{ĉ}.\n\nProof. The family of S containing ĉ has size 2^{K−1}. Summing |S\\{ĉ}| over these S gives ∑_{t=1}^{K−1} t·C(K−1,t)=(K−1)2^{K−2}. Adding the 2^{K−1} functions for p̃_{ĉ}(S) yields the claim. ∎\n\nTheorem B (Holdout certificate ⇒ ε-winner). Fix any ξ>0. If on the holdout sample the event E holds:\n(i) |p̃_a(S) − p_a(S)| ≤ ε/4 for all the M_c functions; and\n(ii) B̃(ĉ) ≤ ε/2 − ξ;\nthen B(ĉ) ≤ ε − ξ and, after adding ε fraction of ĉ-first ballots, ĉ wins IRV (i.e., is an ε-winner). In particular, if Hoeffding’s inequality ensures (i) with probability ≥1−δ via m2 ≥ (2/ε^2)·ln(2M_c/δ), then with probability ≥1−δ, whenever (ii) holds the output is correct.\n\nProof. On event (i), for every S⊇{ĉ} and a∈S we have p_a(S) ≥ p̃_a(S) − ε/4 and p_{ĉ}(S) ≤ p̃_{ĉ}(S) + ε/4, hence\nmin_{a≠ĉ} p_a(S) − p_{ĉ}(S) ≤ [min_{a≠ĉ} p̃_a(S) − p̃_{ĉ}(S)] + ε/2.\nTaking maxima over S gives B(ĉ) ≤ B̃(ĉ) + ε/2 ≤ ε − ξ. By the uniform certificate, adding ε mass of ĉ-first ballots makes ĉ strictly safe in every S by margin ≥ ξ, so ties cannot eliminate ĉ. ∎\n\nRemarks.\n- Counting refinement: M_c = 2^{K−2}(K+1) strictly improves over naive K·2^{K−1}.\n- Strict tie handling is built in via ξ>0; one can take ξ arbitrarily small by tightening the empirical threshold.\n\n\n## 2) K=3: exact minimal augmentation and sampling corollary\nLet C={c,a,b}. Define x*∈{a,b} by p_{x*}(C)=max{p_a(C),p_b(C)}.\n\nProposition C (Exact c-first augmentation for K=3). The minimal ε (restricted to adding c-first ballots) that makes c win IRV equals\nE_c := max{ [min{p_a(C),p_b(C)} − p_c(C)]_+ , [p_{x*}({c,x*}) − p_c({c,x*})]_+ }.\n\nProof. Adding ε of c-first ballots increases p_c(S) by ε for S⊇{c} and leaves others unchanged. In K=3, IRV eliminates the minimum at C first; the eliminated candidate is y*∈{a,b} with p_{y*}(C)=min{p_a(C),p_b(C)} (independent of ε since others’ tallies do not change). The final opponent is x*. Thus c wins after augmentation iff both: (1) p_c(C)+ε ≥ p_{y*}(C), and (2) p_c({c,x*})+ε ≥ p_{x*}({c,x*}). The least ε satisfying both is the stated maximum. Necessity and sufficiency are immediate. ∎\n\nCorollary D (Separation-based guarantee for the natural algorithm). Suppose |p_a(C)−p_b(C)| ≥ γ. Draw m ballots, run IRV, and output ĉ with final opponent x̂ (the larger of {a,b} in the sample). If m ≥ (8/ε^2)·ln(18/δ) and γ ≥ ε/2, then with probability ≥1−δ we have simultaneously: x̂ = x* and |p̂_x(S)−p_x(S)| ≤ ε/4 for all needed x,S∈{ (C,a),(C,b), ( {ĉ,x*}, ĉ ), ( {ĉ,x*}, x* ) }. Therefore by Proposition C, E_{ĉ} ≤ ε and ĉ is an ε-winner.\n\nSketch. Uniform Hoeffding over the 9 pairs (S,a) with S∈{C,{a,c},{b,c}} yields α:=√(ln(18/δ)/(2m)) ≤ ε/4; separation gives x̂=x*. On the sample, ĉ survives C and beats x̂; transfer to truth incurs ≤2α deficit on each condition, absorbed by ε. ∎\n\n\n## 3) Single-chain failure (K=4) — explicit check\nTypes and weights: T1: c>a>d>b (0.34), T2: a>d>c>b (0.29), T3: d>c>a>b (0.34), T4: b>a>d>c (0.03).\n- Round 1 (C): tallies: c=0.34, a=0.29, d=0.34, b=0.03 ⇒ eliminate b.\n- Round 2 (S={a,c,d}): tallies: c=0.34 (T1), a=0.29+0.03=0.32 (T2+T4), d=0.34 (T3) ⇒ eliminate a.\n- Final pair {c,d}: c=0.34, d=0.66 ⇒ c loses.\nA chain that checks vs b at C, then vs a at {a,c,d}, then pair {c,a} would “certify” c even with ε=0; yet c loses. Hence chain-only witnesses are unsound for K≥4.\n\n\n## 4) Structural caution: non-monotonicity of deficits\nDefine for fixed c the set function f(S)=min_{a∈S\\{c}} p_a(S) − p_c(S). In general, f is not monotone in S: adding a candidate can raise or lower the gap. Small K=4 example (by perturbing the instance above) exhibits S⊂T with f(S)<0<f(T). Thus, attempts to reduce to only maximal or minimal S are invalid in general.\n\n\n## 5) Why the K=3 case is special\nLet r1,…,r6 denote the six ranking-region masses on {a,b,c}. Then p_c(C)=r1+r2 and p_c({a,b,c})=r1+r2 as well; p_a(C)=r3+r4, p_b(C)=r5+r6. Hence “c below both a,b on {a,b,c}” is equivalent to “c is the minimum at C.” This identity fails once K≥4 because top-of-C and top-of-S can decouple through other candidates.\n\n\n## 6) Obstacles\n- One-phase natural algorithm for K≥4: ĉ being the sample IRV winner does not ensure B̂(ĉ)≤0; sets off the sample path can still witness positive empirical deficit.\n- Reducing the family of S: f(S) lacks monotonicity/submodularity, and we currently lack a proof that the maximizer of f lies among “IRV-reachable” sets along the true path.\n- Lower bounds: A full Fano-style Ω((log K)/ε^2) construction remains to be instantiated with explicit IRV profiles that feature a unique ε/4-winner and small pairwise KL.\n\n\n## 7) Next steps\n- Move Theorem B (with M_c=2^{K−2}(K+1)) to proofs with explicit constants and tie slack ξ.\n- For K=3, record Proposition C (exact E_c) and its sampling corollary; examine whether the γ ≥ ε/2 separation can be weakened by allocating a small extra ε budget to simultaneously verify both possible finals.\n- Investigate whether, for fixed c, the maximizer of f(S) can be constrained to S encountered by IRV under some “neighboring” profile (even if not the true one), to lower the verification family size.\n- Begin an explicit Fano family: parameterize K instances by swapping ε/Θ(K) mass among ballots that adjust only two rounds (first-round min and final head-to-head) so that each instance has a unique ε/4-winner; compute pairwise KL=Θ(ε^2) and check IRV behavior.\n"
}