{
  "progress_md": "Headlines\n- Fix a gap in output.md: the phrase “all other internal adjacencies remain unchanged” is false as stated; what is true (and sufficient) is that the number of j-boundaries internal to each block is preserved by a block swap, hence the net change in B_j is fully determined by the three interface indices per swapped pair.\n- New per-pair inequality: for any fixed bit-level j and any single matched pair (L,R), the contribution to ΔB_j from that pair is in [−2,2]. Summing over pairs that are non-monochromatic at level j yields |ΔB_j| ≤ 2·(# such pairs).\n- Consequence: a per-level factor-3 cap per step: B_j(A′) ≤ 3 B_j(A) and B_j(A) ≤ 3 B_j(A′). This improves Theorem 3’s factor-4 to factor-3.\n- Equal-scale first-step scarcity (from A_0): if all matched pairs have total size s in [L,2L], then only levels j with run-length L_j ≤ s can be affected (and |ΔB_j| ≤ 2·(n/s)), hence only O(1) adjacent levels around the “home scale” L_j≈L can undergo constant-factor changes in that first step.\n\nCorrections to output.md (local, not changing statements)\n- The proof of Theorem 3 currently says “all other internal adjacencies remain unchanged”. This is false literalistically—after swapping L and R the identities of the adjacent pairs across internal indices do change. What holds (and is enough) is:\n  • For any fixed j, the number of j-boundaries internal to L (and to R) is preserved by the swap, because the internal order within L and within R does not change.\n  • Therefore the net change in the total number of j-boundaries across the union U = L∪R equals the change across the three interface indices: (left outer, inner, right outer). Summing over disjoint pairs yields that ΔB_j equals the sum of changes at 3·(#pairs) interface indices. This validates the “three indices per pair” counting for the change in the number (though not for the set) of boundaries.\n\nNew technical lemmas and proofs\n- Lemma A (binary 4-cycle inequality). For any bits p,q,r,s ∈ {0,1}, one has [p≠q]+[q≠r]+[r≠s]−[s≠p] ≤ 2 and also ≥ −2.\n  Proof. Consider the 4-cycle p−q−r−s−p. The sum S := [p≠q]+[q≠r]+[r≠s]+[s≠p] is even and at most 4. Then [p≠q]+[q≠r]+[r≠s]−[s≠p] = S − 2·[s≠p] ∈ {−2,0,2}.\n\n- Lemma B (per-pair ±2 contribution). Fix level j. Let a_L be the j-color of the outside neighbor left of L; a_R the j-color of the outside neighbor right of R; and let L_1,L_k (first/last j-colors of L), R_1,R_m (first/last j-colors of R). For the matched pair (L,R), let Δ_pair denote its contribution to ΔB_j (i.e., the change in the number of j-boundaries inside U=L∪R, which equals the change across the three interfaces as noted above). Then |Δ_pair| ≤ 2.\n  Proof. Using the notation x_a=[a_L≠L_1], y_a=[a_L≠R_1], x_b=[L_k≠R_1], y_b=[R_m≠L_1], x_c=[R_m≠a_R], y_c=[L_k≠a_R], one has Δ_pair = (x_a+x_b+x_c)−(y_a+y_b+y_c). By triangle inequalities [q≠x]−[q≠y] ≤ [x≠y], we get x_a−y_a ≤ [L_1≠R_1] and x_c−y_c ≤ [R_m≠L_k]. Hence\n    Δ_pair ≤ [L_1≠R_1] + [R_m≠L_k] + (x_b−y_b)\n            = [L_1≠R_1] + [R_m≠L_k] + ([L_k≠R_1] − [R_m≠L_1]).\n  Applying Lemma A with (p,q,r,s)=(L_1,R_1,L_k,R_m) gives Δ_pair ≤ 2. The lower bound Δ_pair ≥ −2 follows symmetrically (or by applying the same argument to the inverse swap).∎\n\n- Lemma C (counting pairs that can matter at level j). If the union U=L∪R is j-monochromatic in A (equivalently in A′), then Δ_pair=0. Therefore, letting M_j(A) be the set of matched pairs whose union is not j-monochromatic in A, we have |ΔB_j| ≤ 2·|M_j(A)|.\n  Proof. If U is j-monochromatic, then L_1=L_k=R_1=R_m, hence all three interface indicators are unchanged and Δ_pair=0. Summing Lemma B over pairs in M_j(A) yields the claim.∎\n\n- Theorem 3′ (per-level factor-3 cap). For any A→A′ in one step and any j,\n  B_j(A′) ≤ 3·B_j(A) and B_j(A) ≤ 3·B_j(A′).\n  Proof. As in output.md, every pair whose union is j-monochromatic gives Δ_pair=0; the remaining pairs are at most |T_j(A)|=B_j(A)−1 by disjointness (charge each such pair to, say, its leftmost internal j-boundary). Then\n    |B_j(A′) − B_j(A)| ≤ ∑_{pairs} |Δ_pair| ≤ 2·|M_j(A)| ≤ 2(B_j(A)−1),\n  which implies B_j(A′) ≤ B_j(A) + 2(B_j(A)−1) ≤ 3B_j(A). Apply the bound to the inverse step for the reverse inequality.∎\n  Remark. This improves the factor-4 cap to factor 3 and implies |Δ log_2 B_j| ≤ log_2 3 per step.\n\nFirst-step equal-scale scarcity from A_0\n- Setup. Let A=A_0 be the bit-reversal input. Fix a step whose matched pairs all have total size s in [L,2L]. Recall L_j=2^{d−1−j} is the j-run length in A_0, and B_j(A_0)=2^{j+1}.\n- Observation. If L_j > s then every union U=L∪R is j-monochromatic in A_0, hence by Lemma C the step has ΔB_j=0. Therefore only levels j with L_j ≤ s can be affected at all. Equivalently, j ≥ d−1−⌊log_2 s⌋.\n- Bound on magnitude. The number of matched pairs m satisfies m·s ≤ n, hence m ≤ n/s. By Lemma B, |ΔB_j| ≤ 2m ≤ 2n/s for every j. Thus for any j with L_j ≪ s the relative change is tiny at A_0: |ΔB_j|/B_j(A_0) ≤ (2n/s)/2^{j+1} = 2·(2^{d−j−1}/s) = 2·(L_j/s).\n- Consequence (first-step “active levels”). For a constant-factor change (say a ≥ 2× drop) at level j we need |ΔB_j| ≥ B_j(A_0)/2 = 2^{j}/2. The bound above forces L_j ≳ s (indeed L_j ≥ s/4 suffices to violate). Hence, in such an equal-scale step from A_0, only those j with L_j within a constant factor of s can undergo a constant-factor change. There are O(1) such adjacent levels.\n- Why useful. This is a clean, checkable special case of the sought cross-level scarcity: in an equal-scale step, only O(1) levels can progress by a constant factor from A_0. It suggests the “home level” approach: pairs of size s are only capable of large impact around the dyadic scale L_j≈s.\n\nExamples and sanity checks (n=16)\n- Take A_0=[0,8,4,12,2,10,6,14,1,9,5,13,3,11,7,15]. For j=0, B_0=2; j=1, B_1=4; j=2, B_2=8; j=3, B_3=16.\n- Pair singletons (s=2). Then m≤n/s=8 and per-level |ΔB_j|≤2m≤16. From A_0: only levels with L_j≤s=2 can be affected, i.e., L_3=1, L_2=2; j∈{2,3}. Indeed, j=0,1 are untouched (monochromatic unions). This matches the observation.\n- Pair 4-blocks (s=8). Only levels with L_j≤8, i.e., j∈{1,2,3}, can be affected in the first step.\n\nObstacles and gaps\n- The per-level factor-3 cap (Theorem 3′) still allows ΔΦ(A)=∑_j |Δ log_2 B_j| to drop by O(d) per step in principle—hence only Ω(log n) steps from this argument alone. We still need a cross-level scarcity result to show that only O(1) levels can experience constant-factor progress per step globally (not just in the equal-scale-first-step special case).\n- The equal-scale scarcity proved here relies on A_0’s rigid dyadic runs. After the first step, run lengths cease to be uniform, so the argument does not extend immediately.\n- The “size lemma” Δ_j ≤ C·∑_p min{1, s(p)/L_j} is false in general (as noted in notes.md) and should not be used. Our per-pair ±2 bound is robust and correct, but too weak alone to prove Ω(log^2 n).\n\nNext steps (concrete, testable)\n1) Curate Theorem 3′ (factor-3 cap) into output.md, with the corrected proof of the “three indices per pair” mechanism and the per-pair ±2 bound (Lemmas A–C). This is a clean improvement and fully rigorous.\n2) Strengthen equal-scale scarcity beyond the first step. Target: If all pairs in a step have sizes within a factor-2 range [L,2L], then for any input A, only O(1) levels j can have |ΔB_j| ≥ θ·B_j(A) for a fixed θ∈(0,1). Approach: combine (i) the per-pair ±2 bound (so |ΔB_j| ≤ 2m ≤ 2n/L), with (ii) lower bounds B_j(A) ≳ n/L_j valid under mild structural hypotheses on A (to be identified), and (iii) an invariant controlling how small B_j(A) can be across many j simultaneously.\n3) Home-level charging: Assign to each pair p its home index h(p) with L_{h(p)}≈|p|. Prove a “demand lemma”: constant-factor progress at level j requires Ω(B_j(A)) pairs with h(p)=j (not just any pairs). This would imply that only O(1) levels can see constant-factor progress in a step since ∑_p 1_{h(p)=j} ≤ n/L_j and ∑_j n/L_j=O(n).\n4) Small-n brute force (n=16,32): For random partitions/matchings from A_0, measure the number of levels with ≥2× drop in B_j; check whether it is bounded by a small constant; log the configurations saturating Theorem 3′ (per pair Δ_pair=±2) to guide structural characterizations.\n\nWhy these steps matter\n- Theorem 3′ improves a central per-level cap and repairs the proof. The equal-scale first-step scarcity is a concrete, verifiable instance of the cross-level bottleneck and a useful base case for induction-type arguments.\n- The home-level charging is the most promising path to an Ω(log^2 n) lower bound: combined with Theorem 3′, it would bound per-step reduction in Φ(A)=∑_j |log_2 B_j(A)−(d−j)| by an absolute constant, as only O(1) levels can reduce by Θ(1) and the rest by o(1).\n"
}