{
  "progress_md": "Status and focus\n- Objective: Prove the speedup on bounded-degree (nonoriented) trees: any LCL solvable in O(1) rounds in deterministic Online-LOCAL(t) admits an O(log* n) deterministic LOCAL algorithm.\n- Current archive: Positive bridges are solid (order-robust sequential⇒LOCAL; output-only and (W,t)-quiescent bridges with correct radii; Lemma 7 and Lemma 9 for 2t-commutativity/witness localization; Lemma 8 for quiescent batching with K=2t+2W+1). Lower-bound route is partially scaffolded: output.md now contains Lemma S (edge-local adversarial scheduling) but not the elimination steps.\n\nNew clean ingredients (node-centric admissible sets and node-local scheduling)\n- Lemma S_node (Schedule-localization around a node). Let A be any deterministic Online-LOCAL(t) algorithm on a bounded-degree tree G and w any vertex. There exists an arrival schedule σ(w) such that: (i) all vertices of B(w,2t+1) arrive before any vertex outside B(w,2t+1); (ii) all edges incident to w become decidable within this prefix (in edge-decided semantics: by the time both endpoints of each incident edge have arrived); (iii) the entire execution up to the time when all edges incident to w are decided depends only on the labeled type of B(w,2t+1) (graph structure, port colors, IDs) and the internal arrival order within B(w,2t+1); vertices outside are absent and irrelevant up to that time.\n  Why true: This is the node-analogue of Lemma S. List all vertices in B(w,2t+1) first (in any order ending with the last endpoints of incident edges), then list the rest. During the prefix, all signal paths that can influence the decisions on edges incident to w have length ≤ t within the active regions attached to those edges; the farthest relevant sources lie within distance ≤ 2t+1 from w (union over incident edges), so the outside can be kept absent without loss. This avoids any converse normalization and relies only on adversarial scheduling.\n\n- Definition (U_w and node-type). For a node w and parameter t, define U_w := ⋃_{e∋w} B(e,2t). On a tree, U_w ⊆ B(w,2t+1). Let X_w denote the isomorphism type (structure, port colors, and ID-graph labels) of U_w, taken up to rooted-isomorphism at w.\n\n- Lemma T (Node-centered admissible outward ports). Consider sinkless orientation under edge-decided semantics and a deterministic Online-LOCAL(t) algorithm A on Δ-bounded trees with the ID-graph framework. For each node w and its type X_w, define T_w(X_w) ⊆ Ports(w) as follows: p ∈ T_w(X_w) iff there exists an internal arrival order τ on U_w (with the outside absent) under which A orients the incident edge in direction “out of w along port p,” when all incident edges of w are decided. Then:\n  (a) Well-defined dependence and finiteness: T_w depends only on X_w. The family of possible X_w is finite for fixed Δ,t via the ID-graph framework.\n  (b) Nonemptiness (node-side “no-sink-in-sets”): For every X_w, T_w(X_w) ≠ ∅.\n  Justification: (a) follows from Lemma S_node (the adversary can fix all arrivals to lie inside U_w before any outside node, so the transcript and all incident-edge decisions depend only on the labeled type and internal order). (b) If T_w(X_w)=∅, then under every internal order on U_w with the outside absent, A would necessarily decide all incident edges into w, making w a sink—contradicting correctness for some valid arrival order (the one confined to U_w).\n  Remarks: This node-level set construction avoids the compositionality flaw of per-edge sets on B(e,2t): it quantifies over the whole finite neighborhood U_w in which mutual interactions among the incident edges of w can occur before they are decided.\n\nTowards a safe elimination framework (outline acceptable for auditing)\n- Edge→Node half-step (formalizable now). Starting from an Online-LOCAL(t) algorithm A (edge-based semantics), define the node-level set rule T_w on X_w as above. Invariants: (I1) T_w(X_w) is nonempty for all X_w; (I2) Type space is finite (bounded depth 2t+1 in the ID-graph); (I3) The rule depends only on the local type X_w (adversarial scheduling ensures outside is absent). This is the “universal union over internal orders” step at node level.\n- Node→Edge half-step (to be completed next round, but scoped). Given node-level sets T_w on U_w, derive per-edge admissible orientation sets S_e on X_e (type of B(e,2t)) as follows: o ∈ S_e(X_e) if there exists a joint type Z = U_u ∪ U_v (u,v are endpoints of e) and an internal order on Z (outside absent) such that the chosen outward ports at u and v belong to T_u(X_u) and T_v(X_v) respectively, and the resulting orientation of e is o while all incident edges at u and v are decided consistently. We will keep quantification local to Z (radius ≤ 2t+1 around e) and use adversarial scheduling as in Lemma S_node. We will prove: (J1) S_e(X_e) is nonempty; (J2) it depends only on X_e (finite); and (J3) the node-side nonemptiness of T_w is preserved in the next node step. This yields a (t−1/2)-step reduction and can be iterated. Details forthcoming.\n\nExplicit tightness example for the “+1” in Lemma 8 (quiescent, W=0, t=2)\n- Proposition (+1 necessity for quiescent batching). On a path, with W=0 and t=2, coloring G^{2t}=G^{4} is insufficient to ensure phase independence under Lemma 8; G^{2t+1}=G^{5} is necessary. Construction:\n  • Graph and centers: Take a path and choose two centers a,b at distance 2t+1=5. Their active regions are R_a = B(a,2) and R_b = B(b,2), which are disjoint but adjacent by a single cross-edge (x,y) with x ∈ R_a at dist(a,x)=2 and y ∈ R_b at dist(b,y)=2.\n  • Quiescent algorithm A (W=0, t=2): In the 2-round arrival window of color-i vertices, only nodes in the active regions change state; all others are quiescent. Round 1: every node in R := R_a ∪ R_b sends its initial bit b(v) (e.g., computed from ID(v) modulo 2) to all neighbors. Round 1 update: for each v ∈ R, set s(v) = XOR of received bits. Round 2: each v ∈ R sends s(v) to neighbors in R; outputs inside R can depend on s(·). Nodes outside R never change state (quiescent) and cannot forward.\n  • Coupling via the cross-edge: In round 1, y sends b(y) to x across the single cross-edge (x,y). Thus s(x) depends on b(y) at the end of round 1. In round 2, x propagates s(x) one hop inward within R_a; hence the transcript inside R_a (already at x and its neighbor) depends on b(y), a boundary variable in R_b. This violates the Claim 8.1 independence when K=2t (adjacent active regions). Coloring G^{2t+1} forbids any cross-edge (dist(R_a,R_b) ≥ 2), restoring independence as in Lemma 8.\n  • Conclusion: The +1 in K=2t+1 is necessary already for t=2 under standard LOCAL timing and quiescence; without it, one-round cross-edge signals couple the regions in the same phase.\n\nWhy these are progress\n- We remove the compositionality bug in the edge-centered sets by moving to node-centered admissible sets T_w on U_w = ⋃ B(e,2t). This is the correct granularity for capturing all interactions among edges incident to a node before their decisions, and it is compatible with adversarial local-first scheduling (no boundary freezing).\n- We introduce Lemma S_node (node-local scheduling), the exact node analogue of the already archived Lemma S; it is needed to justify that T_w(X_w) depends only on the type X_w.\n- We provide a fully explicit, round-by-round, quiescent W=0, t=2 counterexample establishing the necessity of the +1 in K, ready to be archived as a proposition following Lemma 8.\n\nGaps and corrections suggested for output.md\n- Missing: Node-local adversarial scheduling lemma. Recommend adding Lemma S_node as stated above; its proof mirrors Lemma S by listing B(w,2t+1) first and deferring the outside.\n- Missing: Node-level admissible sets. Add Lemma T (node-centered admissible outward ports) with precise definitions: U_w, X_w, T_w(X_w); prove dependence on X_w and nonemptiness by adversarial schedules and correctness.\n- Lower-bound step caution: Do not add per-edge set S_e based solely on B(e,2t) with a “no-sink-in-sets” argument; as the verifier noted, that argument is non-compositional. Shift the set framework to the node level as above and only then define a safe node→edge half-step over Z = U_u ∪ U_v (to be written next round).\n- +1 tightness: Promote the “+1 is necessary” remark after Lemma 8 to a formal proposition using the explicit t=2 construction above.\n\nObstacles and what remains\n- Formal node→edge half-step: We must define S_e(X_e) using only local data from Z = U_u ∪ U_v (radius ≤ 2t+1), prove nonemptiness and the preservation of node-side invariants when alternating node and edge steps, and quantify exact radius changes (t → t−1/2). This is planned for the next round.\n- Final ID-graph contradiction: After 2t iterations we should obtain a 0-round edge-centered set rule S^{(0)} with nonempty per-edge sets determined by constant-radius types. We then replicate the classical ID-graph contradiction for sinkless orientation. Node-only sets are insufficient for a final contradiction; arriving at edge-level sets is required.\n\nNext steps (auditable)\n1) Archive Lemma S_node (schedule-localization around a node) and Lemma T (node-centered admissible ports) in output.md with full proofs and explicit type finiteness under the ID-graph framework.\n2) Formalize the node→edge universal half-step using Z = U_u ∪ U_v, including: definition of S_e(X_e), proof of nonemptiness and type dependence, and the precise radius drop to 2t (edge-centered). State invariants for iteration.\n3) Add the explicit t=2, W=0, quiescent counterexample as a proposition after Lemma 8, establishing the necessity of K=2t+1.\n4) In a separate subsection, outline the full iteration (2t steps) and the 0-round contradiction via the ID-graph, to conclude the lower bound for sinkless orientation and hence the existential O(log* n) speedup for any O(1)-round Online-LOCAL LCL on trees by Theorem 2.33.\n\nWhy the plan yields the main theorem\n- The node/edge universal elimination (once completed) gives that sinkless orientation has no deterministic constant-t Online-LOCAL algorithm on trees. By the tree LCL classification (Theorem 2.33), any LCL solvable in O(1) Online-LOCAL on trees cannot be in the Θ(log n) or Θ(log log n)/Θ(log n) classes; hence it belongs to the Op1q/Θ(log* n) class, implying the existence of an O(log* n) deterministic LOCAL algorithm.\n"
}