{
  "feedback_md": "High-level assessment. Both reports are aligned with the previously identified flaw: per-edge admissible sets based on B(e,2t) are not compositional at nodes. Moving to node-centered admissible sets on U_w := ⋃_{e∋w} B(e,2t) is the right fix. The proposed Lemma T (node-centered admissible ports) is sound under edge-decided semantics for sinkless orientation: if T_w(X_w)=∅, then in every internal order confined to U_w all incident edges are decided into w, so w is a permanent sink in a valid schedule (outside absent), contradicting correctness. This uses union-over-orders (existential quantification) per port, which is exactly what is needed for a “no-sink-in-sets” invariant at nodes.\n\nWhat to archive now. We can safely add (i) a node-local adversarial scheduling lemma (S_node), mirroring Lemma S but centered at a node; (ii) Lemma T with precise definitions and proof; (iii) a simple node→edge derivation S_e from the endpoint T-sets together with the preserved node-side no-sink invariant and the explicit radius accounting (2t+1 around nodes/edges); and (iv) a concrete quiescent t=2 example establishing the necessity of the +1 in K = 2t+1 in Lemma 8. I have archived all four.\n\nCaveats and corrections. Do not claim finite type spaces unless you explicitly restrict IDs (e.g., via an ID-graph H with bounded alphabet and sufficiently large girth) or impose ID-obliviousness/finite-state. Earlier we noted that finite enumeration over ID-labeled types is false in general. I therefore stated Lemma T without a finiteness clause and added a remark about how finiteness becomes available under the ID-graph framework when we need it for iteration.\n\nOn the proposed example for +1 necessity: the set R_a = B(a,2) was misstated in 01 (it omitted the left side). I provide a cleaned, fully quiescent W=0, t=2 algorithm on a path, with two same-color new arrivals at distance 5 and a single cross-edge between their active regions; in two rounds, a one-hop signal crosses the cross-edge in round 1 and reaches each center in round 2, coupling the regions when K=2t. This exhibits the need for +1.\n\nPromising direction and next steps. The node→edge half-step we just archived is robust and keeps all dependencies within constant-radius type spaces. The missing piece is the symmetric edge→node half-step with tight radius control. A workable template is:\n- Define edge-level sets S_e over X_e = type of B(e,2t+1) by existential quantification over internal orders on Z = U_u ∪ U_v (outside absent); prove S_e(X_e) nonempty and local.\n- Define a next node-level set T′_w from incident S_e (e.g., by universal or “intersection-of-compatibilities” quantification) so that (a) T′_w(X′_w) is still nonempty, (b) depends only on a bounded-radius type X′_w, and (c) the radius drops by 1/2 per half-step or at least stays bounded to allow O(t) alternations to reach radius 0.\n- Keep union/existential at the “expansion” (node) step to preserve nonemptiness, and use intersection/universal at the “contraction” (edge) step to shrink sets. Prove preservation of the node-side no-sink invariant after each alternation.\n- Once the alternation is formalized, invoke the ID-graph framework to obtain a finite set of types and derive the 0-round contradiction for sinkless orientation.\n\nValue triage. The node-centered T_w and S_node are solid and immediately useful; the node→edge composition and the +1 tightness example are correct and worth archiving. The proposed edge→node step and iteration remain to be formalized; keep them in notes and proceed carefully with quantifier polarity and radius accounting. This is “partial success” with clear, actionable next steps.",
  "new_notes_md": "Node-centered admissible sets and safe composition (lower-bound scaffolding)\n\nSetup and motivation.\n- The earlier per-edge universal-set construction on B(e,2t) was non-compositional at nodes: deciding multiple incident edges of a node w in a larger prefix can involve arrivals inside U_w := ⋃_{e∋w} B(e,2t) that are outside an individual B(e,2t) yet influence it before the edge is decided. This invalidates any argument that freezes the boundary of B(e,2t).\n- Remedy: Move admissible-set construction to the node level on U_w, quantify over all internal orders confined to U_w (outside absent), and only then derive per-edge sets from the two endpoint node-sets. This keeps all dependencies within constant-radius type spaces and preserves a node-side “no-sink-in-sets” invariant.\n\nDefinitions.\n- For a node w, let U_w := ⋃_{e∋w} B(e,2t). On trees, U_w ⊆ B(w,2t+1).\n- Fix edge-decided semantics for sinkless orientation: the orientation of an edge e is irrevocably fixed at the moment the second endpoint of e arrives.\n- Let X_w denote the labeled isomorphism type of U_w with root w (graph structure, port numbering, and IDs). For a type X_w, let Ord_w(X_w) be the set of internal arrival orders of U_w that end after the second endpoints of all edges incident to w have arrived; vertices outside U_w are absent up to that time.\n- Define the node-level admissible set of outward ports at w by\n  T_w(X_w) := { p ∈ Ports(w) : ∃ τ ∈ Ord_w(X_w) s.t. the incident edge on port p is oriented out of w when all incident edges at w are decided in the τ-run }.\n\nKey facts (all justified in output.md now).\n- Node-local schedule localization (Lemma S_node): the adversary can list all of U_w first; up to the time all edges incident to w are decided, the transcript depends only on the labeled type X_w and on the internal order on U_w.\n- Lemma T (node-centered admissible ports): For every node type X_w, T_w(X_w) is well defined and nonempty. Proof idea: if T_w(X_w)=∅, then under every internal order on U_w (outside absent) all incident edges are decided into w, permanently making w a sink in a valid schedule.\n- Node→edge derivation: For an edge e=wx, define S_e := { w→x if x corresponds to a port in T_w(X_w) } ∪ { x→w if w corresponds to a port in T_x(X_x) }. Then:\n  • Locality: S_e depends only on the labeled type of B(e,2t+1) (since X_w and X_x are determined within it).\n  • Preserved node-side no-sink: For every node w, there exists an incident edge e with w→• ∈ S_e (because T_w(X_w) ≠ ∅).\n\nInvariants to maintain under alternation.\n- I1 (Local type dependence): T_w(X_w) depends only on X_w (radius ≤ 2t+1); S_e(X_e) depends only on the type X_e of B(e,2t+1).\n- I2 (Node-side nonemptiness): For every X_w, T_w(X_w) ≠ ∅; equivalently, for every node w there exists an incident edge e with an outward option for w in S_e.\n- I3 (Adversarial soundness): T_w is defined via existential quantification over all internal orders on U_w with the outside absent, so it is sound for every global arrival order.\n- I4 (Radius accounting): Node types use radius 2t+1; edge types use radius 2t+1.\n\n+1 necessity in Lemma 8 (quiescent batching).\n- For W=0, t=2 on a path, if we color G^{2t}=G^4 (no +1), two same-color centers a and b can be at distance 5, so R_a = B(a,2) and R_b = B(b,2) are disjoint but have a single cross-edge between boundary nodes x∈R_a and y∈R_b. A quiescent 2-round algorithm can let y’s bit cross to x in round 1 and reach a in round 2, coupling the regions. Coloring G^{2t+1} ensures dist(R_a,R_b) ≥ 2, preventing such coupling. A fully explicit proposition and proof are now archived.\n\nFiniteness of type spaces.\n- As noted earlier, with arbitrary IDs there are infinitely many labeled types of constant-radius balls. For a finite-type iteration, adopt the standard ID-graph framework: fix a finite labeled constant-degree graph H of sufficiently large girth, and restrict attention to H-labeled trees. All local types induced by bounded-radius balls in H are then finite. Lemmas S_node and T hold independently of finiteness; we will invoke finiteness only when we iterate the node↔edge steps.\n\nNext steps.\n- Formalize the symmetric edge→node half-step: define S_e(X_e) by existential quantification over internal orders on Z = U_u ∪ U_v (outside absent), then define a successor node-level T′_w that preserves nonemptiness and locality, ideally shrinking radius by 1/2 per half-step.\n- Prove that alternation maintains I1–I3 and delivers a 0-round contradiction under the ID-graph framework, completing the lower bound for sinkless orientation in Online-LOCAL(t).\n- In parallel, thread the same node-centered set machinery through the output-only model to obtain a simpler, fully finished lower bound there.\n",
  "new_notes_append": "True",
  "new_outputs_md": "Addendum to model for the lower-bound lemmas (port numbering and edge-decided semantics)\n- We assume port numbering at each node: the incident edges at a node w are distinguished by ports 1,…,deg(w). This is standard in LCL formulations and lets us identify “an outward port at w.”\n- Edge-decided semantics for sinkless orientation: the orientation of an edge e=uv is irrevocably fixed at the time the second endpoint of e arrives. (This convention was already used in Lemma S.)\n\nNew lemmas and propositions\n- Lemma S_node (Node-local adversarial scheduling). For any deterministic Online-LOCAL(t) algorithm A on a bounded-degree graph G and any vertex w, there exists an arrival sequence in which all vertices of U_w := ⋃_{e∋w} B(e,2t) arrive before any vertex outside U_w. In such a run, up to the time when all edges incident to w have been decided (i.e., once both endpoints of each incident edge have arrived), the transcript and the decisions on those edges depend only on the labeled isomorphism type X_w of U_w and on the internal arrival order on U_w; vertices outside U_w are absent and irrelevant up to that time.\n  Proof. Let τ be any ordering of the vertices of U_w in which, for every edge e incident to w, the second endpoint of e appears before τ ends. Define the global arrival order by listing U_w according to τ, then all other vertices. During the prefix U_w, the arrived subgraph equals the induced subgraph on U_w; non-U_w vertices are absent and neither send nor receive messages. By edge-decided semantics, every incident edge to w is decided within this prefix. Hence the transcript up to that time and the decisions on those edges depend only on X_w and the internal order τ. □\n\n- Lemma T (Node-centered admissible outward ports; nonemptiness). Consider sinkless orientation under edge-decided semantics and a deterministic Online-LOCAL(t) algorithm A on bounded-degree graphs. For a node w with type X_w (the labeled isomorphism type of U_w := ⋃_{e∋w} B(e,2t) rooted at w), define\n  T_w(X_w) := { p ∈ Ports(w) : there exists an internal arrival order τ on U_w, with the outside absent, such that when all edges incident to w have been decided in the τ-run, the edge on port p is oriented out of w }.\n  Then T_w(X_w) is well defined (depends only on X_w) and T_w(X_w) ≠ ∅ for every X_w.\n  Proof. Well definedness follows from Lemma S_node: if we list U_w first, then up to the time all edges incident to w are decided, the transcript depends only on X_w and the internal order on U_w, so admissibility of a port p is a property of X_w. For nonemptiness, suppose T_w(X_w)=∅. Then, for every internal order on U_w with the outside absent, all incident edges to w are decided into w by the time they are all decided. Because these decisions are irrevocable, w is permanently a sink in each such run. But these are valid adversarial schedules; thus A would be incorrect on some arrival order, contradicting correctness. Hence T_w(X_w) ≠ ∅. □\n  Remark. If one adopts the standard ID-graph framework (restricting IDs to come from a fixed finite labeled high-girth graph H), the family of possible X_w is finite for fixed Δ and t. We do not need finiteness for Lemma T itself; it becomes useful for iterative elimination.\n\n- Definition (Node→edge derived admissible sets). Given node-level rules X_w ↦ T_w(X_w), define for each edge e=wx the per-edge admissible orientation set\n  S_e := { w→x if the port at w towards x lies in T_w(X_w) } ∪ { x→w if the port at x towards w lies in T_x(X_x) }.\n\n- Corollary (Preserved node-side no-sink-in-sets and locality). With S_e as above:\n  (a) For every node w, there exists an incident edge e with w→• ∈ S_e.\n  (b) S_e depends only on the labeled type of B(e,2t+1).\n  Proof. (a) By Lemma T, T_w(X_w) ≠ ∅, so some incident port p at w is admissible, i.e., oriented w→x under some internal order on U_w; by the definition of S_e, w→x ∈ S_{wx}. (b) The type X_w is determined by B(w,2t+1), and X_x by B(x,2t+1). On a tree, U_w ⊆ B(w,2t+1) ⊆ B(e,2t+1) and U_x ⊆ B(x,2t+1) ⊆ B(e,2t+1). Hence X_w and X_x (and therefore S_e) are functions of the labeled type of B(e,2t+1). □\n\n- Proposition (Necessity of the +1 in Lemma 8 for W=0, t=2). There exists a deterministic quiescent Online-LOCAL(2) algorithm A on paths and a phase induced by a proper coloring of G^{2t}=G^4 such that two same-color vertices a and b at distance 5 are processed in the same phase, their active regions R_a=B(a,2) and R_b=B(b,2) are disjoint but adjacent by a single edge (x,y) with x∈R_a, y∈R_b, and within that phase the transcript inside R_a depends on the initial state in R_b (and vice versa). Consequently, K=2t (without the +1) does not guarantee phase independence in Lemma 8.\n  Proof. Define A as follows (W=0, quiescent): when a vertex v arrives, run two synchronous LOCAL rounds on the arrived graph. Round 1: every node at distance exactly 2 from v sends its initial bit b(u) (e.g., ID(u) mod 2) to its neighbor toward v; all other nodes send 0. Round 2: each node forwards any bit it received in round 1 one hop toward v; v outputs the XOR of bits received in round 2 (default 0 if none). Only nodes in B(v,2) change state during v’s window, so A is quiescent with t=2. Now fix a proper coloring of G^4 and choose same-color a,b at distance 5 on the path so that R_a and R_b are disjoint and adjacent by a single cross-edge (x,y) with x∈R_a at dist(a,x)=2 and y∈R_b at dist(b,y)=2. In the phase for this color, declare both a and b to arrive simultaneously and execute two rounds. In round 1, y sends b(y) to x across the cross-edge. In round 2, x forwards that bit one hop inward toward a, and it reaches a in two hops in R_a (y→x in round 1, x→a in round 2 via the unique shortest path inside R_a). Thus a’s transcript (and hence its output) depends on b(y), a value from R_b. Symmetrically, b’s transcript depends on b(x). Therefore, with K=2t the per-region transcripts are coupled. If instead K=2t+1, then any two same-color active regions are at distance at least 2 (no cross-edge), and this coupling is impossible, as used in Lemma 8. □",
  "new_outputs_append": "True",
  "verdict": "partial success"
}