{
  "content": "# Goal and plan\nWe seek an analogue of the 2D theorem for the 3D coloring c3 on V=[n]^3: every nontrivial U⊂[n]^3 spans an edge whose color appears exactly once in G[U]. I lay down a counting “dictionary” for all 13 types in 3D (anchored vs balanced cases), extract immediate corollaries that give uniqueness under simple witness conditions, and isolate a slicing lemma that lifts a 2D–unique color in a single z–plane to a 3D–unique color provided a mild “base isolation” holds. Then I outline a strategy to combine these ingredients toward the full 3D result.\n\nThroughout, for a vertex p=(x,y,z) write\nNE3(p):={q∈U: q_x>x, q_y>y, q_z>z}.\nFor a fixed z, let U_z={ (x,y): (x,y,z)∈U } and inside the slice define\nNE2^{(z)}(x,y):= { (x',y')∈U_z: x'>x, y'>y }.\nSimilarly, for a fixed pair (y,z) let the x–fiber U_{y,z}={x: (x,y,z)∈U}, and analogously for other pairs.\n\n\nIdeas: anchored vs balanced types and multiplicity formulas\n\nFix a type T, whose support J(T)⊆{x,y,z} is the set of coordinates where the endpoints differ, and whose sign pattern is taken up to global negation. I call T anchored if, on J(T), all nonzero signs are equal (so one endpoint is simultaneously the minimizer on all of J(T)); otherwise balanced.\n\nI. |J|=3 (all three coordinates differ)\n\n• Anchored (+++ up to ±). Color is (T; α,β,γ) with (α,β,γ) the minima. Multiplicity:\nFact A3. For p=(α,β,γ), the number of edges of color (T;α,β,γ) equals 1_{p∈U}·|NE3(p)|.\nIn particular, uniqueness holds iff p∈U and |NE3(p)|=1.\nWhy useful: directly generalizes 2D Fact t1.\n\n• Balanced with one minus, say (+,+,−) up to ±. Then the minima are α on x, β on y, and γ on z, but these minima belong to two different endpoints. Define\na_{xy|z}(α,β,γ):= #{ u∈U: x(u)=α, y(u)=β, z(u)>γ },\nb_{z|xy}(α,β,γ):= #{ v∈U: z(v)=γ, x(v)>α, y(v)>β }.\nFact B3(+,+,−). The multiplicity equals a_{xy|z}(α,β,γ)·b_{z|xy}(α,β,γ).\nProof sketch: Each unordered pair is uniquely oriented (x,y increase, z decreases). Then min x,y are realized at u with (α,β,·) and min z at v with (·,·,γ); this gives a bijection between edges of that color and pairs u,v as above. The other two one-minus patterns are analogous with the obvious relabeling.\nWhy useful: reduces multiplicity to a product of two independent counts across perpendicular fibers, mirroring 2D Fact t2.\n\nII. |J|=2 (one coordinate equal, say z equal)\n\nWithin each z–slice we are back in 2D. Let T_xy^= denote a type supported on {x,y} with z equal.\n\n• Anchored (same sign on x,y). Color is (T_xy^=; α,β). Multiplicity:\nFact A2(z–slices). The total number of edges of this color equals\n∑_{z=1}^n 1_{(α,β,z)∈U} · | NE2^{(z)}(α,β) |.\nWhy useful: decomposes across z–slices; anchored forces a base vertex (α,β,z) inside the slice.\n\n• Balanced (opposite sign on x,y). Color is (T_xy^=; α,β). Put, for each z,\nr^{(z)}(α,β):= #{ (α,y,z)∈U: y>β },  s^{(z)}(α,β):= #{ (x,β,z)∈U: x>α }.\nFact B2(z–slices). The multiplicity equals ∑_{z=1}^n r^{(z)}(α,β)·s^{(z)}(α,β).\nWhy useful: again a product structure per slice, then summed over slices.\n\nThe two other choices of the equal coordinate are symmetric.\n\nIII. |J|=1 (only one coordinate differs)\n\nSay J={x}, y and z are equal. Color is (T_x; α) with α=min x. Define for each pair (y,z)\nt_{y,z}(α):= #{ x>α: (x,y,z)∈U }.\nFact A1. The multiplicity equals ∑_{(y,z)} 1_{(α,y,z)∈U} · t_{y,z}(α).\nSymmetric statements hold for J={y} and J={z}.\nWhy useful: reduces to 1D counts on lines (fibers).\n\n\nExamples (sanity checks)\n\n1) Two points u=(1,1,2), v=(2,2,1). Type is (+,+,−) up to ± with minima (α,β,γ)=(1,1,1). Here a_{xy|z}=#{(1,1,2)}=1 and b_{z|xy}=#{(2,2,1)}=1, hence multiplicity is 1.\n\n2) Anchored |J|=2 within a fixed z. Let U_{z0} contain p=(α,β,z0) and exactly one q=(x',y',z0) with x'>α,y'>β; assume no (α,β,z) exists for z≠z0. Then Fact A2 gives multiplicity 1 (one from z0, zero from other slices).\n\n\nRigorous lemmas extracted (immediate consequences)\n\nLemma 1 (anchored 3D win). If there exists p∈U with |NE3(p)|=1, then G[U] has a unique color, namely the anchored |J|=3 color (T=+++ up to ±) with minima at p.\nProof: Fact A3.\n\nLemma 2 (anchored 2D-in-slice lift). Fix z0 and suppose there exist α,β with (α,β,z0)∈U and |NE2^{(z0)}(α,β)|=1, and furthermore (α,β,z)=∉U for all z≠z0. Then the |J|=2 anchored color (x,y change, z equal) with minima (α,β) appears exactly once in G[U].\nProof: Fact A2 gives multiplicity 1 at z0 and 0 at z≠z0.\n\nLemma 3 (balanced 3D product). For (+,+,−) up to ±, if a_{xy|z}(α,β,γ)=s=b_{z|xy}(α,β,γ)=1, then the corresponding color is unique in G[U].\nProof: Fact B3.\n\nRemark (what each lemma buys): Lemma 1 is a direct 3D analogue of the 2D type–1 uniqueness trigger. Lemma 2 is a robust slicing tool: it turns a 2D anchored uniqueness inside one plane into a global uniqueness once the base pair (α,β) does not occur in other slices. Lemma 3 supplies a new 3D–only uniqueness mechanism (balanced |J|=3), unavailable in 2D.\n\n\nLex-maximal eligible points in 3D and a local antichain\n\nDefine a point a∈U to be 3D–eligible if NE3(a)≠∅. Order triples lex in (z,y,x). A lex–max among 3D–eligible points is any a maximizing (z(a),y(a),x(a)) among {p∈U: NE3(p)≠∅}.\n\nLemma 4 (3D lex antichain). If a is lex–max among 3D–eligible points, then NE3(q)=∅ for every q∈NE3(a).\nProof: If q∈NE3(a) had some r∈NE3(q), then r has (z(r),y(r),x(r))>(z(q),y(q),x(q))>(z(a),y(a),x(a)), so r would be 3D–eligible and lex–larger than a, a contradiction.\n\nCorollary 4.1. If |NE3(a)|=1, Lemma 1 applies and we are done.\n\nObstacle: In 2D, Lemma 4 implied that NE(a) was an antichain for the 2D NE order and powered the row/column “propagation.” In 3D, Lemma 4 controls only the 3D–NE order (strict in all three coordinates). It no longer prohibits 2D–NE relations inside a fixed z–slice (z equal), so the exact 2D propagation cannot be transplanted verbatim.\n\n\nA safe slicing lemma for anchored |J|=2 types\n\nDefinition (base–isolation in a slice). Call (α,β) isolated at z0 if (α,β,z0)∈U and (α,β,z)=∉U for all z≠z0.\n\nLemma 5 (slice-to-global uniqueness). Let z0 be any slice with |U_{z0}|≥2. If, inside the 2D graph on U_{z0} under the 2D coloring (types 1–4 as in the given 2D proof), there exists an anchored type–1 edge from a base (α,β) with |NE2^{(z0)}(α,β)|=1 and (α,β) isolated at z0, then G[U] has a unique color (the |J|=2 anchored xy–type with minima (α,β)).\nProof: Precisely Lemma 2.\n\nRemark. The 2D theorem guarantees some unique color in U_{z0}, but it may be of type 2 (opposite signs) or a horizontal/vertical type, which is not directly safe to lift. Lemma 5 requires specifically a type–1 (anchored) uniqueness in the slice plus isolation of its base pair across slices.\n\n\nWhy these are useful here\n\n• The counting dictionary provides exact multiplicities for every color, turning the global uniqueness goal into concrete witness conditions, particularly the “=1” triggers in Facts A3, B3, A2, B2, A1.\n\n• Lemmas 1–3 enumerate three disjoint mechanisms that force a unique color: a 3D anchored NE–singleton, a 3D balanced one–minus product singleton, and an anchored 2D singleton safely lifted from a slice. Each can be checked locally (around one vertex, two perpendicular fibers, or one slice) and is independent of the rest of the graph.\n\n• Lemma 4 gives a disciplined way to pick a distinguished point a at which either Lemma 1 applies immediately (|NE3(a)|=1) or one tries to organize “propagation” or a slice attack.\n\n\nObstacles identified\n\n1) Direct 2D propagation does not lift: Lemma 4 does not prevent 2D–NE comparabilities in a fixed z–slice, so the geometric exclusions used in the 2D propagation (e.g., “c1 cannot be left of b2 else b2∈NE(c1)”) need genuine 3D replacements.\n\n2) Lifting a 2D unique color from a slice is not automatic: horizontal/vertical (|J|=1 in 3D) and balanced slice–types (|J|=2 opposite signs) can easily be replicated in other slices since the 3D color omits the equal coordinate’s value. Hence isolation is needed (Lemma 5) or a different mechanism (Lemma 3).\n\n\nConcrete next steps\n\nStep A (balanced 3D trigger). Prove a 3D analogue of the 2D “propagation” but aimed at balanced |J|=3 colors via Fact B3: starting from a lex–max 3D–eligible a, either we find q with |NE3(q)|=1 (Lemma 1), or we locate (α,β,γ) with a_{xy|z}=b_{z|xy}=1 (or a symmetric variant), producing a unique balanced |J|=3 color (Lemma 3). The product structure is promising for a forcing argument because “no uniqueness” compels at least a second witness on one factor, which can be pushed to create a third on the other factor, leading to a contradiction with a suitable extremal choice (to be formalized).\n\nStep B (slice anchoring). Inside any slice U_{z0} with ≥2 points, the 2D proof actually constructs an anchored unique color (type 1 or a horizontal/vertical), not necessarily type 2. Isolate the case when the slice’s unique color is type 1, and combine it with base–isolation across slices (Lemma 5). If no slice admits such an isolated base (α,β), set up a descending chain of z–levels forced by “non-uniqueness elsewhere” and show it cannot continue indefinitely.\n\nStep C (fiber sparsity for |J|=1). Use Fact A1 to show: if some line fiber U_{y,z} has exactly two x–points α<α' and no other line fiber contains α, then the color (T_x; α) is unique. Search for such sparse fibers via a simple extremal argument (e.g., fix α minimal appearing in any fiber; if it appears in exactly one fiber, we are done; otherwise try to leverage the repetitions to produce a balanced |J|=3 singleton using Step A).\n\n\nSmall verifiable claims to extract now\n\nClaim 6 (complete multiplicity dictionary). The analogues of Facts A3/B3/A2/B2/A1 hold for every permutation of coordinates and for every sign class in |J|=3 balanced (exactly one minus), |J|=2 anchored/balanced, and |J|=1 anchored. The proofs are routine variants of the two model proofs above (anchored counts by anchoring at a base vertex/fiber; balanced counts factorize into a product along two perpendicular fibers), and the verifier can fill in the symmetric cases.\n\nClaim 7 (two quick-win criteria). If (i) there exists p with |NE3(p)|=1, or (ii) there exist α,β,γ with a_{xy|z}(α,β,γ)=b_{z|xy}(α,β,γ)=1, then G[U] contains a uniquely colored edge under c3.\n\nClaim 8 (safe slice lifting). If some slice z0 contains a 2D–type–1 unique edge with base (α,β) that is isolated across slices, then G[U] has a unique color under c3 (anchored |J|=2 on x,y with z equal).\n\n\nSummary\n\n• I established explicit and general multiplicity formulas in 3D for all relevant type classes. These reduce uniqueness to checking simple local counts (NE–sizes for anchored, and products of independent counts for balanced types).\n\n• Immediate uniqueness mechanisms (anchored 3D, balanced 3D, and slice-anchored 2D) are isolated as lemmas, with short proofs. These are testable on instances and will be useful subroutines in the full argument.\n\n• The main obstacle to porting the 2D proof is that the 3D lex–antichain blocks only strict 3D increases, not 2D increases inside a slice. I outlined two viable routes: a new “balanced–type propagation” using the product counts (Step A), and a “slice anchoring” strategy combining 2D anchored uniqueness with cross-slice isolation (Step B), plus a fiber–sparsity fallback for |J|=1 (Step C).\n\nThe next round will formalize Step A: a propagation lemma for the balanced (+,+,−) class modelled on Fact B3, and a dichotomy showing that a lex–max 3D–eligible a either triggers Lemma 1 or forces a product–singleton as in Lemma 3. This would settle the 3D statement or at least prove a substantial special case."
}