{
  "content": "Ideas\n- Formalize “root-invariance” for saturated sets: for an unrooted property P, the subset S_P={ (G,ρ): G has P }⊂G_{•,D} is saturated with respect to re-rooting within a fixed unrooted graph. The conjecture then becomes: smallness (nowhere dense or meagre) of S_P should not hinge on using the rooted metric that focuses on a particular vertex.\n- Two technical thrusts: (i) a root-free characterization of nowhere density for saturated sets; (ii) a general mechanism showing that “re-rooting” does not enlarge meagre sets too much, via partial homeomorphisms supported on a comeagre domain where neighbors are locally distinguishable.\n\nResult A — Root‑free characterization of nowhere density (proved)\nProposition A1 (nowhere density is root‑invariant for saturated sets). Let P be any property of unrooted graphs and S_P={ (G,ρ)∈G_{•,D} : G has P }. Then S_P is nowhere dense in G_{•,D} if and only if the following equivalent, root‑free statement holds: for every rooted r‑ball F there exists an extension r′‑ball F′ with the property that every D‑bounded connected graph H that contains some vertex v with B_{r′}(H,v)≅F′ fails P. In particular, the nowhere‑dense status of S_P depends only on P (and D), not on where graphs are rooted.\nProof. (⇒) If S_P is nowhere dense, then for every r‑ball F there is an r′‑ball F′ with G_{•}^{F′}⊂G_{•}^F∖S_P by the cylinder criterion. Thus, for any (H,v) with B_{r′}(H,v)≅F′ we have (H,v)∉S_P. Since S_P is saturated, this forces H∉P. (⇐) Conversely, if for each F one can find such F′ forbidding P globally, then G_{•}^{F′}⊂G_{•}^F∖S_P for all F; hence S_P is nowhere dense by the criterion. ∎\nRemark. This immediately certifies root‑invariance of all nowhere‑dense results already in the notes (bridgeless; no cut vertex; χ′=D in the regimes stated), since each construction produces a local obstruction F′ that forbids P globally in any extension.\n\nA generic “re‑rooting” toolkit (for meagre questions)\nWe set up a robust way to re‑root along edges via countably many partial homeomorphisms defined on a comeagre domain where neighbors are locally distinguishable.\n\nDefinitions. For integers m,ℓ≥1, let Bad_{m,ℓ} be the set of (G,ρ)∈G_{•,D} for which there exists a vertex w with dist(ρ,w)≤m and distinct neighbors u≠v of w such that B_{ℓ}(G,u)≅B_{ℓ}(G,v). Let Good_k be the complement of ⋃_{m≤k,ℓ} Bad_{m,ℓ} (so Good_k says: within radius k around the root, at every vertex, different neighbors are eventually distinguishable by some finite radius). Let Good_∞=⋂_{k} Good_k.\n\nLemma B1 (comeagre local rigidity). For all D≥2, Good_∞ is comeagre in G_{•,D}.\nProof (sketch with gadgetry). Fix m,ℓ and a cylinder G_{•}^F. Extend F to F′ by breaking all potential equalities between the ℓ‑balls of pairs of neighbors at each vertex w with dist(root,w)≤m: in the Δ≤D space attach a small asymmetric pendant structure to exactly one of the two neighbors; in the Δ=D space use the degree‑preserving gadgets from the notes (e.g., K_{D+1}−e type and tree‑like expansions) to produce locally unique signatures without violating regularity. This yields a refinement cylinder disjoint from Bad_{m,ℓ}. Hence each Bad_{m,ℓ} is nowhere dense, so Good_k is comeagre for each k and Good_∞ is comeagre. ∎\n\nFor each finite rooted ball type F and each neighbor u of its root that is uniquely identifiable inside some finite radius (as guaranteed on Good_∞), define a partial map τ_{F,u}: Dom(τ_{F,u})→Im(τ_{F,u}) by “move the root from the center to that uniquely singled‑out neighbor.” Both domain and image are open cylinders described by finite balls; τ_{F,u} is a homeomorphism with inverse τ_{F,u}^{−1} given by swapping the chosen edge. There are countably many such τ’s (only countably many finite balls and singling patterns). On Good_∞, for every edge xy, some τ moves the root from x to y.\n\nResult B — Saturation of nowhere‑dense sets is meagre (proved)\nProposition B2. Let N⊂G_{•,D} be nowhere dense. Then the E∞‑saturation Sat(N):={ (G,σ): ∃ρ with (G,ρ)∈N } is meagre.\nProof. Write Sat_1(N) for those re‑rootings at distance 1 and Sat_k(N) for distance ≤k; Sat(N)=⋃_{k} Sat_k(N). On Good_∞ we have Sat_1(N)∩Good_∞ ⊂ ⋃_{τ} τ(N∩Dom(τ)), a countable union of images of N under homeomorphisms; each τ(N∩Dom(τ)) is nowhere dense, hence their union is meagre. The exceptional set Good_∞^c is meagre by Lemma B1, whence Sat_1(N) is meagre. For k>1, note that any re‑rooting along a length‑k path is a composition of k such τ’s; finite compositions of homeomorphisms are homeomorphisms defined on open domains, and there are countably many of them. Thus Sat_k(N) is meagre for each k, and Sat(N)=⋃_{k} Sat_k(N) is meagre. ∎\nCorollary B3. If M⊂G_{•,D} is meagre, then Sat(M) is meagre (as a countable union of Sat(N_n) for a nowhere‑dense cover M=⋃_n N_n).\n\nConsequences for the Conjecture (meagre part)\n- The above does not yet settle the meagre part of the conjecture in full generality, but it provides a powerful reduction: if one can find a nowhere‑dense transversal N⊂S_P (i.e., N meets every E∞‑class contained in S_P), then S_P=Sat(N) is meagre by Proposition B2. This is exactly how the “2‑way infinite bridge” case gets proved: choose N as the union over k of cylinders where the bridge meets the root ball in a prescribed way (each cylinder is nowhere dense), then Sat(N)=S_P.\n- For all properties P in the notes whose meagreness was established via a countable union over radii of nowhere‑dense root‑local witnesses, this reduction applies and the meagre status is manifestly root‑invariant.\n\nExamples\n- Vertex‑transitive graphs. For D≥3, the set of vertex‑transitive graphs is nowhere dense: given any r‑ball F, refine to F′ by attaching an asymmetric signature to exactly one boundary vertex; every extension of F′ breaks vertex‑transitivity globally. Root‑invariance then follows from Proposition A1.\n- D=2 sanity check. The space G_{•,≤2} consists of rootings of the two‑way infinite path and the one‑way infinite path; the re‑root moves are explicit homeomorphisms. Proposition B2 holds here directly (finite compositions of the two local re‑root maps generate all re‑rootings), aligning with the general proof.\n\nObstacles\n- A direct “root‑free” characterization for meagreness analogous to Proposition A1 seems difficult; the Banach–Mazur game strategy that witnesses meagreness need not produce, at each step, a cylinder whose every unrooted extension avoids P. Proposition B2 circumvents this by showing saturation does not blow up nowhere‑dense sets.\n- Closure of saturated sets need not be saturated; hence proving nowhere‑density/meagreness by analyzing closures must be done with care. The cylinder‑based arguments above avoid this pitfall.\n\nNext steps\n1) Extract a general criterion: S_P meagre iff S_P=Sat(N) for some nowhere‑dense transversal N⊂S_P. Our Proposition B2 provides the “if” direction; the converse (constructing such N from a given meagre cover) is an actionable target via a diagonal choice inside a nowhere‑dense cover while keeping N nowhere dense.\n2) Strengthen Lemma B1 for the Δ=D space with even D: record an explicit degree‑preserving gadget library and a uniform bound on the radius needed to break all local symmetries up to distance m.\n3) Banach–Mazur game reformulation: attempt to convert an arbitrary II winning strategy against S_P (meagre) into one that, at each move, plays a cylinder forbidding P globally (which would settle the meagre part fully). The key technical move is to add “marker gadgets” at many boundary vertices to propagate local obstructions globally in all future extensions.\n4) Catalogue properties P where a nowhere‑dense transversal exists (beyond 2‑way infinite bridges), e.g., properties defined by existence of an infinite 1‑ended ray, ends of prescribed type, or presence of certain infinite cut structures.\n\nSummary\n- We proved the conjecture for nowhere density (Proposition A1).  \n- We proved a structural lemma (Proposition B2): the re‑root saturation of a nowhere‑dense set is meagre; in particular, saturation preserves meagreness. This yields a robust pathway to establishing meagreness of S_P by constructing a nowhere‑dense transversal.  \n- We outlined a comeagre “local rigidity” domain supporting countably many partial re‑root homeomorphisms, which both justifies Proposition B2 and provides a reusable tool for further typicality arguments."
}