{
  "content": "Ideas\n- Firm up the meagre half for concrete bridge properties and supply missing degree/extension bookkeeping for Δ= D.  \n- Prove a general D-regular completion lemma preserving a prescribed finite rooted ball.  \n- Give full, radius-accurate proofs that (i) Br_≤k (a bridge within distance ≤k) is nowhere dense, and hence “has a 2‑way infinite bridge” is meagre (not ND) for D≥3; (ii) “bridgeless” is nowhere dense in Δ≤D for all D>2 and in Δ= D for odd D>2 via a robust single‑gateway gadget.  \n- Record a concrete counterexample to quotient‑openness and correct earlier ambiguity claims.\n\nLemma A (D‑regular completion preserving a ball)\nStatement. Fix D≥3. Let F be a finite rooted graph of radius R with max degree ≤D (no restriction inside: vertices at distance <R may have degree <D in F). Then there exists a countably infinite connected D‑regular graph G and a root ρ such that B_R(G,ρ)≅F.\nProof. For each x∈V(F) let def(x)=D−deg_F(x)≥0. Let S=∑_x def(x) (possibly 0). Prepare a countable family of pairwise disjoint infinite D‑regular trees T_i and, in each T_i, delete a vertex z_i, creating D “port” vertices of degree D−1 spread across D components. Collect all these ports over i. For each unit of deficit, attach a fresh port to the corresponding vertex x∈F by a single new edge (from x to that port). This increases the port’s degree to D and x’s degree by 1. Since the port pool is infinite, we can realize all deficits. The resulting graph is connected (contains F and all attached trees) and D‑regular. New edges all leave V(F), so the induced ball on distance ≤R equals F. ∎\n\nProposition B (k‑local bridges are nowhere dense; D≥3)\nFix D≥3 and k∈ℕ. Let Br_≤k⊂G_{•,D} be those (G,ρ) that have a bridge within graph distance ≤k from ρ. Then Br_≤k is nowhere dense in both G_{•,≤D} and G_{•,=D}.\nProof. Let G_{•}^{F_0} be a nonempty cylinder of radius r. Choose R≫r+k. Extend F_0 to an R‑layered ball F_1 as follows: for every vertex y with r≤dist(y)≤R−1, add enough fresh neighbors at distance +1 so that all edges go only between consecutive layers and every vertex in L_R has degree 1 in F_1. Let E_k be the finite set of edges in F_1 incident only to vertices of distance ≤k.\nFor each e∈E_k, delete e inside F_1; the two components meet L_R because layers expand forward. Pick b_e^+ and b_e^−, one boundary vertex from each side. Let B=⋃_{e∈E_k}{b_e^+,b_e^−}. Add beyond L_R a finite merger network S (a tree of max degree 3) whose leaves are in bijection with B, and join each leaf to its b_e^{±} by a single edge. Let F′ be the resulting finite ball (radius R′>R), with max degree ≤D (we used only degree 1 at L_R and deg ≤3 inside S; choose R so these local increases keep ≤D). Nonemptiness: in Δ≤D, further attach trees to any remaining boundary stubs; in Δ= D, apply Lemma A to complete to a D‑regular infinite extension while preserving B_{R′}=F′.\nClaim: every extension H of F′ has no bridge within distance ≤k. Indeed, for any e∈E_k, the vertices b_e^+,b_e^− lie in distinct components of H−e, and S supplies a path between them that avoids e; hence e lies on a cycle. As every edge within distance ≤k equals some e∈E_k, Br_≤k∩G_{•}^{F′}=∅. By the cylinder criterion, Br_≤k is nowhere dense. ∎\n\nCorollary C (2‑way infinite bridges are meagre and root‑invariant; D≥3)\nLet S_{2w} be the set of (G,ρ) whose underlying G has a 2‑way infinite bridge. Then for D≥3,\n- S_{2w}=⋃_{k≥0}Br_≤k is meagre (countable union of nowhere dense sets).  \n- S_{2w} is not nowhere dense (it is dense: from any cylinder refine far out and attach a new infinite component by a single edge to a distant vertex; the new edge is a 2‑way infinite bridge), and its meagreness is root‑invariant since S_{2w} is saturated.\n\nProposition D (bridgeless is nowhere dense in Δ≤D for D>2 and in Δ= D for odd D>2)\nStatement. Let Br^c be the set of bridgeless graphs. Then Br^c is nowhere dense in G_{•,≤D} for all D>2 and in G_{•,=D} for odd D>2.\nProof. Let G_{•}^{F_0} be a nonempty cylinder of radius r. Choose R≫r and build a finite core K within the R‑ball as follows. Pick two disjoint connected subgraphs A and C joined by a single edge e=ac. Inside K, saturate the degrees of all vertices of C to D (for Δ≤D, to D within K; for Δ= D, also to D within K) and all vertices of A to D except one designated gateway a_0∈A, which we leave with degree <D in K. Ensure K contains F_0 at the center (enlarge R if needed) and that all added edges lie strictly outside B_r of the original root. Let F′ be the rooted R′‑ball containing K as an induced subgraph.\nNow consider any extension H of F′ respecting Δ≤D (resp. Δ= D). Because every vertex of C has degree D already inside K, no further edges can be added to C in any extension (would violate the degree bound). All connections from K to the exterior must use a_0. Hence in any extension H, the only path from C to the exterior goes through e and then through A via a_0. Therefore e is a bridge in H. For Δ= D with odd D, this produces a 1‑way infinite bridge (C side finite), which is allowed (parity forbids 1‑way bridges only for even D). Thus every extension of F′ is not bridgeless; hence G_{•}^{F′}⊂G_{•}^{F_0}∖Br^c and Br^c is nowhere dense in the stated regimes. ∎\nRemark. For Δ= D with even D, 1‑way infinite bridges are impossible (parity), so the above gadget cannot work; this is addressed by Theorem 15 (cut vertex) rather than forcing bridges.\n\nProposition E (forcing a cut vertex is robust; D>2)\nStatement. For all D>2, the set NoCut of graphs without a cut vertex is nowhere dense in G_{•,≤D} and G_{•,=D}.\nProof. Given a cylinder G_{•}^{F_0} of radius r, pick R≫r and form a finite core K by adding, outside B_r, a vertex s (“gateway”), and saturate the degrees to D in K of all vertices in B_R except s (i.e., give each such vertex enough neighbors inside K so its degree within K is already D). Leave s with degree <D in K and ensure K contains a path from the root to s. Let F′ be the R′‑ball containing K. In any extension H, no vertex v≠s in B_R can receive new edges; hence every connection from K to the exterior must go through s. Removing s disconnects H (the exterior separates from the interior), so s is a cut vertex in every extension of F′. Therefore NoCut is nowhere dense. ∎\n\nExamples and counterexamples\n- Ambiguity not small in general. For the D‑regular tree T_D (D≥3), every neighbor of the root is globally rooted‑isomorphic to every other; thus for every r, the cylinder of B_r(T_D) is contained in Amb_1, so Amb_1 has nonempty interior. Hence earlier hopes to show Amb_k nowhere dense fail.  \n- Quotient non‑openness. Let C be the cylinder “root has degree 1.” Its saturation π^{-1}(π(C)) equals “graph has a leaf somewhere,” which is an F_sigma but not open in the rooted local topology. Thus the forget‑the‑root quotient is not open on cylinders, and quotient‑based openness/category arguments are invalid.\n\nObstacles\n- General meagre root‑invariance beyond properties with a k‑local obstruction remains open. The merger‑network method yields meagreness (and root‑invariance) when S_P=⋃_{k}S_{P,≤k} and each S_{P,≤k} is nowhere dense by a radius‑respecting refinement. Identifying a broad class of P with this “local avoidability” is the next target.  \n- Even D, bridges. For Δ= D even, robust bridge forcing cannot produce 1‑way bridges; 2‑way bridge forcing that survives all completions appears delicate since exterior wiring could reconnect the two sides. We rely on cut‑vertex forcing instead.\n\nNext steps\n- Formalize a “local avoidability lemma”: If for each k and cylinder F_0 there is a refinement F′ such that every extension avoids P within distance ≤k of the root, then S_P is meagre as ⋃_k nowhere dense sets (root‑invariant). Catalogue properties P meeting this criterion (k‑edge‑connectivity around the root, forbidden local separators, etc.).  \n- Streamline degree bookkeeping for Δ= D in Propositions B, D, E (write explicit bounds on layer sizes ensuring Δ≤D in the finite cores, then invoke Lemma A).  \n- D=2 special cases: classify smallness of bridge/cut properties on the ray/double‑ray space; determine which parts of the conjecture extend to D=2.  \n- Clean up Theorem 4 in the notes: ensure assumptions exclude leaves (no 1‑way infinite bridges) and note that weak nowhere‑zero flows exist on leafless trees (e.g., T_D) by a recursive assignment in Z_6.\n\nMetric note\n- Use the precise equivalence: d_•((G,ρ),(H,σ))<2^{-r} iff B_r(G,ρ)≅B_r(H,σ). Be careful with radius off‑by‑one when refining cylinders; all constructions above add edges only beyond the current outer sphere to preserve the given r‑ball.  \n\nSummary\n- We provided full, degree‑accurate constructions showing: (i) Br_≤k is nowhere dense (D≥3), hence “has a 2‑way infinite bridge” is meagre and dense (root‑invariant); (ii) “bridgeless” is nowhere dense in Δ≤D (all D>2) and in Δ= D for odd D>2; (iii) “no cut vertex” is nowhere dense for all D>2.  \n- A D‑regular completion lemma preserving any finite ball was proved, which underpins all Δ= D refinements.  \n- We corrected the quotient‑openness misconception and documented that ambiguity sets can have interior, guiding future strategies for general meagre root‑invariance."
}