{
  "content": "Overview\nWe strengthen and clean several structural lemmas and algorithmic subroutines, provide full proofs (balanced separator, bag-permutation, degeneracy), and formalize a complete 2-SAT reduction for the bipartite-sides pivot extension (under a fixed 2-coloring of N(x)). We also correct the earlier “oct ≤ 1” claim by giving a sufficient condition and a concrete counterexample to necessity.\n\n1) Structural lemmas and proofs\nLemma 1 (Bags are permutation graphs). Let the circle be cut into open intervals I(v)=(s(v),t(v)) with endpoints all distinct and adjacency = overlap without containment. Fix an elementary segment σ between consecutive endpoints. Let B(σ) be the set of intervals covering σ. Then G[B(σ)] is a permutation graph.\nProof. Every y ∈ B(σ) has s(y) < σ < t(y). Place the points to the left of σ (in increasing order) on a top line and the points to the right of σ (in increasing order) on a bottom line. Map y to a segment joining s(y) on the top line to t(y) on the bottom line. For y,z ∈ B(σ), they intersect in the overlap graph iff their endpoints alternate s(y)<s(z)<t(y)<t(z) or s(z)<s(y)<t(z)<t(y), which is equivalent to inversion between the two orders and hence segment crossing. Thus G[B(σ)] is a permutation graph.\n\nLemma 2 (Balanced separator via sweep). Let the endpoints be sorted and σ range over elementary segments. Define a(σ):=|{v : t(v) ≤ σ}| and c(σ):=|{v : s(v) ≥ σ}|. Then there exists σ with a(σ) ∈ [n/3, 2n/3] and |B(σ)| ≥ 1; for such σ we have max(a(σ), c(σ)) ≤ 2n/3. Hence removing B(σ) separates the graph into two induced subgraphs of size ≤ 2n/3.\nProof. As σ sweeps from before the first start to after the last end, a(σ) increases from 0 to n by unit steps. By the discrete intermediate value property, there is σ with a(σ) ∈ [n/3, 2n/3]. Between the first start and the last end, every elementary segment is covered by at least one interval, hence |B(σ)| ≥ 1. Then c(σ) = n − a(σ) − |B(σ)| ≤ n − n/3 − 1 ≤ 2n/3, and similarly a(σ) ≤ 2n/3 by choice. Removing B(σ) disconnects vertices ending before σ from those starting after σ; this is the standard separation property of path decompositions.\n\nLemma 3 (Degeneracy ≤ 2w−2). If the ply is w (i.e., max_σ |B(σ)| = w), then the overlap graph is (2w−2)-degenerate.\nProof. Order vertices by increasing right endpoint t. Consider a vertex b at its start s(b). Among earlier-start vertices, at most w−1 intervals are active at any point in the open segment just to the right of s(b); all earlier-start neighbors of b must be active at some point in (s(b), t(b)), so there are ≤ w−1 of them. Symmetrically, consider just to the left of t(b): among later-start vertices, at most w−1 are active there, and any later-start neighbor must be active in (s(b), t(b)) and end after t(b), hence counted among these. Thus deg(b) ≤ (w−1)+(w−1)=2w−2 in every induced subgraph obtained by repeatedly removing the minimum-t vertex. Hence degeneracy ≤ 2w−2.\n\n2) DP extensions (lists and counting) parameterized by ply w\nTheorem 4 (List-coloring and counting). Given a chord representation of ply w and lists L(v) ⊆ [k], one can decide list-k-colorability and count the number of list-respecting k-colorings in time O(n·w·k^w) and space O(k^w).\nProof. Use the sweep DP that maintains the colors of the active set ordered by increasing right endpoint. At a start s(b), determine the insertion position j by t-order; the set of earlier-start neighbors is the prefix 1..(j−1). Extensions are allowed colors in L(b) \\\n {colors used in the prefix}. Counting aggregates over choices for b; list-feasibility prunes choices. End events pop the leftmost active. Complexity and correctness follow identically to the non-list case; counts of identical states are accumulated.\n\n3) Pivot x: computing side-interface S(y) fast\nLemma 5 (Prefix computation of S(·)). Fix a pivot chord x with arcs A_L, A_R and a fixed 2-coloring of each component of G[N(x)] into {a,b}. For y ∈ L, S(y) ⊆ {a,b} is the set of colors that appear among neighbors of y in N(x) (equivalently, colors of u_z on A_L with u_z ∈ the interval of y). Then S(y) for all y ∈ L can be computed in O(|L|+|N(x)|) time by binary-marked prefix sums along A_L; similarly for R.\nProof. Enumerate endpoints u_z of z∈N(x) on A_L in circular order and set two binary arrays marking presence of color a or b at each position. Build prefix sums P_a, P_b. For y with endpoints (ℓ(y), r(y)) on A_L, we have a ∈ S(y) iff P_a(r(y)) − P_a(ℓ(y)) > 0, similarly for b. Total time is linear in arc size.\n\n4) Bipartite-sides extension via 2-SAT (complete and exact under fixed N(x)-2-coloring)\nSetup. Fix pivot x and its color c_x, and fix a 2-coloring of each component of G[N(x)] with colors a,b. Let H be a connected side-subgraph (either L or R) that is bipartite with a fixed bipartition (P,Q). For y ∈ V(H), S(y) ⊆ {a,b} is computed as in Lemma 5.\nVariables. Introduce one boolean o_H (orientation) with semantics: o_H=0 means assign color a to P and b to Q; o_H=1 means assign b to P and a to Q. For each y ∈ V(H), introduce z_y with semantics: z_y=1 iff y is assigned color c_x.\nClauses.\n- Independence of c_x: For every edge uv ∈ E(H), add (¬z_u ∨ ¬z_v).\n- For y ∈ P: if a ∈ S(y), add (o_H ∨ z_y); if b ∈ S(y), add (¬o_H ∨ z_y).\n- For y ∈ Q: if b ∈ S(y), add (o_H ∨ z_y); if a ∈ S(y), add (¬o_H ∨ z_y).\nLet F(H) be the conjunction of these 2-clauses.\n\nTheorem 6 (Exact 2-SAT reduction for bipartite side). With the above construction and fixed N(x)-2-coloring and c_x, H admits an extension to a proper 3-coloring iff F(H) is satisfiable.\nProof. (⇒) Suppose a proper extension exists. Define o_H according to the a/b colors used on the 2-coloring of H’s bipartition in the extension; set z_y=1 iff y is colored c_x. If y ∈ P and o_H=0, then y is assigned a if z_y=0; since the extension is proper, a ∉ S(y) whenever z_y=0, so the clause (o_H ∨ z_y) is satisfied (either o_H=1 or z_y=1) when a ∈ S(y); symmetrically for other cases. Any edge uv with z_u=z_v=1 is impossible in a proper coloring, hence (¬z_u ∨ ¬z_v) holds. Thus the assignment satisfies F(H).\n(⇐) Conversely, suppose F(H) is satisfiable. Use the satisfying assignment to color: vertices with z_y=1 get c_x; vertices with z_y=0 get a/b according to o_H and their side in (P,Q). Edges with both endpoints z=0 are properly 2-colored by construction. Edges with one endpoint z=1 are properly colored with distinct colors. Edges with both z=1 do not occur by the independence clauses. For any y with z_y=0, the gating clause guarantees that its assigned a/b color is not forbidden by S(y), so edges to N(x) are proper. Hence we obtain a valid extension on H.\nComplexity. For a fixed N(x)-coloring and c_x, F(H) has O(|E(H)|+|V(H)|) 2-clauses and is solvable in linear time. Different side components are independent; solve F(H) per component and combine.\nRemark. This formulation strictly generalizes the earlier “violators must be independent” criterion: it allows z_y=1 even when y is not a violator, provided independence holds.\n\nCorollary 7 (Full pivot algorithm under bipartite sides). For a fixed pivot x, try c_x ∈ {1,2,3} and for each connected component of G[N(x)] try both 2-colorings. For each side component H, build F(H) and test satisfiability. If all sides succeed, accept. Overall time O(3 · 2^{cc(N(x))} · poly(n)) for fixed x; try all x to be complete under the “some pivot with bipartite sides” hypothesis.\n\n5) Correction on the oct ≤ 1 extension claim\nWe correct the earlier bidirectional claim; below is a sufficient condition with proof, and a counterexample to necessity.\n\nProposition 8 (Sufficient condition with single deletion). Let H be a side component and fix N(x)-2-coloring and c_x. If there exists v ∈ V(H) and an orientation o of H′:=H−{v} such that the set B_o(H′) of vertices y ∈ V(H′) whose assigned a/b color under o lies in S(y) is independent in H′ and N_H(v) ∩ B_o(H′) = ∅, then H admits an extension: color v and B_o(H′) with c_x and V(H′)\\B_o(H′) by o.\nProof. Identical to the “if” direction of prior statements; edges within B_o(H′) are absent (independence), edges incident to v avoid B_o(H′) by assumption, and all remaining edges are properly colored.\n\nCounterexample to necessity. Take H=C_5 with vertices v1–v2–v3–v4–v5–v1. Fix N(x)-2-coloring so that S(v1)=S(v3)=S(v5)={a,b} (forced c_x), S(v2)={a}, and S(v4)={b}. Then H is extendable (assign c_x to v1,v3,v5; color v2 with b and v4 with a). However, for any choice of v, either H−{v} yields B_o(H′) containing a neighbor of v (e.g., v1’s neighbor v5 forced into B) or yields B_o(H′) non-independent (e.g., deleting v2 leaves v1 and v5 both in B_o(H′) with an edge between them). Thus no v satisfies the sufficient condition, showing the condition is not necessary.\n\n6) Examples and sanity checks\n- Bag-permutation: Build four intervals covering a segment σ with orders s: a<b<c<d and t: d<c<b<a; all pairs in B(σ) are adjacent; K4 is a permutation graph.\n- Degeneracy: A construction with w=3 can realize a vertex of degree 4=2w−2 (tight up to constants) by placing two earlier- and two later-start neighbors active across (s(b),t(b)).\n- Side 2-SAT: For H a path u–v–w with bipartition P={u,w}, Q={v} and S(u)={a}, S(v)=∅, S(w)={b}, the formula consists of (o_H ∨ z_u), (¬o_H ∨ z_w), and (¬z_u ∨ ¬z_v), (¬z_v ∨ ¬z_w), (¬z_u ∨ ¬z_w). It is satisfiable (e.g., o_H=0, z_u=1, z_v=z_w=0) and yields a valid extension.\n\n7) Obstacles\n- Eliminating the 2^{cc(N(x))} factor by a single 2-SAT over all N(x)-component 2-colorings fails in general: whether a side vertex’s color a (or b) “appears” is an OR over literals tied to multiple N(x)-components, inducing clauses of width ≥ 3 when guarding edge constraints across side edges.\n- The oct ≤ 1 sufficient test is not necessary; general completeness for oct ≤ t by branching on |X| ≤ t independent odd-cycle transversals is nontrivial due to the interaction with S(·) and may require larger c_x-sets than a minimum OCT.\n\n8) Next steps\n- Move proofs of Lemmas 1–3 and Theorem 4 into proofs.md; add Corollary 7 with the exact 2-SAT mapping.\n- Implement: (i) list/counting DP; (ii) pivot algorithm with side 2-SAT; (iii) prefix-sums computation of S(·).\n- Empirics: measure w, cc(N(x)), and frequency of pivots with bipartite sides on random and structured circle graphs.\n- Two-pivot separators: develop a four-region decomposition around chords x,y; the middle layer N(x)∩N(y) is permutation (hereditary), suggesting a bounded-interface CSP composition generalizing Theorem 6.\n- Parameterized exploration: attempt an FPT algorithm parameterized by (t + cc(N(x))) that branches on at most t independent deletions per side and then applies the 2-SAT extension (sufficient method), with attention to counterexamples and completeness gaps.\n\nSummary\n- Rigorous proofs: bag-permutation lemma; balanced separator with corrected bound; degeneracy ≤ 2w−2; list/counting DP in O(n·w·k^w).\n- Algorithmic: exact 2-SAT formulation for bipartite side extension under a fixed N(x)-2-coloring (stronger and cleaner than the “independent violators” criterion) and linear-time computation of S(y).\n- Correction: the proposed oct ≤ 1 characterization is only sufficient, not necessary; provided a concrete counterexample illustrating the failure of necessity."
}