{
  "content": "Ideas\n\n- Conj. 1 (root-invariance): Meagreness/nowhere-denseness of saturated sets (properties of unrooted graphs) should be invariant under any global, continuous “re-rooting” homeomorphism. I isolate a class of such homeomorphisms (local re-rootings along a fixed port-numbering) and prove preservation of smallness under them. This yields a partial root-invariance statement.\n- Conj. 2 (metric sensitivity): I give a broad negative result. For a large class of “natural” alternative metrics whose open neighborhoods are determined by finitely many finite rooted neighborhoods (finite-lens metrics), the status of “bridgeless” cannot flip to typical; in fact, bridgeless remains nowhere dense in these metrics (for degree ≤ D and for D-regular with D odd). This captures many plausible multi-root local metrics and shows that to change typicality one must leave this local regime.\n\nDefinitions (finite-lens metrics)\n\n- Let X = 𝔾_{\\bullet,D} (either ≤ D or = D). A metric d on X has the finite-lens property (FLP) if for every x ∈ X and ε>0 there exist:\n  - a finite set of vertices U_x,ε ⊆ V(G_x) containing the root, and an integer r_x,ε ≥ 0;\n  - a rooted finite marked graph M_x,ε obtained as the induced subgraph of G_x on the union of the radius-r_x,ε balls around all vertices in U_x,ε, with all vertices of this finite union marked;\n  such that the d-open ball B_d(x,ε) contains the “multi-ball cylinder”\n  W(M_x,ε) = { y ∈ X : there exists an injective marking of |U_x,ε| vertices in y whose radius-r_x,ε balls are jointly isomorphic to M_x,ε as marked rooted graphs }.\n  Intuitively: every small d-neighborhood is controlled by finitely many local views around finitely many marked vertices.\n- Examples of FLP metrics: \n  (i) Standard Benjamini–Schramm metric (U has one vertex, the root). \n  (ii) k-lens variants: two rooted graphs are close if the radius-r neighborhoods around all vertices within graph distance ≤ k of the root agree as a marked union. \n  (iii) Any metric whose basic opens are finite intersections of Benjamini–Schramm cylinders around finitely many specified vertices (with specified radii).\n\nResults and proofs\n\nTheorem A (Finer topologies cannot flip nowhere-dense to typical).\nLet τ_2 be a topology finer than τ_1 on X. If S ⊆ X is nowhere dense in (X,τ_1), then S is nowhere dense in (X,τ_2). Consequently, if bridgeless is nowhere dense in the Benjamini–Schramm topology, it cannot be typical (comeagre) in any finer metric topology.\nProof. Closure and interior are monotone w.r.t. refinement: cl_{τ_2}(S) ⊆ cl_{τ_1}(S) and int_{τ_2}(·) ⊆ int_{τ_1}(·). Hence int_{τ_2}(cl_{τ_2}(S)) ⊆ int_{τ_1}(cl_{τ_1}(S)) = ∅. Meagreness follows by countable unions.\n\nTheorem B (Bridgeless remains nowhere dense for finite-lens metrics; degree ≤ D and D-regular with D odd).\nFix D ≥ 3.\n- (≤ D) In any FLP metric d on 𝔾_{\\bullet,≤D}, the set BrFree of bridgeless graphs is nowhere dense.\n- (= D odd) In any FLP metric d on 𝔾_{\\bullet,=D} with D odd, BrFree is nowhere dense.\nProof. Let O be a nonempty d-open set. By FLP, O contains W = W(M), where M is the finite union of radius-r balls around a finite marked set U. Let K be the finite induced subgraph of the ambient pattern M. We build a refinement W′ ⊆ W such that every y ∈ W′ has a (forced) bridge.\nCase (≤ D): Choose a vertex b on the boundary of K (exists for large enough r because our ambient graphs are infinite). Form M′ by attaching a new vertex z at distance r+1 from all marks, joining z only to b. Since M′ specifies the adjacency of z (degree 1) and preserves all radius-r neighborhoods around the marks, the corresponding cylinder W′ = W(M′) is nonempty and W′ ⊆ W. In any y ∈ W′, the edge bz is a bridge: the leaf z has degree 1 pinned inside the cylinder, so no cycle can contain bz. Hence O contains a nonempty open set disjoint from BrFree. As O was arbitrary, BrFree is nowhere dense.\nCase (= D odd): We cannot add a leaf. Instead, we embed a finite D-regular “bridge gadget” entirely inside the pinned region far from all marks. Concretely: take two disjoint finite D-regular graphs H_1,H_2 and choose vertices a∈V(H_1), b∈V(H_2) such that the edge sets incident to a and b are entirely inside H_1 and H_2, respectively. Let R be the disjoint union H_1 ⊔ H_2 together with a new edge e* = ab. Then R is D-regular and e* is the unique edge connecting the two components of H_1 ⊔ H_2, hence e* is a bridge in R. Now enlarge M to M′ by grafting a copy of R at distance ≥ r+2 from all marks (this is possible because W imposes no constraints outside the marked neighborhood), and pin all adjacencies of vertices of R within radius 1 so their degrees are completely determined inside the cylinder. Define W′ = W(M′). Then for any y ∈ W′, the vertices of R cannot acquire new edges to the outside (their degrees are already D and fully specified in the pinned finite neighborhood), so e* remains a bridge in y. Thus W′ ⊆ W and W′ ∩ BrFree = ∅, proving BrFree is nowhere dense.\nRemarks:\n- The same argument adapts the parity-gadget bookkeeping from the extended abstract whenever boundary-degree parity must be controlled before grafting; here we avoid it by fully pinning the gadget’s degree-1 neighborhoods.\n- The proof uses only the FLP and does not rely on the particular choice of marks beyond finiteness; so it covers a broad family of local multi-root metrics.\n\nCorollary B.1. Under any FLP metric on 𝔾_{\\bullet,≤D} (resp. 𝔾_{\\bullet,=D} for D odd), bridgeless graphs are not typical (indeed, nowhere dense). Hence any metric that makes bridgeless typical must fall outside the finite-lens regime (and in particular cannot be finer than Benjamini–Schramm by Theorem A).\n\nProposition C (Existence of many root-change homeomorphisms; partial Conj. 1).\nFix D and equip X with a Borel “port numbering” scheme: to each rooted graph (G,ρ) assign, Borel in (G,ρ), an ordering of the incident edges at every vertex that is locally determined by finite neighborhoods (standard Lusin–Novikov uniformization on the set of incidences yields such a Borel assignment; continuity can be ensured on a comeagre set by refining the scheme, but Borelness suffices for the following category statement). For each label i ∈ {1,…,D}, define the partial map T_i that moves the root along the edge of port i when it exists. Then on their domains and ranges the T_i are homeomorphisms (with inverses defined via the corresponding back-port at the new root). Any property S of unrooted graphs is saturated under re-rooting, hence T_i(S)=S. Therefore, smallness (meagre/nowhere dense) of S is invariant under any finite composition of T_i. In particular, changing the root by any fixed finite port-word (whenever defined) preserves meagreness and nowhere density.\nSketch of proof. The map T_i depends only on the (i+1)-ball and thus is continuous where defined; it is an involution on the subspace where port i exists (the inverse is “return along the unique back-port”), hence a homeomorphism of that subspace. Saturation of S under re-rooting implies T_i(S)=S; Baire-category properties are preserved by homeomorphisms.\nWhy useful here: This gives a rigorous fragment of Conj. 1—smallness is invariant under a large family of canonical root changes. Extending from fixed finite port-words to arbitrary per-graph re-root choices remains open (see Obstacles).\n\nExamples of FLP metrics\n\n- k-lens metric: For k ∈ ℕ, define d_k((G,ρ),(H,σ)) = 2^{-R}, where R is the largest r such that the marked unions of radius-r balls around all vertices within distance ≤ k of ρ and σ are isomorphic (root ↦ root, preserving the marked sets and their incidences). The basic opens are exactly multi-ball cylinders W(M) as in FLP. By Theorem B, BrFree is nowhere dense in (X,d_k) for all k.\n- Finite-intersection cylinders: Let basic opens be finite intersections of standard Benjamini–Schramm cylinders around finitely many marked vertices; metrize by declaring two points close if they agree on those finitely many views up to large r. Again, FLP holds, so BrFree is nowhere dense.\n\nAdditional small lemmas (easy checks, useful benchmarks)\n\n- Lemma D (typicality monotonicity vs. topology). If τ′ is coarser than τ and S is comeagre in τ, then S is comeagre in τ′. In particular, no coarser topology can make a comeagre set non-comeagre. Combined with Theorem A, to flip “bridgeless” (now nowhere dense) to typical, one must pick a strictly coarser topology than Benjamini–Schramm that violates FLP.\n- Lemma E (density of existential finite-pattern properties). For any finite connected F with Δ(F) ≤ D, the set { (G,ρ): G contains F as a subgraph } is dense in Benjamini–Schramm (and hence in any FLP metric). Proof: inside any cylinder, graft a far-away copy of F without touching the pinned neighborhood; connectivity can be restored by a path that avoids pinned vertices and respects degree bounds by local rewiring (≤ D case) or by incorporating F inside a D-regular gadget (=D case). This supports the robustness of the FLP machinery.\n\nObstacles (why Conj. 1 is delicate in full generality)\n\n- A global “re-rooting” that picks, for each unrooted graph, an arbitrary vertex (a transversal of the re-rooting equivalence) need not be Borel, let alone continuous; countable Borel equivalence relations rarely admit Borel transversals. Without continuity, meagreness need not be preserved. Thus full root-invariance likely needs either (i) restriction to continuous local re-rootings (as in Proposition C) or (ii) an argument that avoids selecting a transversal altogether.\n- The “unrooted local” pseudometric d_free((G,ρ),(H,σ)) = inf_{u∈V(G),v∈V(H)} d_•((G,u),(H,v)) collapses all rootings of the same graph (distance 0), so it is not a metric on X. Any honest metric that mixes this with d_• with positive weight is topologically equivalent to Benjamini–Schramm, so cannot change typicality by Theorem A. Constructing a coarser, natural metric on X that is not FLP and keeps distinct rootings separated remains nontrivial.\n\nNext steps\n\n- Conj. 2 (negative direction): Try to extend Theorem B from FLP to any metric whose basic open sets depend on finitely many first-order conditions with bounded quantifier depth (a logic-topology variant). The core of the proof only needs that an open set leaves infinitely much room “far from the finitely many constraints” to insert a pinned bridge gadget.\n- Conj. 2 (positive direction): Search for a genuinely coarser, natural metric on X that (a) is not FLP; (b) still yields a Baire space; and (c) encodes some “global anywhere” information (e.g., a topology generated by the sets “contains a ball of type F somewhere”). Assess whether BrFree can be comeagre there. Warning: such opens are not local in the root and require different techniques.\n- Conj. 1: Strengthen Proposition C by constructing a comeagre G_δ subset of X on which a canonical port-numbering is continuous, making a large family of re-rootings global homeomorphisms. Then deduce root-invariance of smallness for saturated Borel sets intersected with that comeagre set.\n- Even-D regular case: Adapt Theorem B to show that in any FLP metric on 𝔾_{\\bullet,=D}, D even, the set “no cut vertex” is nowhere dense (cf. Theorem 15), and investigate the category of BrFree itself.\n\nSummary of new, testable contributions\n\n- Theorem A: Finer topologies preserve nowhere-denseness; hence bridgeless cannot become typical under any finer metric.\n- Theorem B: For any finite-lens (multi-root local) metric, bridgeless is nowhere dense on 𝔾_{\\bullet,≤D} and on 𝔾_{\\bullet,=D} for odd D. This covers many natural alternatives to Benjamini–Schramm and gives a substantial negative answer to Conj. 2.\n- Proposition C: Smallness is invariant under a rich family of continuous local re-rootings (partial progress on Conj. 1).\n\nAll arguments are local and constructive: the bridge is forced by pinning a finite gadget inside the open set; the crucial feature is only that opens constrain finitely many finite neighborhoods.\n"
}