{
  "content": "Ideas\n- Work with two natural topologies: the rooted local (Benjamini–Schramm) topology on X=\\mathbf{G}_{\\bullet,D} and the “rootless” local topology on Y obtained by forgetting the root and declaring as basic open sets those unrooted graphs that contain a given finite rooted ball somewhere.\n- Use the forgetful map \\pi:X\\to Y that sends (G,\\rho) to G. Show \\pi is a continuous, open, surjective map. Then transfer smallness (nowhere denseness/meagreness) between X and Y.\n- Conjecture 1 (root-invariance): Prove full equivalence for nowhere-dense sets and, for meagreness, prove equivalence for sets having the Baire property (in particular, Borel/analytic sets). This essentially settles the conjecture for all “natural” properties P.\n- Conjecture 2 (metric sensitivity): Identify a broad class of “local/pattern-compatible” metrics whose open sets contain all radius-r cylinder sets. Under any such metric, bridgeless graphs cannot be typical; this yields a robust obstruction to making bridgeless graphs comeagre. Conclude that to change typicality one must abandon local/pattern-compatible topologies (which strongly suggests “no” for reasonable alternatives).\n\nDefinitions and setup\n- X = \\mathbf{G}_{\\bullet,D} with the usual rooted local topology; a basic clopen set is U_F^X = { (G,\\rho): B_r(G,\\rho) \\cong F } for a finite rooted r-ball F.\n- Y = set of countably infinite connected unrooted graphs with \\Delta\\le D, endowed with the rootless local topology generated by basic open sets U_F^Y = { G: ∃v∈V(G) with B_r(G,v) \\cong F }.\n- Forgetful map \\pi: X→Y, \\pi(G,\\rho)=G.\n\nLemma 1 (\\pi is continuous, open, surjective)\n- Continuity: For basic open U_F^Y in Y, \\pi^{-1}(U_F^Y)=U_F^X is open in X.\n- Openness: For basic open U_F^X in X, \\pi(U_F^X)=U_F^Y is open in Y.\n- Surjectivity is clear.\n\nWhy useful here: Smallness (meagre/nowhere-dense) is purely topological; relating X and Y via an open continuous surjection allows transfer of smallness statements for unrooted properties P.\n\nThe rootless formulation of a property P\n- For a property P of unrooted graphs, let T_P⊆Y be {G: G has P}, and S_P=\\pi^{-1}(T_P)⊆X be { (G,\\rho): G has P }. Then S_P is saturated (a union of fibers of \\pi) and S_P=\\pi^{-1}(T_P).\n\nProposition 2 (nowhere denseness is root-invariant, for all P)\nClaim: For any A⊆Y, A is nowhere dense in Y iff \\pi^{-1}(A) is nowhere dense in X.\nProof: \n- (⇒) Let A be nowhere dense in Y. For any nonempty open U⊆X, \\pi(U) is open in Y. Because A is nowhere dense, there is nonempty open V⊆\\pi(U) with V∩A=∅. Then U' := U∩\\pi^{-1}(V) is nonempty open and U'∩\\pi^{-1}(A)=∅. Hence \\pi^{-1}(A) is nowhere dense.\n- (⇐) Suppose \\pi^{-1}(A) is nowhere dense. For any nonempty open W⊆Y, \\pi^{-1}(W) is open nonempty in X; there is a nonempty open U'⊆\\pi^{-1}(W) with U'∩\\pi^{-1}(A)=∅. Then \\pi(U') is nonempty open and \\pi(U')⊆W, and \\pi(U')∩A=∅ (otherwise some x∈U' would map into A). Hence A is nowhere dense.\n\nCorollary 3 (meagreness is root-invariant for properties with the Baire property)\nLet A⊆Y have the Baire property (in particular, for A Borel/analytic). Then A is meagre in Y iff \\pi^{-1}(A) is meagre in X.\nProof: \n- (⇒) Preimages of meagre sets under continuous maps are meagre.\n- (⇐) Suppose \\pi^{-1}(A) is meagre but A is not meagre. Because A has the Baire property, ∃ nonempty open V⊆Y such that A∩V is comeagre in V. Then \\pi^{-1}(A∩V)=\\pi^{-1}(A)∩\\pi^{-1}(V) is comeagre in \\pi^{-1}(V), a nonempty open subset of X. Hence \\pi^{-1}(A) is not meagre, contradiction.\n\nConsequences for Conjecture 1\n- For any property P of unrooted graphs for which T_P is Borel (or merely has the Baire property) in Y, meagreness and nowhere-denseness of S_P in X are equivalent to those of T_P in Y. In particular, smallness is independent of the root in this strong sense.\n- This covers essentially all “natural” properties encountered in the extended abstract (bridges, cutvertices, edge-chromatic number, flow obstructions), which are definable in terms of finitary patterns or countable Boolean combinations thereof.\n\nExamples/Checks\n- P = “G has a 2-way infinite bridge.” The set T_P is F_\\sigma in Y as a countable union over k of the open sets “there is a 2-way infinite bridge within distance ≤k of some vertex.” Hence S_P meagre in X iff T_P meagre in Y (matching Theorem 16 for X).\n- P = “G is bridgeless.” Its complement is \\bigcup_k \\{bridge within distance ≤k\\}, i.e., a countable union of open sets, so T_P is G_\\delta. Root-invariance of nowhere denseness/meagreness follows as above.\n\nConjecture 2: robust obstruction for “bridgeless is typical” under local/pattern-compatible metrics\nDefinition (pattern-compatible topology on X): A topology \\tau on X is pattern-compatible if, for every r-ball F and every k, the set\nO(F,k) = { (G,\\rho): ∃v at distance ≤k from \\rho with B_r(G,v) \\cong F }\nis open in \\tau.\nExamples: The standard rooted local topology; any metric topologically equivalent to it; the rootless local topology on Y (mutatis mutandis) also enjoys the analogous property.\n\nProposition 4 (No-go for “bridgeless is typical” under pattern-compatible topologies on ≤D spaces)\nAssume D≥2 and \\tau is pattern-compatible on X. Then the set B of graphs that have a bridge is not meagre in (X,\\tau). Consequently, “bridgeless” is not comeagre.\nProof: Let F be the 1-ball consisting of a single edge with the center (root) of degree 1. Then O(F,0) is a nonempty open set (any one-edge graph glued at the root occurs locally) and every (G,\\rho)∈O(F,0) has \\deg(\\rho)=1, so the unique edge incident to \\rho is a 1-way infinite bridge. Hence O(F,0)⊆B, so B has nonempty interior and is not meagre.\nRemark: This applies to \\mathbf{G}_{\\bullet,\\le D}. For even D in \\mathbf{G}_{\\bullet,=D}, 1-way bridges are impossible; however, the same obstruction applies to the unrooted version on Y if we replace O(F,0) by its rootless analogue (the set “∃ a leaf somewhere” is open and nonempty), so the set of graphs having a bridge remains non-meagre there as well.\n\nCorollary 5 (Topological equivalence implies invariance)\nIf a metric d' on X induces the same topology as d_\\bullet, then the collection of typical properties is identical. In particular, no such metric can make “bridgeless” typical.\n\nExamples and small tests\n- Weighted local metrics: d_\\alpha((G,\\rho),(H,\\sigma)) = \\sum_{r\\ge 0} \\alpha_r \\mathbf{1}[B_r(G,\\rho)\\not\\cong B_r(H,\\sigma)] with \\alpha_r>0 and \\alpha_r\\to 0. These are topologically equivalent to d_\\bullet, hence typicality is unchanged.\n- Pointed Gromov–Hausdorff-type local metrics on bounded-degree graphs are also topologically equivalent to d_\\bullet, so typicality is unchanged.\n\nObstacles\n- To make “bridgeless” comeagre, one must use a topology in which the property “the root has degree 1” (or “there exists a leaf somewhere”) is not open. This forces a non-local topology (open sets cannot constrain finite balls), which seems at odds with standard graph local-convergence frameworks.\n- For meagreness equivalence (Conjecture 1) without assuming the Baire property of T_P, the implication S_P meagre ⇒ T_P meagre may fail for arbitrary continuous open maps in full generality. However, for the saturated preimages we consider and for Baire-property sets (covering all natural P), the equivalence holds.\n\nNext steps\n- Formalize Y as a Polish space (e.g., by coding graphs as rooted balls with an anchor erased) and record that T_P is Borel for the properties in the extended abstract; place Proposition 2 and Corollary 3 into proofs.md.\n- Explore whether any “reasonable” alternative metric outside the pattern-compatible class still preserves openness of “root has degree 1.” If so, it cannot make bridgeless typical. Try to axiomatize “reasonable” as: Hausdorff, second countable, and containing all cylinder sets U_F^X as sets with the Baire property (preferably open).\n- For even D in \\mathbf{G}_{\\bullet,=D}, sharpen the no-go by locating a basic open set contained in “has a 2-way infinite bridge” or, failing that, in “has a cut vertex,” to show these complements cannot be typical under pattern-compatible topologies.\n- Investigate whether any coarse, global metric (e.g., based on spectral measures at the root) yields a topology where “leaf at the root” is not open, and assess whether such a topology can be considered natural in this context.\n"
}