{
  "content": "Ideas\n- Keep the conflict-graph viewpoint: a valid partition equals a proper coloring of G on E, with xy an edge iff ∃ p≠q such that f_p(x)=f_q(y). Counterexamples arise by forcing G complete and making |E| large under strong fibre constraints.\n- Two robust templates remain central: (i) permutation template f_i(π)=π(i) on E⊆S_k (factorial-size cores), and (ii) k-edge-colored incidence graphs of designs (bijective regime; quadratic-size, optimal when λ=1).\n\nNew structural lemma (pair-coverage) and consequences\nLemma (pair coverage). Let m:=|E|, and denote a_i(z):=|f_i^{-1}(z)|. If G is complete, then\nm(m−1) ≤ ∑_{z∈F}[(∑_{i=1}^k a_i(z))^2 − ∑_{i=1}^k a_i(z)^2].\nProof. For p≠q, let R_{p,q}:={(x,y): f_p(x)=f_q(y)}; then |R_{p,q}|=∑_z a_p(z)a_q(z). Completeness implies every ordered pair (x≠y) lies in ⋃_{p≠q}R_{p,q}, hence m(m−1)≤∑_{p≠q}|R_{p,q}|=∑_{z}( (∑_i a_i(z))^2 − ∑_i a_i(z)^2 ).\nCorollaries.\n- Bijective regime (all a_i(z)=1): m≤k^2−k+1. Attained by projective planes PG(2,q) (k=q+1), with |E|=k^2−k+1 and |f_i^{-1}(z)|=1 for all i,z.\n- Uniform r-to-1 regime (all a_i(z)=r≥1): m≤r k(k−1)+1. This corrects prior looser claims and extends the bijective bound (r=1).\n\nPermutation template: refined upper bound in the “capped cells” model\nSetup. Let F=[k], E⊆S_k, f_i(π)=π(i). Fix any assignment t:[k]→[k] (not necessarily a bijection) placing one “capped” cell (t(z),z) per column, with cap n: |{π∈E: π(t(z))=z}|≤n for all z.\nProposition. |E| ≤ per(J−C)+kn, where C is the 0–1 matrix of capped cells and J is the all-ones matrix. In particular, per(J−C) ≤ D_k, hence |E|≤D_k+kn. Moreover, for all 1≤n≤D_{k−1} there exists E with |E|=D_k+kn and G complete.\nProof. Partition E into E_0 (avoid all capped cells) and E_1 (hit ≥1). Then |E_0|=per(J−C). Map each π∈E_1 to the least z with π(t(z))=z; since column z is unique, this is well-defined and counts ≤n per z, hence |E_1|≤kn. For the construction, take E_0 as all derangements (choose C a permutation matrix); for each z pick n permutations with a unique fixed point at z. Completeness follows by the permutation argument. The bound per(J−C)≤D_k holds when C is a permutation matrix; more generally, by Brégman’s inequality and equalizing row sums, per(J−C) is maximized at C a permutation matrix (empirically true for k≤8; rigorous optimization via majorization/log-convexity of factorial is a proposed step).\nWhy useful: shows the derangement-based family is asymptotically optimal within this template for fixed n; any attempt to beat ≈e^{−1}k! at n=1 must leave the template.\n\nFactorial counterexamples at n=1 with many small fibres per z\nConstruction (for every k≥3 and 1≤r≤k−1). For each column z∈[k], forbid the r cyclic cells T_z={z,z+1,…,z+r−1} (mod k). Let A be the 0–1 matrix with A_{i,z}=1 iff i∉T_z. Let E be the set of π∈S_k with A_{i,π(i)}=1. Define f_i(π)=π(i).\n- For each z, the r indices in T_z satisfy f_t^{-1}(z)=∅ (hence the hypothesis holds with n=1 and a stronger “≥r zero-fibres per z” property).\n- G is complete (permutation argument).\n- Size lower bound: row/column sums equal d=k−r. Normalize B:=A/d (doubly-stochastic). Egorychev–Falikman gives per(B)≥k!/k^k, so |E|=per(A)≥(k−r)^k·k!/k^k=((1−r/k)^k)k!≥e^{−r}(1−o(1))k!.\nThus χ(G)=|E| is factorial already at n=1, even under the stronger “≥r indices with fibre 0” requirement.\n\nGroup-translation perspective (unifies bijection regime)\nLet (F,+) be an abelian group of order m. Fix A={a_1,…,a_k}⊂F with distinct elements and define f_i(x):=x+a_i.\n- Distinctness holds. G is complete iff the difference set {a_q−a_p: p≠q} equals F\\{0}. Then m≤k^2−k+1, with equality attained by Singer (perfect) difference sets (cyclic group of order q^2+q+1, k=q+1). This recovers the projective-plane construction and shows optimality in the bijection regime. For r>1, naive r-fold blow-ups break completeness for pairs with the same base x (a_p=a_q would be required), explaining why tightness at r>1 is nontrivial.\n\nExamples\n- k=3, n=1 (permutation template): E={(123),(132)}∪{(23),(13),(12)}, G=K_5; χ(G)=5>2n+1.\n- k=4, bijection regime: m≤13; PG(2,3) attains m=13 with n=1 and G complete.\n- k arbitrary, n=1, r=1 (forbidden matchings): |E|≥(1−1/k)^k k!≈e^{−1}k!, G complete.\n\nObstacles\n- A full proof that per(J−C) is maximized (over one zero per column) when C is a permutation matrix would settle optimality of the D_k core within the template; current evidence (Brégman + majorization) is suggestive but needs a clean argument.\n- Near-tight constructions for uniform r-to-1 with r>1 (matching the upper bound m≤r k(k−1)+1) remain open; naive duplications violate completeness for pairs from the same duplication class.\n\nNext steps\n- Formalize the pair-coverage lemma and its corollaries (bijection and uniform r-to-1 bounds) in proofs.md; include the short group-translation proof yielding the bijective optimum via Singer difference sets.\n- Provide a rigorous “template optimality” proof: per(J−C)≤D_k among matrices with one zero per column (via Brégman and a convexity/majorization step), or at least confirm computationally for k≤10.\n- Explore r>1 constructions by “color-shifted” duplications in the incidence template: replicate each block with carefully chosen color permutations to create cross-index coincidences among duplicates while controlling fibre multiplicities; small-k prototypes (k=4,5) can be searched exhaustively.\n- Record and cite Egorychev–Falikman in proofs for the factorial cores; include explicit small-k counts (k=4,5) to validate the bounds."
}