{
  "content": "Ideas\n- Maintain the conflict-graph perspective: a valid partition is a proper coloring; the minimum number of parts equals χ(G). We seek instances with small n (ideally n=1) but χ(G) as large as possible, and test robustness under natural regularity constraints (surjectivity, uniform fibres).\n- Two complementary lines: (i) factorial-size complete graphs with n=1 via permutation avoidance (allowing zero fibres); (ii) bijective/uniform fibres with n=1 via incidence designs, where a quadratic upper bound is tight.\n\nRigorous tools and results (new and consolidated)\nLemma (pair-coverage inequality; complete G). Let a_i(z):=|f_i^{-1}(z)| and m:=|E|. If the conflict graph G is complete, then\nm(m−1) ≤ ∑_{z∈F} [ (∑_{i=1}^k a_i(z))^2 − ∑_{i=1}^k a_i(z)^2 ].\nProof. For fixed z, the number of unordered pairs {x,y} with x∈f_p^{-1}(z), y∈f_q^{-1}(z), p≠q, equals ∑_{p<q} a_p(z)a_q(z) = 1/2[(∑_i a_i(z))^2 − ∑_i a_i(z)^2]. Summing over z, every unordered pair {x,y} is counted at least once (completeness), hence the claim.\n\nProposition (uniform r-to-1 upper bound; corrected). If for all i,z we have |f_i^{-1}(z)|=r≥1 (so each f_i is surjective with constant fibre r) and G is complete, then\n|E| ≤ r k (k−1) + 1.\nProof. Let u:=|F| and m:=|E|. Then m=∑_z a_i(z)=ru for each i, so m=ru. The inequality gives m(m−1) ≤ ∑_z ( (kr)^2 − kr^2 ) = u·kr^2(k−1). Divide by ur: r u − 1 ≤ r k (k−1), i.e. m=ru ≤ r k (k−1) + 1.\n\nGroup/difference-set viewpoint (bijective regime; n=1, completeness). Let F be an abelian group of order v and choose distinct g_1,…,g_k∈F. Put E:=F and define f_i(x)=x+g_i. Then each f_i is a bijection and pointwise distinctness holds. The conflict condition f_p(x)=f_q(y) is y−x=g_p−g_q. Hence G is complete iff {g_p−g_q : p≠q}=F\\{0}, i.e. {g_i} is a (v,k,1) difference set. Singer difference sets exist for v=k^2−k+1 (projective planes), giving χ(G)=v and n=1, matching the bijective upper bound.\n\nSharp counterexamples and necessary linear coefficients in n\nTheorem (factorial lower bound on any linear-in-n bound). Fix k≥3 and r∈{0,1,…,k−1}. For any function c(k), if one claims χ(G)≤c(k)·n for all instances satisfying “for every z there exist at least r indices t with |f_t^{-1}(z)|≤n”, then necessarily\nc(k) ≥ (1−r/k)^k · k!.\nProof. Use the permutation template f_i(π)=π(i) with F=[k]. Let P_1,…,P_r be r disjoint permutation matrices; let A be the complement (row/column sums k−r). Let E_0(r) be the set of permutations avoiding P_1∪…∪P_r. By Egorychev–Falikman (van der Waerden), |E_0(r)|=per(A) ≥ (1−r/k)^k k!. For any distinct π,σ∈E_0(r), choose s with π^{-1}(s)≠σ^{-1}(s), so the conflict graph on E_0(r) is complete. For each z and each j≤r, the unique row t_j(z) covered by P_j at column z is forbidden, so f_{t_j(z)}^{-1}(z)=∅. Thus the hypothesis holds with n=1 (indeed r indices have fibre 0), and χ(G)=|E_0(r)|. Any bound χ≤c(k)·n at n=1 yields c(k)≥|E_0(r)|, proving the claim.\nCorollary (r=1). Any universal bound of the form χ(G)≤c(k)·n must satisfy c(k)≥(1−1/k)^k k!≈e^{−1}k!.\n\nDesign-based counterexamples under maximal regularity (n=1, all fibres 1)\nLemma (bipartite-incidence template). Let H be a k-regular bipartite graph with parts (E,F) that admits a proper k-edge-coloring into perfect matchings M_1,…,M_k. Define f_i(x) as the unique neighbor of x via M_i. Then: (i) pointwise distinctness holds; (ii) |f_i^{-1}(z)|=1 for all i,z (so n=1 and no zero fibres); (iii) if every two x≠y∈E have a common neighbor in H, the conflict graph is complete.\nExample (projective planes). For k=q+1 (q a prime power), take H the incidence bipartite graph of PG(2,q). Then |E|=|F|=v=k^2−k+1; χ(G)=v and n=1. This saturates the bijective upper bound and is optimal in this regime.\n\nCaveat: why uniform r>1 blow-ups fail. Replacing each left vertex x by r copies while keeping f_i dependent only on the base x forces non-adjacency among pairs of copies of the same x (they cannot conflict without violating pointwise distinctness). Hence completeness fails. This aligns with the uniform r-to-1 upper bound |E|≤r k(k−1)+1.\n\nSmall explicit examples (checkable)\n- k=3, n=1, bijective: Fano plane PG(2,2); |E|=7; χ(G)=7>3.\n- k=3, n=1, factorial (allowing zeros): E={(123),(132),(23),(13),(12)}; χ(G)=5>3.\n- k=4, n=1, factorial core r=1: derangements D_4=9 yield χ(G)=9>3.\n- k=7 (PG(3,2) hyperplanes vs points): k=7, |E|=|F|=15; n=1; χ(G)=15>3.\n\nObstacles/limits\n- In the bijective/uniform regime, the quadratic ceiling is tight (projective planes); superquadratic χ with n=1 requires allowing zero fibres (permutation cores).\n- Uniform r-to-1 near-tight examples beyond r=1 remain open; naive blow-ups break completeness.\n\nNext steps\n- Add to proofs.md: (i) pair-coverage inequality; (ii) corrected uniform r-to-1 bound; (iii) factorial-linear-coefficient theorem above; (iv) difference-set formulation and Singer construction.\n- Seek constructions under “each f_i surjective” (not necessarily uniform) that maximize χ, and upper bounds via the pair-coverage inequality optimized over {a_i(z)} with constraints ∑_z a_i(z)=m and min_i a_i(z)≤n.\n- Explore existence of complete-G constructions near the uniform r-to-1 ceiling for r≥2 (possibly via group-theoretic or design-theoretic gadgets beyond simple blow-ups).\n"
}