{
  "progress_md": "Round 0005 — audit, corrections, and small new lemmas/extensions\n\nAudit of output.md (what to fix or clarify)\n- Duplication of “Lemma E.” The document contains two entries named “Lemma E”: (i) a placeholder “[As before.]” in the main body and (ii) a fully stated and proved version in the “Additions, clarifications, and new tools” section. For consistency and auditability, the placeholder should be removed or replaced by the explicit statement (the latter is already correct and sufficiently general via aggregated layers J_k with measures μ_k).\n- Minor but real arithmetic slip in Lemma T (Fourier two-translate obstruction). The proof concludes “for t=2 and t=4 this would impose δ≡1/2 and δ≡1/4 simultaneously.” The correct implication of e^{2π i t δ}=−1 is tδ≡1/2 (mod 1). Thus for t=2 one gets δ≡1/4 (mod 1/2), and for t=4 one gets δ≡1/8 (mod 1/4). These congruences have no common solution modulo 1, which is the intended contradiction. The fix is easy (replace δ≡1/2 by 2δ≡1/2, etc.).\n- Theorem A, proof of (iii). The line “(iii) can also be deduced from Corollary F by instead choosing |J_0|∉{1/m}” changes the data of the theorem (J_0 was fixed with |J_0|=1/2). This is fine as a variant but should be flagged as a separate remark (Theorem A′). As written in the main proof, the non-column argument appeals to component-length mismatch; that is correct but it would help to cross-reference Lemma T as an alternate short certificate in the present example.\n- Proposition H (incommensurability clause). The statement assumes s rational. Since Lemma Q is now recorded, one can add: “More generally, incommensurability holds whenever s/β∉Q” (choose β accordingly). Suggest adding this as an inline remark after the current sentence to broaden applicability without changing the core proof.\n- “As before” placeholders. Proposition G is referenced “As before.” Given the short proof (phase transport plus J_0+1/q=J_0), I recommend inserting a brief proof sketch or an explicit reference to the earlier established argument so that output.md is self-contained.\n\nNew small lemmas/propositions (incremental, auditable)\n1) Period from periodic meanders (complementary two-layer, singleton regime)\n- Lemma (period-lifting). In Proposition K’s setting (singleton, Δ_n∈Stab(J_0)), if Δ_n has period r and S:=∑_{j=1}^r Δ_j, then T has period (r, rα+S): θ_{n+r}−θ_n = rα+S for all n. Conversely, any choice of r and S∈r·Stab(J_0) is realizable by some periodic Δ_n.\n- Proof. θ_{n+r}−θ_n = ∑_{j=1}^r(α+Δ_{n+j}) = rα + ∑_{j=1}^rΔ_{n+j} = rα+S by r-periodicity of Δ. The converse is obtained by picking any r-periodic Δ with sum S.\n- Why useful here. Packages how meandering increments generate periods beyond the constant-increment (helical) case; helps enumerate all periodic tilings produced by a given J_0 (especially when Stab(J_0)=(1/q)Z).\n\n2) Two-sided boundary obstruction (quick non-column via rational independence)\n- Corollary (to Lemma E). With k_min:=min K and k_max:=max K, let μ_{min}:=|J_{k_min}| and μ_{max}:=|J_{k_max}|. If A tiles a finite X×S^1, then μ_{min}d_{p−k_min}=1 and μ_{max}d_{q−k_max}=1 at the leftmost and rightmost boundary rows p=min X, q=max X. If μ_{min} and μ_{max} are rationally independent over Q, this is impossible. Hence A is not a column.\n- Why useful here. This complements Lemma E with a concrete algebraic obstruction often met in K={0,1,2} with asymmetric endpoint measures.\n\n3) Symmetry of stabilizers (used implicitly in K2)\n- Lemma. For any measurable E⊂S^1 and any α∈S^1, Stab(E)=Stab(S^1\\E)=Stab(E+α) (a.e.).\n- Proof. 1_{S^1\\E} = 1−1_E and 1_{E+α}(x)=1_E(x−α) imply equality of stabilizers a.e. This justifies Stab(J_1)=Stab(J_0) used in Proposition K2.\n- Why useful here. Makes an implicit step explicit and reusable.\n\nSmall examples/sanity checks (consistent with current framework)\n- q=3 complementary family with many periods. Choose U=[0,t) with t=√2/30, set J_0:=U∪(U+1/3)∪(U+2/3) so |J_0|=3t∉{1/m}. For irrational α (e.g., √3/10 mod 1), Proposition G gives three tilings with periods (1,α+j/3), pairwise incommensurable by Lemma R. Lemma E yields non-column; Proposition S makes all tilings singleton-per-row.\n- K={0,1,2} two-order with rational independence at the boundary. Take c_1=√2/5, c_2=1−2c_1, c_3=c_1 (valid since 2c_1<1); then 1/c_1, 1/c_3∉N and are rationally independent with each other, so the boundary corollary forbids finite columns. Two orders exist by Lemma C; incommensurability by Lemma Q after choosing β so that c_1/β∉Q.\n\nObstacles and failure modes (why some approaches don’t go further)\n- Constancy of increments Δ_n. Proposition K shows many singleton tilings with Δ_n varying in Stab(J_0) exist; thus a global “all tilings helical” classification is false without extra rigidity. Any attempt to force Δ_n constant must impose additional structure (e.g., forbid certain patterns via combinatorial propagation or impose extra symmetry on J_0), which is not presently available.\n- Using the boundary lemma alone at |J_0|=1/2. The integrality d_p=2 at the boundary is compatible with measure; forbidding it requires a separate obstruction (component-length or Fourier). This is already addressed (good), but worth keeping in mind for future examples at |E|=1/m.\n\nActionable edits to output.md (concise)\n- Fix Lemma T’s last line as noted: replace “δ≡1/2 and δ≡1/4” by “2δ≡1/2 and 4δ≡1/2 (mod 1), i.e., δ≡1/4 (mod 1/2) and δ≡1/8 (mod 1/4), which are incompatible.”\n- Remove the earlier “Lemma E [As before]” placeholder; keep the explicit version with proof.\n- Move the “variant |J_0|∉{1/m}” comment from within Theorem A’s proof (iii) into a separate remark (Theorem A′) to avoid changing parameters mid-proof.\n- After Proposition H, add: “By Lemma Q, incommensurability also holds whenever s/β∉Q (thus for any s one can choose β accordingly).”\n- Optionally add the period-lifting lemma to the complementary two-layer section; it succinctly classifies periodic tilings generated by meandering increments.\n\nNext steps (concrete, testable)\n- Formalize and insert the “period-lifting” lemma and the two-sided boundary corollary into output.md.\n- Provide a brief proof sketch for Proposition G in situ (phase transport using J_0+1/q=J_0 and complementarity) to eliminate “As before.”\n- Add an explicit worked example (e.g., the q=3 construction above) to demonstrate multiple incommensurable periods and non-columnity in a single place, referencing Lemma T or Lemma E as appropriate.\n- Extend Fourier obstructions to m=3 rigorously (already sketched in notes), then apply to an explicit |J_0|=1/3 example to certify the anti-m-tiling hypothesis in Proposition K2.\n"
}