{
  "progress_md": "Ideas\n\n- We isolate and prove two structural facts that will be used repeatedly: (i) under no-false-merge, pre-collision walks are disjoint and any merge detected by a Step is a true collision; (ii) under an “older-first” tie-break among equal-length walks, the vector of walk lengths is age-monotone (nonincreasing by start index) at all times. The second fact is the key combinatorial invariant that powers the single-scale amortization.\n- We then formalize a symmetrization lemma: in the forward-only, Start-uniform model with an unlabeled certificate, we can w.l.o.g. restrict attention to label-invariant algorithms. For such algorithms, we further impose the older-first tie-break without increasing the expected time to the first collision (proof via exchangeability of ties under a random relabeling of unseen vertices).\n- Finally, we state and prove a clean functions-version of the single-scale coupling (analogue of Claim 6.11) that does not rely on backward queries, using the age-monotone invariant. This fills the placeholder mentioned in notes.md and aligns with Section 6.3’s amortization, adapted to functions.\n\nClarifying events and a basic structural lemma\n\n- Definitions. Fix a function f:[n]→[n] with no loops. At each Step, the algorithm reveals y_t:=f(u_t) for some previously seen u_t. Let I_t be the set of images revealed by Steps strictly before Step t; let S_t be the set of vertices obtained by Start strictly before Step t (uniform-permutation coupling as in output.md).\n- A false merge at time t is the event y_t∈S_t\\I_t (i.e., y_t was previously seen only as a Start). A true collision occurs exactly when y_t∈I_t: then there exists u′ (queried at an earlier Step) with f(u′)=y_t, so f(u_t)=f(u′) and u_t≠u′.\n\nLemma A (Disjointness and collision detection under no-false-merge).\n- Statement. Fix any run and any horizon T. If X_T=0 (no false merges among the first T Steps) then up to the first time a collision is found: (i) walks started from distinct Starts are vertex-disjoint; (ii) the first time a Step lands on any previously visited vertex v is necessarily a true collision (i.e., v∈I_t). In particular, before the first collision, the walk-system is a disjoint family of forward paths.\n- Proof. If a Step lands on a previously seen, non-Start vertex v, then v∈I_t by definition, and we have a collision as above. If a Step were to land on a vertex seen previously only by Start (i.e., in S_t\\I_t), that would be a false merge, forbidden by X_T=0. Hence, until a collision occurs, no Step can land on any previously seen vertex at all, so walks remain disjoint. ∎\n- Why useful here. This justifies treating all active walks as disjoint, forward-only paths until the first collision; there are no interactions to entangle them except the eventual, collision-causing merge into a previously Step-seen image.\n\nAge-monotonicity under older-first ties\n\nDefinition (Older-first tie-break). An algorithm is older-first if whenever it chooses to extend a walk, and there exist two or more eligible walks of the same current length, it extends the one with the smallest start index (the oldest among them).\n\nLemma B (Age-monotone length invariant). Consider any run up to time T in which no collision has occurred (hence walks are disjoint by Lemma A). If the algorithm is older-first, then at every time t≤T, the vector of walk lengths ℓ_j(t) (number of Steps applied to the j-th started walk) is nonincreasing in the start index: ℓ_1(t)≥ℓ_2(t)≥… (for all walks that have been started). Equivalently, when some walk W_j reaches length L at time t, every earlier walk W_{j′} with j′<j has length at least L at time t.\n- Proof. By induction on the number of Steps. Initially, all started walks have equal length (0), hence the invariant holds. Suppose it holds just before some Step that increases a length from ℓ to ℓ+1 on walk W_k. If there were some older j<k with ℓ_j=ℓ, then the older-first rule would have forced extending W_j instead of W_k, contradiction. For older j with ℓ_j>ℓ, increasing ℓ_k to ℓ+1 preserves ℓ_j≥ℓ_k. For younger indices, the invariant cannot be violated by increasing ℓ_k. Hence the invariant is preserved. ∎\n- Why useful here. This yields the exact structural condition needed for the scale amortization: when the “winning” walk W_j reaches length L∈[2^i,2^{i+1}), all older walks have already been extended to length at least L≥2^i unless they had been (prematurely) terminated by a collision—ruled out before the first collision—or by a self-detected stop rule (not needed for our argument).\n\nSymmetrization: reducing to label-invariant and older-first algorithms\n\nDefinition (Label-invariant algorithm). An algorithm is label-invariant if its distribution over next queries depends only on the isomorphism type of the current (unlabeled) state (the multiset of active walk lengths, their relative ages, and the set of Step-seen images), and not on vertex labels.\n\nLemma C (Symmetrization to label-invariance). For any randomized algorithm A and any fixed f, there exists a randomized algorithm A_sym which is label-invariant and satisfies, for any horizon T, E[time-to-first-collision ∧ T of A_sym on f] = E[time-to-first-collision ∧ T of A on f]. Moreover, A_sym can be implemented by sampling a uniform random relabeling σ of [n] at time 0, then simulating A on the σ-relabeling of the instance while undoing σ in queries and answers.\n- Proof sketch. The Start oracle is uniform over unseen vertices; composing the entire interaction with a uniformly random permutation σ of labels preserves the joint distribution of the transcript (up to relabeling). Averaging A over σ yields A_sym whose decisions depend only on the isomorphism type of the revealed (unlabeled) state. This standard symmetrization leaves the distribution (hence expected time) of the hitting time unchanged. ∎\n\nLemma D (Older-first tie-break w.l.o.g. under symmetrization). Let A be label-invariant. There exists a label-invariant algorithm A_old with the same Start/Step schedule laws except that ties among equal-length walks are broken older-first, and such that for any horizon T,\n  E[time-to-first-collision ∧ T of A_old] ≤ E[time-to-first-collision ∧ T of A].\n- Proof sketch. In a label-invariant algorithm, when there is a tie among m equal-length eligible walks, the law of picking one is exchangeable across the m candidates. Fix any run up to the first time a tie occurs; condition on the unlabeled state. Among all exchangeable tie-breaking rules, the deterministic rule “pick the oldest” is a mean-preserving contraction for the rank of the chosen index; by a standard coupling (randomize a total order among tied walks and show that picking the minimal element stochastically dominates picking a uniformly random one), one can couple A and A_old so that (i) the chosen walk under A_old is never younger than under A at any tie; and (ii) between ties, both algorithms make identical choices. Under Lemma B, choosing older at ties preserves (and maximizes) age-monotonicity. Since a collision occurs exactly when some Step lands in I_t (independent of which equal-length representative was picked within the tied class), choosing an older representative never delays the first occurrence of such an event in expectation. Formalizing proceeds by a Doob decomposition of the indicator of “collision occurs at next Step” and exchangeability within ties. ∎\n- Why useful here. We can now assume, w.l.o.g. and without paying in expectation, that the competing algorithm is label-invariant and older-first; this is the regime where Lemma B applies deterministically.\n\nFunctions-version of the single-scale coupling (analogue of Claim 6.11)\n\nWe couple a competing algorithm A (label-invariant, older-first) with the single-scale process A_i inside A_all.\n\nSetup and notation. Fix a scale i and an epoch budget Q. Let r=(r_1,…,r_Q) be the Start string (uniform permutation of unseen vertices) used by both A and A_i. Define events on the run of A up to Q queries:\n- E_noFM: X_Q=0 (no false merges).\n- E_noSK: no skip occurs (as in output.md) up to Q queries.\n- E_hit(i): A finds its first collision within Q queries, and it occurs along some walk W_j whose length at that time lies in [2^i,2^{i+1}).\nBy Lemma A, under E_noFM, before the first collision walks are disjoint. Under E_noSK, the j-th Start in A is exactly r_j, so age indices agree between A and A_i.\n\nLemma E (Single-scale coupling for functions). Condition on E_noFM ∧ E_noSK ∧ E_hit(i). Then, running A_i with the same Start string r, A_i finds a collision within at most 4·(number of Steps made by A up to its first collision) forward Steps.\n- Proof. Let t be the number of Step queries A makes up to its first collision, and let j be the (unique) index of the walk W_j realizing the collision at length L∈[2^i,2^{i+1}). By Lemma B (age-monotone lengths), at time t, for each earlier start j′<j, either (a) W_{j′} has length at least L≥2^i, or (b) W_{j′} would have terminated earlier due to a collision—which cannot happen since this is the first collision—so (a) must hold. Thus, for all j′<j, A has already invested at least 2^i Steps in W_{j′}. The total Step work A spent on the set {1,…,j−1} is ≥ (j−1)·2^i.\nNow consider A_i. By definition, A_i processes starts in increasing order and extends each active walk by up to 2^i Steps (stopping early only upon finding a collision, which only helps). Therefore, the total number of Steps A_i spends on {1,…,j−1} is ≤ (j−1)·2^i ≤ (work of A on {1,…,j−1}). For W_j itself, A_i spends at most 2^{i+1} Steps to reach length L, while A spent L Steps, so A_i’s work on W_j is at most 2·(work of A on W_j). Summing yields that A_i’s total Steps to reach the same collision is at most 2·(work on W_j) + 1·(work on {1,…,j−1}) ≤ 2·t + t = 3t. Conservatively (to account for off-by-one and interleaving overheads), we bound by 4t. ∎\n- Why useful here. This is the exact “scale-by-scale” domination needed to compare A_all to a competing algorithm in the forward-only function model; it replaces the graph backtracking used in the paper with the age-monotone invariant.\n\nAssembling the epoch argument (parameters and constants)\n\n- Let q⋆=RAC(collision,f), and let A⋆ be a (certificate-aware) algorithm with E[Queries(A⋆)]≤q⋆. By Markov, Pr[A⋆ finishes within 2q⋆ Steps]≥1/2.\n- By output.md (Corollary 3) with S,F≤2q⋆ and q⋆≤n/4, we have Pr[E_noFM fails]≤O(q⋆^2/n), Pr[E_noSK fails]≤O(q⋆^2/n). Hence for large enough n and in the target regime q⋆≤√(n)/log^α n with α>1, Pr[E_noFM ∧ E_noSK]≥1−O(1/log^{2α} n).\n- Condition on E_noFM ∧ E_noSK and on A⋆ finishing within 2q⋆ Steps. By Lemma E, in an epoch of length 8q⋆ rounds of A_all (total cost O(q⋆ log n) queries), some A_i finds a collision deterministically. Thus, a single epoch succeeds with probability at least 1/2−O(q⋆^2/n), which is ≥1/3 for sufficiently large n if α>1. A geometric bound implies E[Queries(A_all)] = O(q⋆ log n).\n\nGaps, checks, and what remains\n\n- Output.md correctness. The permutation-coupling bounds for false merges and skips are correct and robust; they are stated and proved cleanly. No changes needed there.\n- Older-first w.l.o.g. (Lemma D). We provided a plausible coupling proof sketch under label-invariance; a fully formal proof should spell out the exchangeability at tie times and the stopping-time argument (define the filtration; show that the conditional success indicator at the next Step is a symmetric function of the tied candidates; older-first maximizes the chance to “serve” older walks without reducing the immediate collision probability). If desired, one can also implement A_old by resolving every tie in A via a fixed deterministic map to the oldest walk, and then average over a random relabeling σ to regain label-invariance and preserve expectation.\n- Cycle closure caveat. Our arguments no longer rely on “cycle closure implies a collision.” In functions, closing a cycle (e.g., returning to v_0) may not immediately witness two distinct preimages of the same image. Lemma A/age-monotone + the collision-as-I_t argument avoids this pitfall.\n- Constants and α. With the Markov+union bound and the 4× overhead in Lemma E, any fixed α>1 suffices for one-epoch success probability ≥1/3 for large n. With a sharper tail bound (Freedman on the skip/false-merge counts) and a tighter constant than 4 in Lemma E (3 suffices by the accounting above), α can likely be pushed down to α≥1 (or even any α>1/2); this is optional refinement.\n\nNext steps\n\n1) Formalize Lemma D. Write a complete proof using the permutation coupling of starts and a tie-exchangeability argument at each tie time, with a stopping-time coupling that shows expected hitting time to the first collision does not increase when switching to older-first ties.\n2) Integrate Lemma E into a fully written proof of Theorem (forward-only, low complexity), tracking all constants in the epoch assembly and clarifying how A_all interleaves scales (one query per scale per round) and how cross-scale collision checks are accounted for (they are not counted as queries).\n3) Optional: provide Freedman/Bernstein tail bounds for the counts of false merges/skips to lower the required α. The martingale differences are bounded by 1 with predictable quadratic variation ≈ F·S/(n−F).\n4) Add small, adversarial toy instances to stress-test Lemma D’s assumptions (label-invariance and tie symmetry), verifying that older-first does not change the expected time under random relabelings.\n\nSummary of new concrete claims ready to curate next\n- Lemma A (No-false-merge ⇒ disjointness and true-collision characterization). Short, fully proved.\n- Lemma B (Age-monotone invariant under older-first ties). Short, fully proved.\n- Lemma C (Symmetrization to label-invariance). Standard, proof sketched; can be expanded.\n- Lemma D (Older-first tie-break w.l.o.g. under symmetrization). Proof sketch provided; to be fully formalized next.\n- Lemma E (Functions single-scale coupling). Fully proved given Lemma B and the no-false-merge/no-skip coupling.\nThese, together with output.md’s probabilistic pillars and the epoch assembly above, essentially complete the forward-only, low-complexity theorem modulo a fully detailed writeup of Lemma D and constant tracking."
}