{
  "summary_md": "Round 0004 (prover-02) produced two checkable, global ingredients that close the anchored-driven improvement gap. Lemma I gives an exact, uniform inequality for the anchored–anchored disagreement: if x=r/n and t=x−1/2 then P[disagree | anchored] = 2 x^3(1−x)^3/(x^3+(1−x)^3)^2 and 1/2 − P[disagree | anchored] ≥ 2 t^2 for all x∈[0,1]. Proposition J' integrates this with the membership-under-disjointness and uniform-boundary lemmas to get the global bound E[switches] ≤ (1/3 + b/12)·n − (2/3)·E_v[τ_v^2·T_v]·n + o(n). Using τ_v ≥ 1/4 yields the corollary E[switches] ≤ (1/3 + b/12 − (1/24)·E_v[T_v] + o(1))·n, so any nontrivial mean-square degree imbalance gives a linear-in-n improvement over the Dvořák baseline. The round also sketches the next focused program for the balanced-degree regime (enumerate Q3 classes with a marked vertex and build an LP/SDP to bound b). Citations: prover-02.out.json; output.md.",
  "highlights": [
    "Lemma I (exact anchored-drop): For x=r/n and T=(x−1/2)^2, P[disagree | anchored] = 2 x^3(1−x)^3/(x^3+(1−x)^3)^2 and 1/2 − P[disagree | anchored] ≥ 2T for all x∈[0,1]; equality at extremes.",
    "Proposition J' (global integration): Combining Lemma I with Lemma E0 and Proposition G yields E[switches] ≤ (1/3 + b/12)·n − (2/3)·E_v[τ_v^2·T_v]·n + o(n).",
    "Concrete corollary (explicit unconditional gain): Since τ_v ≥ 1/4 − O(1/n), E[switches] ≤ (1/3 + b/12 − (1/24)·E_v[T_v] + o(1))·n, so any fixed lower bound on E_v[T_v] gives a linear improvement.",
    "Implication: The anchored-driven savings fully handles degree-unbalanced instances; the only remaining hard regime is near-perfectly balanced degrees (E_v[T_v]≈0).",
    "Planned attack for balanced regime: enumerate 2-colorings of Q3 with a marked vertex (good/bad and f1-start color under the tie-breaking), impose 4-cycle/Q3 consistency and marginal constraints, then maximize b via an LP/SDP.",
    "Technical notes: the new lemmas remove small-t expansions (giving uniform valid inequalities), and the ordered/unordered pair distinction was checked to be immaterial for the averaged bounds; optional sharpening (improving the constant >2) was suggested."
  ],
  "next_questions": [
    "Incorporate Lemma I and Proposition J' (with proofs) into output.md and explicitly add the anchored tie-breaking convention there; verify all o(1) error bookkeeping for the boundary-sum aggregation.",
    "Enumerate Q3 2-coloring isomorphism classes with a marked vertex, tag good/bad and record f1-start color under the chosen tie-breaking; produce frequency/marginal data to feed the balanced-case LP.",
    "Formulate and solve the symmetric (balanced-degree) LP/SDP with symmetry reductions to test whether b ≤ 1/2 − γ holds; if numerical γ>0 appears, attempt to convert it to an analytic bound."
  ]
}