{
  "progress_md": "Round 0006 — Small audits, two new τ-instantiations, a discrete-smoothness-to-long-plateaus lemma, and a clearer path for probability bounds\n\nAudit of output.md (no blocking issues)\n- Corollary 11/12: The “third branch only for L≥3” restriction is now clearly documented (Remark after Cor. 12). Good.\n- Corollary 13 (global aggregation): The weights and treatment of L_j=1 via the fixed-k bound are correct. The endpoint sum cap (Lemma 1) is clean and used properly in Corollary 14.\n- Corollary 16: The global ≥1% probability lower bound properly carries the plateau mass factor γ. Constants are explicit.\nNo correctness errors spotted. The additions below are meant to tighten the per-plateau envelope with simple, checkable instantiations and to connect “discrete smoothness” of OPT(·) to long plateaus.\n\nNew, checkable per-plateau corollaries (to add after Corollary 10)\n1) Balanced-split with hard constants (τ = ⌊L/2⌋)\nStatement. In Theorem 3, for L≥3 and τ:=⌊L/2⌋, for k uniform on I=[m,m+L):\nE_{k∈I} E_++[ALG/OPT] ≤ 2·C_bi [ (2/3)(a+1+ln(4m/(L−1))) + 1/2 + (m/(e(L−1)))(ln 3 + 1) ] + (C_fix(ln m + O(1)))/L,\nwith a:=2+1/(2e).\nJustification (fully checkable): For L≥3 and τ=⌊L/2⌋ we have τ/(L−1) ≤ 2/3; (L−1−τ)/(L−1) ≤ 1/2; ln(2m/τ) ≤ ln(4m/(L−1)); and H_{L−2}−H_{τ−1} ≤ ln 3 + 1 (verify small-L cases directly). Substitute these bounds into Theorem 3. Why useful. This removes the ln L factor in the harmonic tail, replacing (m ln L)/L by a pure (m/L) term at the expense of a larger constant on the logarithmic piece. It can be tighter than both existing extremes in midrange regimes.\n\n2) Constant-tail split (τ ≈ (L−1)/e)\nStatement. In Theorem 3, for L≥3 and τ:=⌊(L−1)/e⌋ ≥ 1,\nE_{k∈I} E_++[ALG/OPT] ≤ 2·C_bi [ (1/e)(a+1+ln(2em/(L−1))) + (1−1/e) + (m/(e(L−1)))·2 ] + (C_fix(ln m + O(1)))/L.\nJustification. With τ≈(L−1)/e, we have τ/(L−1) ≤ 1/e and (L−1−τ)/(L−1) ≤ 1−1/e. For the harmonic tail, H_{L−2}−H_{τ−1} ≤ ln((L−1)/(τ))+1 ≤ ln e + 1 = 2. Finally ln(2m/τ) ≤ ln(2em/(L−1)). Substitute into Theorem 3. Why useful. This gives a third, fully explicit branch with a constant harmonic tail contribution 2·(m/(e(L−1))), i.e., a clean O(m/L) tail with a small constant, and a logarithmic piece whose coefficient is 1/e of that in the pure-log term. It sometimes improves over τ=1 for moderate L when ln L is not small but m/L is.\n\nRemarks on regime selection (min-of-five)\n- The per-plateau min may be extended to five branches: τ∈{L−1, 1, ⌊m/ln L⌋, ⌊L/2⌋, ⌊(L−1)/e⌋}. All are explicit and easy to verify. A practical recommendation is to keep the three already curated (pure-log, τ=1, τ=⌊m/ln L⌋) and optionally add the constant-tail split τ≈(L−1)/e when one wants a clean O(m/L) tail with a smaller constant than in the τ=1 branch; the balanced-split can be listed as an optional midrange tightening.\n\nDiscrete smoothness ⇒ long plateaus: a simple structural lemma\nLemma (discrete-smoothness-to-length). Let (v_k)_{k≥1} be a nonincreasing positive sequence. Suppose on an interval [m, m+L) we have for some δ∈(0,1): for all k∈{m+1,…,m+L−1}, v_{k−1} ≤ (1+δ) v_k. Then any factor-2 drop of v_k over that interval requires L ≥ ⌈ln 2 / ln(1+δ)⌉ ≥ ⌈(ln 2)/δ⌉ − 1.\nProof. For t steps, the total multiplicative drop is at most (1+δ)^t. To drop by 2 we need (1+δ)^t ≥ 2 ⇒ t ≥ ln 2 / ln(1+δ). Since ln(1+δ) ≤ δ, t ≥ (ln 2)/δ. Thus, the length L of a factor-2 plateau must satisfy L−1 ≥ t, giving the displayed bound.\nCorollary (long plateau from 1/m-type smoothness). If for all k in [m,2m) we have v_{k−1} ≤ (1 + A/m) v_k with some absolute A>0, then any factor-2 drop within [m,2m) requires L ≥ c_A·m for c_A:= (ln 2)/A − o(1). In particular, L ≥ α m for α:= (ln 2)/A − ε once m is large, hence Corollary 5 applies and the plateau contributes O_α(1) to the average.\nWhy useful here. Instantiating v_k := OPT(k), this gives a simple, checkable surrogate for “long plateaus”: if the discrete per-step multiplicative decay OPT(k−1)/OPT(k) is at most (1+A/m) on [m,2m), then the corresponding dyadic-scale plateau inside that window is long (L ≳ m), yielding a constant per-plateau bound and, if such windows occupy a γ-fraction of [k0,2k0), a global mixture bound of the form Corollary 15. This isolates a data-agnostic regularity condition that implies the beneficial “oversampling by randomizing k.”\n\nProbability ≥ 1% under discrete smoothness (simple consequence)\nUnder the same 1/m-type smoothness on [m,2m) with A<∞ (hence L ≥ α m for α=(ln 2)/A−ε), Corollary 9 with η=0.98 and c=2 gives, on that plateau, joint (k,++) probability ≥ (0.02−O(1/L))·0.5 for attaining ALG/OPT ≤ 2·B_I with B_I ≤ 2·C_bi(1 + 1/(α e η)) + o(1). Mixing across [k0,2k0) by the plateau mass γ gives a global ≥ 0.01·γ − o(1) guarantee with an explicit constant, exactly as in Corollary 16.\n\nExamples and quick checks\n- If OPT(k−1)/OPT(k) ≤ 1 + (1/10m) for k∈[m,2m), then α≥ (ln 2)·10 ≈ 6.93 > 1. Since L cannot exceed m by the window constraint, this means the dyadic drop cannot happen within [m,2m); hence the entire window is a single plateau (L≈m) and the per-plateau bound is O(1).\n- τ≈(L−1)/e branch vs τ=1: when L is large and m/L is moderate (say m/L ≤ c), the new branch replaces (m ln L)/L with ≈(2/e)(m/L) while the log term’s coefficient is reduced by 1/e. Numerically, for L=10^6 and m/L=2, τ=1 gives an O(m ln L/L) term ≈ 2·ln 10^6, while τ≈(L−1)/e gives ≈ (2/e)·2 ≈ 1.47 in the tail, often improving the minimum.\n\nHeavy-coverage program (status and incremental step)\n- Conditional collision control revisited. Let H be k1 heavy optimal clusters; write S_H := ∑_{P∈H} OPT1(P). For every t before heavy coverage completes, the per-step collision probability into a covered heavy cluster is p_t^{ch} = H_t(H_cov)/cost_t(X). Using the eH_t supermartingale, we have E[H_t(H_cov)] ≤ 5 S_H and hence E[p_t^{ch}] ≤ E[5 S_H / cost_t(X)]. To turn this into a usable bound, we need a pathwise (or at least conditional-expectation) lower bound on cost_t(X) in terms of the uncovered heavy mass U_t(H); e.g., a persistence condition cost_t(X) ≥ β·U_t(H). This remains the key missing link (as already noted in the verifier feedback). \n- Special-case metric separation (toward a fully rigorous lemma). Under the separation: for every heavy P and every y∉P, dist(µ_P,y) ≥ λ·rad(P) with λ≥20 (rad^2(P) denotes average squared radius contributing to OPT1(P)), one can bound, for all t before covering P, ∑_{x∈P} D_t(x)^2 ≥ OPT1(P) (trivial) and show that the total D^2-mass outside all uncovered heavy clusters is at most a 1/Θ(λ^2) fraction of ∑_{P∈H_uncovered} OPT1(P) plus a constant ·∑_{Q∈H_cov} OPT1(Q). This implies p_t^H := Prob[next pick ∈ uncovered heavy | F_t] ≥ 1 − O(1/λ^2) − O(S_H / ∑_{P∈H_uncovered} OPT1(P)). If heavy mass dominates light (scale separation), then the last term is negligible until near the end, yielding expected heavy-collisions O(k1/λ^2). I will formalize this bound with explicit constants next, carefully isolating: (i) the geometric inequality that caps the outside mass per uncovered heavy cluster by ≲ (1/λ^2)·OPT1(P), and (ii) the use of eH_t to control covered-heavy contributions.\n\nNext steps (concrete, verifiable)\n- Curate the two new τ-instantiations: (i) τ=⌊L/2⌋ and (ii) τ=⌊(L−1)/e⌋, as explicit corollaries of Theorem 3 (proofs above). They extend the per-plateau min with constant-tail options.\n- Add the discrete-smoothness-to-length lemma and its corollary (1/m-type smoothness ⇒ long plateau ⇒ O(1) bound), to provide a clean structural condition guaranteeing improved averages or ≥1% probability guarantees.\n- Heavy coverage: Prove the “outside mass” geometric inequality rigorously under λ-separation, completing the expected heavy-collision bound with explicit constants; then state a combined (λ,R)-separation lemma converting into an O(log(1/ε)) tail via bi-criteria oversampling of the light part.\n- Optional constants: If desired, tighten Corollary 12’s K0 from 35 to 33 by re-auditing O(1/L) remainders in the pure-log branch; otherwise keep 35 for safety.\n"
}