{
  "progress_md": "Round 0006 — Audit, minor clarifications, and new, checkable additions (balanced split, multi-plateau probability, and a quantified O(log log k0) mixture)\n\nQuick audit of output.md (minor points and clarifications)\n- Absorbing small 1/L terms into constants. In Corollary 8 the step “absorb constants into K0 and the terms (ln m)/(L−1), (m/(L−1)) into K2(ln m)/L and K1(m ln L)/L” is sound when used as an upper envelope: for L≥2, (ln(2m))/(L−1) ≤ 2(ln m)/L + O(1), and a/(L−1) ≤ a, so additive O(1/L) pieces can be folded into K0. It may help to add a one-line remark justifying these two inequalities to prevent confusion.\n- Third branch domain. The L≥3 restriction is now clearly stated in Corollaries 11–12 and a clarifying remark follows, which fixes the earlier edge case (ln ln 2<0).\n- Endpoint term accounting. Lemma 1 bounds the aggregated endpoint term by ≤ ln(2k0), which is sufficient for all global combinations used later.\nI see no correctness issues; below I add compact, checkable refinements that can be curated next.\n\nNew, checkable corollaries and remarks\n\n1) Balanced-split corollary (mid-split τ=⌊L/2⌋) with safe constants (fills an intermediate regime)\n- Statement. In the setting of Theorem 3 with L≥3 and τ:=⌊L/2⌋, for k uniform on I=[m,m+L),\n  E_{k∈I} E_++[ALG/OPT]\n  ≤ 2 C_bi [ (2/3)(a + 1 + ln(4m/(L−1))) + 1/2 + (m/(e(L−1)))(ln 3 + 1) ]\n    + (C_fix(ln m + O(1)))/L,\n  where a:=2+1/(2e).\n- Proof sketch (checkable). For L≥3, uniformly: τ/(L−1) ≤ 2/3; (L−1−τ)/(L−1) ≤ 1/2; ln(2m/τ) ≤ ln(4m/(L−1)); and H_{L−2}−H_{τ−1} ≤ ln 3 + 1 (verify directly for L=3,4 and use monotonicity for larger L). Substitute these bounds into Theorem 3. \n- Why useful. This bounds the tail by a pure (m/L) term (up to constants), sometimes improving constants over both extremes and complementing the τ≈m/ln L branch. It can be recorded as an optional fourth candidate in the per-plateau minimum (min-of-four), or just cited as a remark for midrange L.\n\n2) Multi-plateau 1% probability guarantee (global mixing over several long plateaus)\n- Statement. Let J_long be a family of plateaus I_j=[m_j,m_j+L_j) with L_j ≥ α m_j, and suppose their total coverage is γ:= (1/k0)∑_{j∈J_long} L_j. Then, with η=0.98 and c=2 (as in Corollary 9),\n  P_{k∼U([k0,2k0)),++}[ ALG_k/OPT_k ≤ 2·B_j for k∈I_j for some j∈J_long ]\n  ≥ γ·(1−η−O(1/ min_j L_j))·(1−1/2) = 0.01·γ − O(γ/ min_j L_j),\n  where for each j, B_j := 2 C_bi (1 + m_j/(e(T_j−1))) with T_j:=max{2,⌈η(L_j−1)⌉+1}, and hence B_j ≤ 2 C_bi (1 + 1/(α e η)) + O(1/L_j).\n- Proof. Apply Corollary 9 on each I_j with the same (η,c), then average with weights L_j/k0. The minimum L_j controls the O(1/L_j) term in the product measure.\n- Why useful. This extends Corollary 16 from “one long plateau” to “a union covering γ of the window,” yielding a clean ≥1%·γ joint probability with the same explicit constants.\n\n3) Explicit O(log log k0) mixture under polylog-long plateaus (quantified and ready to aggregate)\n- Statement (global average). Fix σ≥1. Let S be the set of plateaus I_j with L_j ≥ m_j/(ln k0)^σ, and suppose ∑_{j∈S} L_j ≥ γ k0. Then, for k uniform on [k0,2k0) and ++ randomness,\n  E[ALG/OPT] ≤ γ·[ 2 C_bi (a+1+ln(2(ln k0)^σ)) ] + (1−γ)·[K′ + K″ ln(2k0)] + o(1)\n  = γ·[ 2 C_bi (a+1+ln 2 + σ ln ln k0) ] + (1−γ)·[K′ + K″ ln(2k0)] + o(1).\n- Proof. On each I_j∈S, Corollary 5 with α=1/(ln k0)^σ gives a per-plateau constant a+1+ln(2/α) = a+1+ln 2 + σ ln ln k0, up to o(1). Weight these by L_j/k0 and sum to get the γ term; bound the complement by Corollary 14. The endpoint terms aggregate to o(1) on S (since (ln m_j)/L_j ≤ σ ln ln k0/(ln k0)^σ) and to O(ln k0) on the complement (Lemma 1), which is absorbed into the (1−γ) term.\n- Why useful. This is a precise, easy-to-use version of the informal “O(log log k0) on long plateaus” statement with explicit dependence on σ and γ and fully tied to existing corollaries.\n\nHeavy-coverage program — a crisp conditional lemma (expectation form, with parameters explicit)\n- Lemma (expected heavy-collision bound under persistence and covered-cost control). Let H be k1 optimal clusters designated “heavy,” and let S_H:=∑_{P∈H} OPT1(P). Define U_t(H) (uncovered heavy cost at step t), H_t(all) and U_t(L) as usual. Suppose up to the stopping time τ (when all heavy clusters become covered):\n  (i) Persistence/dominance: U_t(H) ≥ β·(H_t(all) + U_t(L)) for all t<τ;\n  (ii) Covered-heavy control in expectation: E[H_t(H)] ≤ α S_H for all t (α=5 suffices by the eH_t supermartingale and Lemma 4.1 of MRS).\n  Then the expected number of heavy-collisions (selections in already-covered heavy clusters) before τ is at most (α/(β+1))·k1·(S_H/ inf_{t<τ} U_t(H)). In particular, if inf_{t<τ} U_t(H) ≥ S_H (a strong persistence), then E[collisions] ≤ (α/(β+1))·k1.\n- Proof sketch (conditional and checkable). At step t, condition on the filtration. The collision probability into covered heavy is ≤ H_t(H)/cost_t(X) ≤ α S_H/(U_t(H)+H_t(all)+U_t(L)) ≤ α S_H/((β+1)U_t(H)) by (i). Sum this bound over at most k1 heavy hits (each heavy step either covers a new heavy cluster or collides) and use U_t(H) ≥ inf_{s<τ} U_s(H). Take expectations and apply (ii).\n- Why useful. This isolates the coupon-collector-like collision control under explicit, testable parameters (β and the persistence lower bound). The remaining step is to prove persistence from scale or geometric separation (e.g., OPT_{k1} ≫ OPT_k), at least in expectation.\n- Note on rigor. Unlike earlier sketches, this version avoids pathwise claims about eH_t; it uses the expectation control E[H_t(H)] ≤ 5 S_H and yields an expectation bound. High-probability control can then be pursued via Freedman’s inequality once a concentration statement for eH_t is established.\n\nExamples and sanity checks\n- Dyadic single plateau (L≈m). Corollary 5 gives E[ALG/OPT] ≤ 2 C_bi (a+1+ln 2) + o(1). With C_bi=5 and a≈2.183, this is ≤ 10·(3.183 + 0.693) + o(1) ≈ 38.8.\n- Polylog-long plateaus. With σ=2 and γ=1/2, the global bound in item 3 reads E[ALG/OPT] ≤ 0.5·[const + 2 C_bi·2 ln ln k0] + 0.5·K″ ln(2k0) + o(1); thus the long-plateau half contributes O(ln ln k0) explicitly.\n- Mid-split vs other branches. For L=m/20, the balanced split gives a tail ≈ (m/L)·const ≈ 20·const; the log branch gives ≈ ln(40) ≈ 3.69 up to constants; log dominates here (as expected). For L=m/ln m, the τ≈m/ln L branch yields ≈ (m/L)(1+ln ln L) ≈ ln m (1+ ln ln ln m), which is looser than the log branch’s ≈ ln(2 ln m); again, the min picks the right regime.\n\nNext steps (concrete and verifiable)\n1) Curate the balanced-split corollary into output.md (as an optional candidate alongside the three existing branches). It is a direct instantiation of Theorem 3 with uniform, easy-to-check inequalities.\n2) Add the multi-plateau ≥1% probability corollary (item 2), which follows immediately from Corollary 9 by mixing; it generalizes Corollary 16.\n3) Add the quantified O(log log k0) mixture (item 3) as a corollary under the polylog-long-plateau condition with parameters (σ,γ); this formalizes a recurring use-case with explicit constants.\n4) Heavy-coverage: Try to prove a persistence bound inf_{t<τ} U_t(H) ≥ c·S_H and a β=Ω(1) dominance under a clean scale separation hypothesis, first in a simplified geometric regime (e.g., metric separation) and then from OPT_{k1} ≥ k^C·OPT_k; combine with the expectation lemma above. Work towards concentration of eH_t to upgrade to high probability.\n\nWhy this advances the program\n- The balanced-split adds a simple, rigorous midrange option, improving constants in some regimes without increasing complexity.\n- The multi-plateau probability and quantified O(log log k0) mixture turn earlier informal remarks into precise, ready-to-use global statements with explicit parameters and constants.\n- The heavy-coverage conditional lemma is a clean step that avoids pathwise pitfalls and sets up the final task (proving persistence from scale/geometry separation) needed to harvest O(log(1/ε)) from oversampling of the light part."
}