{
  "summary_md": "Round 0006 summary: Both provers audited output.md (no blocking correctness issues) and added multiple checkable corollaries and lemmas. Per-plateau: two new τ-instantiations — balanced-split τ=⌊L/2⌋ and constant-tail τ=⌊(L−1)/e⌋ — with explicit safe constants producing midrange improvements and clean O(m/L) tails. Global mixing: a multi-plateau ≥1% probability corollary (P ≥ 0.01·γ − O(γ/min_j L_j)) and a quantified O(log log k0) mixture for plateaus L_j ≥ m_j/(ln k0)^σ giving a γ-weighted term ≈ 2 C_bi (a+1+ln 2 + σ ln ln k0). Heavy-coverage: a rigorous expectation-form lemma bounds expected heavy-collisions by (α/(β+1))·k1·(S_H / inf_t U_t(H)), reducing the remaining task to proving persistence (a lower bound on uncovered heavy mass); provers propose to obtain this via λ-separation, which would yield collisions O(k1/λ^2). A discrete-smoothness ⇒ long-plateau lemma ties per-step multiplicative smoothness to plateau length L ≳ ln2/δ, enabling the 1% mixing guarantee under mild smoothness. Verifier: partial success. Citations: prover-01.out.json, prover-02.out.json.",
  "highlights": [
    "Audit: no blocking correctness issues; fixed L≥3 edge-case and endpoint term accounting (aggregate endpoint ≤ ln(2k0)).",
    "Balanced-split corollary (τ=⌊L/2⌋): explicit bound giving a midrange option that replaces (m ln L)/L by a pure (m/L) tail up to constants.",
    "Constant-tail split (τ≈(L−1)/e): explicit third branch with harmonic tail bounded by 2·(m/(e(L−1))) — a clean O(m/L) term with small constant.",
    "Multi-plateau mixing: for a family of long plateaus covering fraction γ, joint (k,++) probability ≥ 0.01·γ − O(γ/min_j L_j) that ALG/OPT ≤ 2·B_j on some plateau; B_j has explicit bounds (≈2 C_bi(1+1/(α e η))+O(1/L_j)).",
    "Quantified O(log log k0) mixture: if plateaus satisfy L_j ≥ m_j/(ln k0)^σ and cover γ fraction, the global average is γ·[2 C_bi(a+1+ln2+σ ln ln k0)] + (1−γ)·[K'+K'' ln(2k0)] + o(1).",
    "Heavy-coverage expectation lemma: E[# collisions] ≤ (α/(β+1))·k1·(S_H/inf_{t<τ} U_t(H)). Discrete-smoothness lemma: if v_{k-1} ≤ (1+δ)v_k then factor-2 drop requires L ≥ ⌈ln2/ln(1+δ)⌉ ≥ ⌈(ln2)/δ⌉−1, so 1/m-type smoothness implies long plateaus and hence the mixing/probability guarantees."
  ],
  "next_questions": [
    "Curate and add the two new τ-instantiation corollaries (τ=⌊L/2⌋ and τ=⌊(L−1)/e⌋), the multi-plateau ≥1% probability corollary, and the quantified O(log log k0) mixture to output.md with the explicit bounds and short checkable proofs.",
    "Formalize and prove the geometric \"outside mass\" inequality under λ-separation with explicit constants; use it to derive a persistence lower bound inf_{t<τ} U_t(H) ≥ c·S_H (or quantify when it holds) and combine with the expectation lemma to obtain collision bounds (and then high-probability statements via concentration).",
    "Optional: re-audit small O(1/L) remainders and consider tightening safety constants (e.g., K0 reduction) once the geometric/persistence lemmas are formalized and constants propagated."
  ]
}