{
  "progress_md": "### Audit of output.md (gaps, clarifications)\n- Theorem 11 (|U|=4) now looks correct after the fix using Theorem 7 (robust L-corner). I rechecked the subcases; no further issues found.\n- Theorem 10 (unique-maximal: top-row pivot) implicitly uses the fact that in the unique-maximal regime there is no point with y>Y or x>X. This is true but not explicitly stated; I recommend curating the following simple observation (O1) so the proof does not rely on an unstated fact.\n- Theorem 9 (SW-max with boundary thresholds ⇒ unique type 1) conceptually relies on the fact that for p∈Max(S) there are no points of U on the open vertical/horizontal segments above/right of p within S. This is used implicitly; I state it cleanly as Lemma UM1 below for curation.\n\n### New, rigorously stated lemmas ready to curate (with proofs)\n\nObservation O1 (unique maximal ⇒ coordinatewise maxima).\nStatement. If U has a unique maximal element m=(X,Y) in the product order, then X = max{x : (x,·)∈U} and Y = max{y : (·,y)∈U}.\nProof. If some u=(x',y') has x'>X, then no v∈U satisfies v_x≥x' and v_y≥y' with at least one strict inequality (none can have x≥x'>X), so u is maximal too, contradicting uniqueness. The argument for y'>Y is symmetric. ∎\nWhy useful. Makes explicit a fact used in Theorem 10 and elsewhere.\n\nLemma UM1 (SW-maxima have no interior points on their column/row).\nSetup. Let U have a unique maximal m=(X,Y). Let S={p∈U : p_x<X and p_y<Y} and Max(S) its product-order maximal elements.\nStatement. If p=(α,β)∈Max(S), then (i) there is no q∈U with x=α and β<y<Y; (ii) there is no q∈U with y=β and α<x<X. Consequently every NE neighbor of p lies on the top row y=Y or the right column x=X.\nProof. If q=(α,y) with β<y<Y existed, then q∈S and q≻p, contradicting p∈Max(S). The horizontal case is identical. The consequence follows immediately. ∎\nWhy useful. This isolates exactly where extra NE neighbors of p can come from, underpinning Theorem 9.\n\nLemma D′ (consecutive-maxima robust L-corner; specialization of Theorem 7).\nSetup. Let M=Max(U) be listed as m_i=(x_i,y_i) with x_1<⋯<x_k and y_1>⋯>y_k (k≥2).\nStatement. If for some i we have no point (x_i,y) with y_{i+1}<y<y_i and no point (x,y_{i+1}) with x_i<x<x_{i+1}, then the color (2,x_i,y_{i+1}) is unique in G[U].\nProof. The two emptiness conditions give r_U(x_i,y_{i+1})=1 (only (x_i,y_i) lies above) and s_U(x_i,y_{i+1})=1 (only (x_{i+1},y_{i+1}) lies to the right). By the type–2 multiplicity formula, the multiplicity is 1. ∎\nWhy useful. A clean, local certificate when scanning consecutive maxima.\n\nLemma R4 (row-of-two with globally unique left base ⇒ unique type 4).\nStatement. Suppose there exists a row β with exactly two points (α,β),(α',β) with α<α′. Assume furthermore that for every β'≠β we have either (α,β')∉U or there is no point (x,β') with x>α. Then color (4,α) appears exactly once in G[U].\nProof. By the type–4 formula, T_4(α)=∑_{β''} 1_{(α,β'')}·h_{β''}(α). Only β contributes (exactly one right neighbor), and it contributes h_β(α)=1. All other rows contribute 0 by assumption. Hence T_4(α)=1. ∎\n\nLemma R3 (column-of-two with globally unique lower base ⇒ unique type 3; dual of R4).\nStatement. Suppose there exists a column α with exactly two points (α,β),(α,β') with β<β′. Assume furthermore that for every α'≠α we have either (α',β)∉U or there is no point (α',y) with y>β. Then color (3,β) appears exactly once in G[U].\nProof. By the type–3 formula, T_3(β)=∑_{α''} 1_{(α'',β)}·v_{α''}(β). Only α contributes (exactly one point above), and it contributes v_α(β)=1. All other columns contribute 0 by assumption. Hence T_3(β)=1. ∎\n\n### Why these help and how to use them\n- O1 and UM1 close implicit gaps in the unique-maximal arguments and can be cited directly in Theorems 9–10.\n- D′ adds a robust, easy-to-check certificate when scanning consecutive maxima; it is a direct specialization of Theorem 7 that many configurations satisfy.\n- R3 and R4 are globally safe “singleton+extension” style triggers when a 2-point row/column has a left/lower base that does not act as a base elsewhere; they follow immediately from the multiplicity formulas and are useful in small-case analyses and in pruning “offender” configurations when consecutive-maxima witnesses fail.\n\n### Examples (sanity checks)\n- UM1 in action. U={ (2,2),(2,5),(4,5),(6,3),(6,6) } with unique maximal m=(6,6). Then S contains p=(2,2) and p is in Max(S). UM1 forbids any (2,y) with y∈{3,4} and any (x,2) with x∈{3,4,5}. Indeed, p’s NE neighbors can only lie on row 5 or column 6.\n- D′ witness. U has consecutive maxima m_1=(3,8), m_2=(7,4); suppose there is no point (3,y) with y∈{5,6,7} and no point (x,4) with x∈{4,5,6}. Then (2,3,4) is unique.\n- R4 witness. U contains row y=5 points at x=2 and 6, and no other row contains an (x=2,·) with any right neighbor. Then T_4(2)=1 and (4,2) is unique.\n\n### Ideas toward the remaining hard cases (precise statements to be proved next)\n- Unique-maximal, S≠∅: pivot-or-corner fixpoint. Choose p∈Max(S) with maximal x and then maximal y. By UM1, any NE neighbor of p lies on the top row or right column. There are three regimes to analyze:\n  1) Both (α:=p_x,Y) and (X,β:=p_y) lie in U. Then (2,α,β) is unique immediately (r=s=1 by UM1 and Theorem 1).\n  2) Exactly one of these lies in U. If, in addition, p_x≥α₂ and p_y≥β₂ (nearest-boundary thresholds), Theorem 9 gives a unique type–1 color. Otherwise, the very boundary points preventing Theorem 9 (extra top-row points right of p_x or extra right-column points above p_y) can potentially be harvested into a D′-style L-corner or an R3/R4 singleton+extension. I will formalize a short “nearest-neighbor” lemma that either produces (2,α',β') unique at the first boundary intersection, or isolates a row/column satisfying R3/R4.\n  3) Neither (α,Y) nor (X,β) lies in U. Consider the nearest top-row point a=(α*,Y) with α*>α (if any) and the nearest right-column point b=(X,β*) with β*>β (if any). If both exist, UM1 ensures the open segments above/right of p on column α and row β are empty; a and b, together with p, then form the frame of a robust L-corner at (α,β). This yields a unique type–2 color by Theorem 7. Otherwise, if only one exists, we are back in (2) with potentially a unique type–1 via Theorem 9. I will write this carefully next round (checking the emptiness claim and handling the cases when multiple boundary points exist).\n\n- Multiple maxima (|Max(U)|≥2). For each adjacent pair we either certify uniqueness by D′ or record an “offender” in its column or row (an extra point inflating R_i or S_i). Offenders for different i live on disjoint rows/columns ({y_{i+1}} and {x_i} are all distinct). A pigeonhole/counting lemma should force that some offender actually creates a singleton+extension (R3/R4) or itself forms part of a D′ witness. I will formalize:\n  • Counting Lemma (to prove): If for all i either R_i≥2 or S_i≥2 and no D′-witness exists, then there is α with exactly one row β having (α,β) and exactly one right neighbor (hence T_4(α)=1), or dually a β with exactly one column α having (α,β) and exactly one upper neighbor (T_3(β)=1).\n\n### Next steps (concrete, auditable)\n1) Curate O1, UM1, D′, R3, and R4 into output.md; these are safe and strengthen the toolset used by Theorems 9–11.\n2) Write and verify the “nearest-boundary lemma” in the unique-maximal regime: with p∈Max(S) chosen extremally, show that if Theorem 9 fails then either a D′/Theorem 7 witness exists at (p_x,β*) or (α*,p_y), or a singleton+extension (R3/R4) fires on the boundary row/column.\n3) Prove the counting lemma for multiple maxima by aggregating offenders on the disjoint families of rows {y_{i+1}} and columns {x_i} and extracting an R3/R4 or D′ trigger. Validate on dense staircase-like examples.\n\n### Summary of progress this round\n- No new gaps in output.md beyond a suggestion to add O1 and UM1 explicitly. The |U|=4 proof is now sound.\n- Added four rigorous, reusable lemmas (O1, UM1, D′, R3/R4) with proofs, strengthening the unique-maximal and multiple-maxima toolkits.\n- Outlined precise, checkable next steps to finish the unique-maximal case (via a nearest-boundary analysis) and to handle the “all consecutive maxima heavy” regime via a counting lemma."
}