{
  "progress_md": "Round 0007 — incremental, auditable progress\n\nOverview\n- I audited the current output.md. I found no new logical flaws since the last correction to Theorem 11 (|U|=4). Theorem 9 (unique–maximal threshold ⇒ unique type 1) and Theorem 10 (top-row pivot ⇒ unique type 4) are correctly stated and proved. The dual “right-column pivot ⇒ unique type 3” is intentionally not present in symmetric form (as noted in notes.md) because it needs a singleton-row hypothesis; Theorem 3 already supplies the safe version. Below I consolidate the unique–maximal case by formalizing two threshold-existence lemmas, extract a corollary for the search strategy, and add a robust L-corner variant useful in 2+2(+…) configurations.\n\nGaps or cautions in output.md\n- None needing immediate correction. A cautionary note: the dual of Theorem 10 must remain in the singleton-row form (Theorem 3); there is no safe global dual without that assumption (see the counterexample recorded in notes.md).\n\nNew lemmas (rigorous; to be curated)\n\nLemma UM–X (x-threshold existence under unique maximality).\n- Setting. U has a unique maximal m=(X,Y). Let T={x<X : (x,Y)∈U} and S={p∈U : p_x<X and p_y<Y}. If S≠∅ and T≠∅, define α₂=max T.\n- Claim. Either (i) column α₂ contains no point below Y, in which case Theorem 10 yields a unique type–4 color; or (ii) there exists p∈Max(S) with p_x≥α₂.\n- Proof. If column α₂ has no point below Y we are in (i). Otherwise pick q=(α₂,β) with β<Y; then q∈S. In any finite poset, every element is dominated by some maximal element, so there is p∈Max(S) with p≽q, hence p_x≥α₂. ∎\n- Why useful. This guarantees that when the top-row pivot (Theorem 10) does not fire, there is a SW-maximal point whose x-coordinate is at least the second-rightmost top-row x, providing half of the threshold for Theorem 9.\n\nLemma UM–Y (y-threshold existence via the safe column pivot).\n- Setting. U has a unique maximal m=(X,Y). Let R={y<Y : (X,y)∈U} and S as above. If S≠∅ and R≠∅, define β₂=max R.\n- Claim. Either (i) row β₂ is a singleton (only (X,β₂)∈U), and then Theorem 3 yields a unique type–3 color; or (ii) there exists q∈Max(S) with q_y≥β₂.\n- Proof. If row β₂ has only (X,β₂), then on column X there is exactly one point above (necessarily m), hence Theorem 3 applies. Otherwise pick r=(α,β₂) with α<X; then r∈S. As above, some q∈Max(S) satisfies q≽r, hence q_y≥β₂. ∎\n- Why useful. This supplies the y-threshold needed for Theorem 9 whenever the safe type–3 pivot does not already resolve the instance.\n\nCorollary (two-threshold reduction for unique–maximal).\n- With m, T, R, α₂, β₂ as above. If S=∅, Theorem 8 (row∪column support) applies. If S≠∅, then:\n  • If T≠∅ and the top-row pivot (Theorem 10) fails, there is p_x≥α₂ for some p∈Max(S).\n  • If R≠∅ and the singleton-row pivot (Theorem 3) fails, there is q_y≥β₂ for some q∈Max(S).\n  • If there exists r∈Max(S) with r_x≥α₂ and r_y≥β₂ simultaneously, Theorem 9 applies and yields a unique type–1 color.\n- Interpretation. In the unique-maximal regime, unless a pivot (Theorem 10 or Theorem 3) already certifies uniqueness, we can find one (or two) SW-maximal points meeting the respective x- or y-threshold(s). The remaining unresolved subcase is when x- and y-thresholds are each met but not by the same maximal point. The next step is to convert this “crossing” into a type–2 or type–3/4 certificate (see Next steps).\n\nA robust L-corner variant for 2+2(+…)\n\nLemma RL (two 2-point rows sharing a left endpoint, with clean column, ⇒ unique type 2).\n- Statement. Suppose there exist two distinct rows β_1<β_2 such that: (α,β_i),(γ_i,β_i)∈U with α<γ_i (i=1,2); column α contains exactly these two points (α,β_1),(α,β_2); and on the lower row β:=β_1 there is exactly one point to the right of α (namely (γ_1,β)). Then color (2,α,β) is unique.\n- Proof. By the hypotheses, in column α there is exactly one point above β (namely (α,β_2)), so r_U(α,β)=1; in row β there is exactly one point to the right of α (namely (γ_1,β)), so s_U(α,β)=1. Theorem 1 (type 2) gives uniqueness of (2,α,β). ∎\n- Why useful. This is a safe, verifiable pattern extending the 4-point rectangle subcase to ambient configurations with many other points, provided column α stays clean and the lower row has exactly one extension to the right at α. It is a robust tool within the “two heavy rows” regime.\n\nExamples (sanity checks and edge cases)\n- UM–X in action. U={ (6,8) }∪{ (3,8),(5,8) }∪{ (5,4),(2,1) }. Here m=(6,8), T={3,5}, α₂=5. Column 5 has (5,4), so the top-row pivot fails. Lemma UM–X yields a p∈Max(S) with p_x≥5; indeed p=(5,4)∈Max(S).\n- UM–Y in action. U={ (8,6) }∪{ (8,3),(8,5) }∪{ (4,5),(2,2) }. Here m=(8,6), R={3,5}, β₂=5. Row 5 is not a singleton, so the safe type–3 pivot fails; Lemma UM–Y produces q∈Max(S) with q_y≥5; indeed q=(4,5).\n- RL example. Let U contain rows β_1=1 and β_2=4 with points (2,1),(7,1) and (2,4),(5,4); no other point in column 2. Then (2,2,1) is unique regardless of extra points elsewhere (provided column 2 remains clean and the lower row remains with exactly one right neighbor at 2).\n\nIdeas toward closing the remaining unique–maximal subcase\n- Structure. Let Max(S)={s_1,…,s_k} with x increasing and y decreasing. Under the corollary above, if both T and R are nonempty and neither pivot fires, there exist indices f,g with x(s_f)≥α₂ and y(s_g)≥β₂. If some s_i satisfies both, Theorem 9 finishes. Otherwise f>g, so s_g is “high-but-left” and s_{g+1} is “right-but-low.” This crossing suggests examining the L-corner (x(s_g), y(s_{g+1})). \n- Goal. Prove a dichotomy for this crossing pair: either the L-corner at (x(s_g), y(s_{g+1})) is clean in the sense of Theorem 7 (yielding a unique type–2 color), or one of the “offending” extra points that would inflate r_U or s_U promotes a singleton+extension (Theorem 3) or a row-of-two global trigger (R4) on some row/column. The technical task is to pin down a nearest-neighbor variant that ensures any additional contributor on the vertical (resp. horizontal) segment forces one of the safe type–3/4 triggers.\n- Plan. For the vertical ray at x(s_g), pick the lowest y′>y(s_{g+1}) with (x(s_g),y′)∈U (this is either y′=y(s_g) or the nearest interloper). If y′≠y(s_g), then s_g remains maximal but row y′ is an “offender” below Y. We will analyze whether row y′ is singleton (Theorem 3), forms a 2-point row with globally unique left endpoint (R4), or can be paired with a clean column to create an RL-type L-corner. A symmetric analysis applies to the horizontal ray from (x(s_g), y(s_{g+1})).\n\nObstacles and why some direct attempts fail\n- A tempting but false shortcut is to assume that the first crossing pair (s_g,s_{g+1}) automatically yields r_U=s_U=1 at (x(s_g), y(s_{g+1})). This fails because additional points on the vertical segment x=x(s_g) with y∈(y(s_{g+1}),y(s_g)) are compatible with s_g being maximal yet increase r_U. Hence additional structure (nearest-neighbor selection plus type–3/4 triggers) is needed.\n\nNext steps (concrete and checkable)\n1) Formalize the “nearest-neighbor offender ⇒ type–3/4 trigger” argument sketched above for the crossing pair (s_g,s_{g+1}). The desired lemma: among the lowest vertical/horizontal interlopers at a crossing, at least one induces a singleton+extension (Theorem 3) or a row-of-two with a globally unique base (R4), hence a unique type–3/4 color.\n2) Package UM–X, UM–Y, and the crossing analysis into a complete proof of “unique maximal ⇒ unique color,” yielding a new theorem to curate.\n3) Extend RL to a symmetric “clean-row” variant (two 2-point columns sharing a lower endpoint with a clean row ⇒ unique type 2) and add these as safe triggers to the library.\n4) Stress-test on crafted worst-case “staircase with fillers” examples to validate the nearest-neighbor lemma and to calibrate the cleanliness conditions needed for Theorem 7 vs. type–3/4 triggers.\n\nWhy this is progress\n- UM–X and UM–Y convert the abstract unique–maximal regime into a finite, verifiable checklist of pivots and thresholds, isolating the only remaining hard subcase (crossing without a single maximal hitting both thresholds). The RL lemma strengthens our catalog of robust, local uniqueness certificates applicable amidst additional points. The next-step plan is precise: prove a nearest-neighbor lemma at the crossing to finish the unique–maximal case."
}