{
  "progress_md": "Headlines\n- New extremal inequality: for any K-subset S⊆{1,…,N}, one has Σ_{i∈S} 2^{v_2(i)} ≤ N·H_K (H_K the K-th harmonic number). This sharpens and formalizes the 2-adic summation bound needed in Corollary 6.1 and yields Σ_j Decrease_j/B_j(A_0) ≤ O(log(n/L)) in equal-scale steps with ≤ n/L pairs.\n- Geometric-window weights (first-step from A_0): for any fixed scale L=2^ℓ and any step (no alignment assumed) whose changed-index set is S, define a_j(L):=β^{| (d−1−j) − ℓ |}/2^{j+1} with β∈(0,1/2). Then Σ_j a_j(L)·Decrease_j ≤ C_β·(L/n)·|S|. In particular, for equal-scale steps with m pairs (hence |S|≤3m≤3n/L), one gets Σ_j a_j(L)·Decrease_j ≤ 3C_β = O(1). This gives an O(1) per-step cap on a scale-focused, cross-level weighted decrease from the bit-reversal start.\n\nGaps or corrections in output.md to flag\n- The current output already contains Theorem 8 (large-scale weighted decrease bound) and Lemma 7.2 (sub-run decrease bound), both correct. There is, however, still no curated bound of the form Σ_{i∈S}2^{v_2(i)} in terms of |S|. I recommend adding the extremal bound below as a lemma; it is used implicitly in several sketches and enables a clean derivation of Σ_j Decrease_j/B_j(A_0) ≤ O(log(n/L)).\n- The program still lacks any signed, cross-level per-step bound that applies beyond the first step (once A deviates from A_0). The geometric-window lemma below is first-step specific (it uses T_j(A_0)=G_j) and cannot be applied verbatim after the array evolves.\n\nNew technical lemmas (ready to curate)\n1) Extremal 2-adic sum bound.\nLemma. Let N≥1 and S⊆{1,…,N} with |S|=K≥1. Then Σ_{i∈S} 2^{v_2(i)} ≤ N·H_K, where H_K=1+1/2+⋯+1/K.\nProof. Order the weights w(i):=2^{v_2(i)} for i∈{1,…,N} in nonincreasing order s_1≥s_2≥⋯≥s_N. For t≥0, at most ⌊N/2^t⌋ integers have v_2≥t, i.e., at most ⌊N/2^t⌋ weights are ≥2^t. Hence for every ℓ≥1, s_ℓ ≤ max{2^t : N/2^t ≥ ℓ} ≤ N/ℓ. Therefore Σ_{i∈S} 2^{v_2(i)} ≤ Σ_{ℓ=1}^K s_ℓ ≤ Σ_{ℓ=1}^K (N/ℓ) = N·H_K.∎\nCorollary (small-scale fractional decreases, coarse but general). For A=A_0, any step with changed-index set S (|S|=K) satisfies\nΣ_{j=0}^{d−1} Decrease_j/B_j(A_0) = Σ_j 2^{−(j+1)}·Decrease_j ≤ (2/n)·Σ_{i∈S} 2^{v_2(i)} ≤ 2·H_K.\nIn particular, in an equal-scale step with m pairs (hence K≤3m≤3n/L), Σ_j Decrease_j/B_j(A_0) ≤ O(log(n/L)).\nWhy useful: This fully rigorous bound replaces the previously sketched Inequality 2 with a clean, general estimate (though without the extra 1/L factor). It confirms that, in aggregate and relative to B_j(A_0), only logarithmic-in-(n/L) fractional shrinkage can be achieved across all levels in an equal-scale step.\n\n2) Geometric-window weighted cross-level decrease (first step from A_0).\nLemma (geometric window). Fix L=2^ℓ and pick any β∈(0,1/2). Define scale-centered weights a_j(L):=β^{| (d−1−j) − ℓ |}/2^{j+1}. For A=A_0 and any one-step change with index set S,\nΣ_{j=0}^{d−1} a_j(L)·Decrease_j ≤ C_β·(L/n)·|S|,\nwhere C_β := (1/(1−β/2) + 1/(1−2β)). In particular, for equal-scale steps with m pairs one has Σ_j a_j(L)·Decrease_j ≤ 3C_β=O(1).\nProof. By toggle-locality and Theorem 6 (weighted form at A_0),\nΣ_j a_j(L)·Decrease_j ≤ Σ_{i∈S} Σ_{j: i∈G_j} a_j(L).\nFor i with v_2(i)=t, the inner sum ranges over j with s:=d−1−j∈{0,1,…,t} and equals\nΣ_{s=0}^{t} β^{|s−ℓ|}·2^{s−d} = 2^{−d}·(Σ_{s=0}^{ℓ} β^{ℓ−s}2^{s} + Σ_{s=ℓ}^{t} β^{s−ℓ}2^{s}).\nBound the two parts separately: Σ_{s=0}^{ℓ} β^{ℓ−s}2^{s} = 2^{ℓ}·Σ_{r=0}^{ℓ} (β/2)^r ≤ 2^{ℓ}/(1−β/2), and Σ_{s=ℓ}^{t} β^{s−ℓ}2^{s} = 2^{ℓ}·Σ_{r=0}^{t−ℓ} (2β)^r ≤ 2^{ℓ}/(1−2β). Thus, Σ_{j: i∈G_j} a_j(L) ≤ C_β·2^{ℓ−d} = C_β·(L/n). Summing over i∈S gives the claim; using |S|≤3m and m≤n/L (equal-scale) yields the O(1) consequence.∎\nRemarks.\n- Crucially, this does not assume any alignment; it is purely a first-step property from A_0. It precisely formalizes the “home scale” phenomenon: pairs with total size ≈L can only induce O(1) total weighted decreases when measured by a geometric window centered at that scale.\n- The choice of β<1/2 ensures the tail beyond the home scale decays sufficiently quickly (the 2β factor in the upper tail), giving a per-index constant bound.\n\nHow these help and their limits\n- The extremal 2-adic bound plus Corollary cleanly upper bound aggregate relative decreases across all levels by O(log(n/L)) in an equal-scale step. While not strong enough alone for an O(1) per-step drop of the unweighted potential, it quantifies a strict trade-off for small scales.\n- The geometric-window lemma provides an O(1) per-step cap for a family of scale-focused, cross-level weighted potentials at the bit-reversal start. This is the first rigorous cross-level scarcity result that is scale-sensitive and constant per equal-scale step.\n- Limitation: Both statements rely on A=A_0. After the first step, the boundary sets T_j(A) are no longer dyadic grids, so Theorem 6 cannot be applied directly. Extending the geometric-window argument beyond the first step requires new structure (e.g., showing that after a near-L step from A_0 the sets T_j(A) retain enough arithmetic regularity at scales ≈L to re-run the argument, or developing a signed, per-index cancellation bound that is independent of A).\n\nSanity checks and examples\n- n=16, L=4 (ℓ=2), β=1/4. In a step of 4-block pairs (m≤4), we have |S|≤12 and L/n=1/4, hence Σ_j a_j(L)·Decrease_j ≤ C_β·(1/4)·12 = O(1). Empirically, the only levels with noticeable (unweighted) decreases are those with L_j∈{2,4,8} (adjacent to L), consistent with “home-scale” concentration.\n- For L=1 (singletons paired), the geometric-window lemma still bounds the windowed decrease by O(1), despite the possibility that Θ(log n) levels see constant-factor unweighted changes. This illustrates the necessity of scale-sensitive weights.\n\nObstacles\n- The geometric-window lemma is “first-step only.” Without a characterization of T_j(A) after a step, we cannot iterate the bound. A naive attempt to keep measuring against G_j (of A_0) does not telescope to a lower bound on sorting time.\n- The extremal bound yields only O(log(n/L)) control on Σ_j Decrease_j/B_j(A_0); taken over Θ(log n) scales this still gives merely Ω(log n) steps for the unweighted potential.\n- A signed cross-level inequality (bounding a weighted combination of decreases and increases that correlates with |log B_j−(d−j)|) remains open. The Hamming-sum identity suggests such cancellation might be possible with carefully chosen weights, but a precise bound is not yet proved.\n\nNext steps (actionable)\n1) Curate the extremal 2-adic bound and the geometric-window lemma into output.md (after verifier checks), as they are exact and broadly useful.\n2) Search for persistence of arithmetic regularity: After an equal-scale step from A_0 at scale L, characterize T_j(A) for j with L_j≈L. Goal: show these boundary sets are unions of a bounded number of arithmetic progressions with large modulus, enabling a rerun of the geometric-window argument at the next step.\n3) Signed per-index inequality: For a single changed index i (arbitrary A), analyze the vector over j of contributions to B_j(A′)−B_j(A) via HD_{A′}(i)−HD_A(i). Try weights of the form a_j(L)=γ^{| (d−1−j) − ℓ |}/2^{j+1} with γ<1/2 and prove Σ_j a_j(L)·(B_j(A′)−B_j(A)) ≤ O(L/n) uniformly in A. This would extend the geometric-window lemma beyond A_0.\n4) Restricted-phase milestone: Under the equal-scale assumption per phase, define a phase potential Ψ_L(A):=Σ_j β^{|log_2 L_j−log_2 L|}·|log_2 B_j(A)−(d−j)| and prove an O(1) drop per phase from A_0 using the geometric-window lemma (for the “decrease-needed” half) together with a symmetric variant for increases. This would yield Ω(log^2 n) steps for the restricted model.\n5) Case analysis for per-pair decreases: Classify the six-bit patterns (a_L,L_1,L_k,R_1,R_m,a_R) that yield Δ_pair(j)<0 and quantify when the inner boundary must coincide with a current j-boundary. This may lead to a “central-boundary demand” lemma needed to control decreases when T_j(A) has partial regularity.\n\nWhy this is progress\n- The extremal 2-adic inequality closes a missing technical gap and makes several prior sketches rigorous.\n- The geometric-window lemma is a genuinely new, constant-per-step cross-level bound (albeit for the first step), capturing scale-locality in a quantitative way. It provides a clear template for the type of weighting that could ultimately yield an Ω(log^2 n) lower bound via an O(1) per-phase drop argument.\n"
}