{
  "content": "Scope. We work under Conjecture 7.2: U(ℤ[q]^ℕ) = {±q^i | i ∈ ℤ}. I record rigorously proven pieces, a correction to a claim in the notes, and a couple of new constraints that sharpen the search for a proof.\n\nIdeas\n- Solidify and formalize the Laurent-polynomial case: if g ∈ ℤ[q,q^{-1}] is a Habiro-unit, then g = ±q^i. This eliminates a large class of potential counterexamples and yields γ_m non-units immediately.\n- Record a “determinant (resultant) identity” for units modulo q^n−1: ∏_{ζ^n=1} u(ζ) = ±1. This gives global algebraic constraints on the values u(ζ).\n- Correct a subtlety in the p-adic “uniform truncation” claim: while (q)_n(ζ_{p^a})=0 for n≥p^a, there is no p-adic uniform-in-a lower bound on v_p((ζ_{p^a})_n) for fixed n. This affects strategies relying on uniform p-adic tails.\n- Reduction-of-goal lemma: if u(ζ)=±ζ^i for infinitely many distinct ζ of prime-power order (not necessarily all primitive roots at a given level), then u=±q^i (via τ-injectivity on an infinite set).\n\nRigorous proofs (to include in proofs.md)\n\nProposition A (Laurent-polynomial Habiro-units are monomials). If g ∈ ℤ[q,q^{-1}] is a unit in ℤ[q]^ℕ, then g = ± q^i.\nProof. Choose t so that h(q) := q^t g(q) ∈ ℤ[q] is a nonzero polynomial with at least two nonzero coefficients (otherwise g=±q^i). Since q is a unit in ℤ[q]^ℕ (Prop. 6 of the paper), h is a unit in ℤ[q]^ℕ. If h(1) ∉ {±1} or h(−1) ∉ {±1}, then by evaluation (Lemma 1 below) h maps to a nonunit in ℤ or ℤ respectively, contradiction. Thus assume h(1), h(−1) ∈ {±1}. Pick a prime r with r ∤ h(0). For large integer R, set x=R; then |h(x)|>1 and h(x) ≡ h(0) (mod r), so r ∤ h(x). Let p be any prime divisor of h(x). Reduce mod p: in 𝔽_p, α := x mod p is a nonzero root of h, hence ord(α)=n divides p−1. Then Φ_n(α)≡0, so h and Φ_n are not coprime modulo p. Therefore the image of h in ℤ[q]/(Φ_n(q)) maps to 0 in 𝔽_p[q]/(Φ_n), and hence is not a unit in ℤ[q]/(Φ_n(q)). But units in ℤ[q]^ℕ project to units in every ℤ[q]/(f) in the defining inverse system, contradiction. Hence g=±q^i.\n\nCorollary B (Alternating sums are not units). For odd m≥3, γ_m(q):=∑_{i=0}^{m−1}(−1)^i q^i ∉ U(ℤ[q]^ℕ).\nProof 1. γ_m(−1)=m≠±1, so γ_m cannot be a unit by Lemma 1. Proof 2. Alternatively, Proposition A applies since γ_m∉{±q^i}.\n\nLemma 1 (Evaluation preserves units). For ζ a root of unity, ev_ζ: ℤ[q]^ℕ → ℤ[ζ] is a ring homomorphism. Hence u ∈ U(ℤ[q]^ℕ) ⇒ u(ζ) ∈ U(ℤ[ζ]). In particular u(±1)∈{±1}.\nProof. Evaluation is a component of τ, which is a ring homomorphism; homomorphisms send units to units.\n\nLemma 2 (Torsion units are trivial). If u^m=1 in ℤ[q]^ℕ, then u=±1.\nProof. Embed ℤ[q]^ℕ ↪ ℤ[[q−1]] (Theorem 13). In ℤ[[q−1]] write v=σ(u)=c(1+a), c∈{±1}, a∈(q−1)ℤ[[q−1]]. If c=1, passing to ℚ[[q−1]] gives 0=log(v^m)=m log v ⇒ v=1. If c=−1, then (−1)^m(1+a)^m=1; if m odd, impossible; if m even, (1+a)^m=1 ⇒ v=−1. Pull back via injectivity.\n\nProposition C (Determinant/Resultant identity). For each n≥1 and u∈U(ℤ[q]^ℕ), one has\n∏_{ζ^n=1} u(ζ) = ±1.\nProof. Consider multiplication-by-u on the free ℤ-module ℤ[q]/(q^n−1) of rank n. The determinant is an integer and equals the product over the complex eigenvalues of this ℤ-linear map, i.e., ∏_{ζ^n=1} u(ζ). Since u maps to a unit in ℤ[q]/(q^n−1), this ℤ-linear map is invertible, and its determinant is ±1.\n\nProposition D (Rigidity from infinitely many exact matches). If u ∈ U(ℤ[q]^ℕ), and there exist i∈ℤ and an infinite set Z of roots of unity that contains infinitely many of prime-power order such that u(ζ)=±ζ^i for all ζ∈Z, then u=±q^i.\nProof. Let w=(±)q^{−i}u; then w(ζ)=1 for ζ∈Z. By Theorem 2 (injectivity of τ over infinite sets with infinitely many prime powers), w=1.\n\nCorrection to a claim in Notes (uniform truncation)\n- The statement “for any r≥1 there is N(r) with v_𝔭((ζ)_n)≥r for all n≥N(r), uniformly in a” is false in the normalization v_𝔭(p)=1. In ℚ_p(ζ_{p^a}), one has v_p(ζ_{p^a}−1)=1/((p−1)p^{a−1}); thus v_p((ζ_{p^a})_n)=∑_{k≤n} v_p(ζ_{p^a}^k−1)≈ n·v_p(ζ_{p^a}−1)+O(log n). As a increases, v_p(ζ_{p^a}−1) decreases, so no uniform (in a) lower bound can hold for fixed n. The correct and very useful truncation is exact: (ζ_{p^a})_n=0 for n≥p^a, so u(ζ_{p^a}) depends only on the finitely many coefficients a_0,…,a_{p^a−1} in the Habiro expansion u=∑ a_n (q)_n.\n\nTwo immediate consequences (useful constraints)\n- Reduction-of-goal lemma. To prove u=±q^i, it suffices to find a fixed i and infinitely many distinct roots ζ of prime-power order such that u(ζ)=±ζ^i (then apply Proposition D). Equivalently (by Theorem 17’s injectivity of ρ^ℤ_{ℕ,S′} for any nonempty S′), it also suffices to find a prime p and infinitely many a with u≡±q^i (mod Φ_{p^a}).\n- Determinant constraint (Proposition C) indicates that for each n and any rational prime p, the multiset {u(ζ): ζ^n=1} cannot all lie in the maximal ideal above p in every cyclotomic component simultaneously. While not yet yielding exact matches, this rules out certain “too p-adically small” behavior across all ζ of a fixed order.\n\nExamples/tests\n- Two-term Laurent polynomials. g(q)=aq^r+bq^s with |a|+|b|≥2: Lemma 1 forces g(±1)∈{±1}, which fails unless g=±q^k.\n- Alternating sums γ_m. γ_m(−1)=m for odd m≥3, hence non-unit; alternative: γ_m(ζ_p)=2/(1+ζ_p) (non-unit) if p|m, p odd.\n\nObstacles\n- Upgrading the congruences u(ζ_{p^a}) ≡ u(1) (mod p) to exact equalities u(ζ_{p^a})=±ζ_{p^a}^i for infinitely many a remains the bottleneck. As noted, uniform p-adic tail control across a is unavailable.\n- A plausible analytic path uses the embedding ℤ[q]^ℕ ↪ ℤ_p[[q−1]]. For v=(±)q^{−i}u with v(1)=1, write v(q)=h(q−1) with h∈1+Tℤ_p[[T]]. If one can show h(ζ_{p^a}−1)=1 for infinitely many a, then Strassman’s theorem forces h≡1 and hence u=±q^i. The missing piece is a mechanism guaranteeing infinitely many such exact equalities along the μ_{p^∞} tower.\n\nNext steps\n- Exploit towers modulo (p,Φ_{p^a}). Study the projective system R_a=ℤ[q]/(Φ_{p^a}(q)) and the images of u therein; attempt to show stabilization u≡±q^i for infinitely many a (e.g., via lifting from level a to a+1 under suitable derivative/nondegeneracy conditions). A successful criterion here, even for one fixed p, would resolve the conjecture via Proposition D.\n- Strengthen determinant constraints: For fixed n, analyze the valuations of ∏_{ζ^n=1} (u(ζ)/±ζ^i) using Prop. C to force many exact matches; seek a combinatorial/p-adic pigeonhole across varying n.\n- Record and formalize the above Proposition A–D and the correction to uniform truncation in proofs.md; add the determinant identity as a reusable lemma.\n"
}