{
  "progress_md": "Round 0006 — audit, small lemmas, optimizations, and checks\n\nSummary of what is already solid in output.md\n- Core r=1 machinery is in place: (i) base cases k=1→2, 2→3, 3→4 and the general append-one-bit recurrence; (ii) congruence under append (without carrying the leftmost input bit); (iii) concatenation for k_flag≥4 and, more importantly, for all k_flag; (iv) associativity; (v) a clean NEXPTIME preprocessing (enumerate Types via δ) and Stage-1 trichotomy (o(n) iff a feasible f exists) with both directions proved; (vi) pumping lemmas with ℓ_pump := |T|; (vii) a counterexample to R-composition; (viii) an O(β^6) concatenation routine.\n\nGaps and minor clarifications spotted in output.md\n- δ base case for k_flag=1 (Proposition 9): it currently says “input bit inside τ is b (implicitly recoverable as A_b = {x : (x,x,x,x) ∈ Ext_τ})”. The proof does not need the bit b, only the set S_τ := {x : (x,x,x,x) ∈ Ext_τ}. Suggest stating the k=1→2 update directly in terms of S_τ rather than referring to a recovered b. This also cleanly covers the degenerate case A_0 = A_1 where b is not uniquely identifiable but S_τ still determines the update.\n- End segments in the Stage-1 (⇐) construction: the proof handles “middle blocks” between two separators. Paths have endpoints; these produce one-sided blocks adjoining a single separator. A short lemma (provided below) showing how to fill endpoints from Ext without the right/left seam removes any doubt.\n- Optional but helpful: document a faster append-one-bit update (O(β^4) instead of O(β^5)) via 3D slices, analogous to the O(β^6) concatenation optimization.\n- Quantifier economy in Stage-1 verification: the universal check can be reformulated to range over the sets of attainable α_L, α_R values induced by f, eliminating explicit quantification over τ_a, τ_d (details below). While worst-case complexity is not asymptotically improved, the reformulation reduces constant factors and clarifies intent.\n\nLemma A — δ base case k_flag=1 can be stated without “recovering b”\nStatement.\n- Let τ be a Type with k_flag(τ)=1 and Ext_τ given. Define S_τ := {x ∈ Σ_out : (x,x,x,x) ∈ Ext_τ}. For any appended bit a, Ext_{δ(τ,a)} consists exactly of the tuples (x1,x2,x3,x4) with x1=x3, x2=x4, x1∈S_τ, x2∈A_a and E(x1,x2).\nWhy useful here.\n- Removes the (unneeded) reference to the internal input bit and works uniformly even when A_0=A_1.\nSketch proof.\n- Immediate from Proposition 6 by observing that Ext_{(b)} encodes A_b as S_τ.\n\nLemma B — Endpoint completion in Stage-1 (⇐)\nStatement.\n- In the Stage-1 construction with separators spaced by K=ℓ_pump+4, the remaining end segments (from a path endpoint to the nearest separator) admit a legal completion consistent with the separator’s seam color. Concretely, suppose the right endpoint of a block has seam color α_R (first output of the separator just to its right). Let P be the (one-sided) left block. There exists a labeling of P whose rightmost color o4 and last-but-one o3 yield a quadruple (o1,o2,o3,o4)∈Ext_P with E(o4, α_R). A symmetric claim holds for right blocks with a left seam α_L.\nWhy useful here.\n- Closes the small gap in the Stage-1 (⇐) proof for finite directed paths.\nSketch proof.\n- If the block length ≤ 2K−2, the Type of P is long. Consider Ext_P and the set End(P):={o4 : ∃(o1,o2,o3,o4)∈Ext_P}. Since A,E guarantee at least one legal labeling on any finite input segment encountered during δ-enumeration, Ext_P≠∅. If there exists o4∈End(P) with E(o4, α_R), any witnessing quadruple completes the block. If no such o4 exists, then Ext_{P·Q} would be empty for any right context Q starting with α_R, contradicting that the actual global instance is solvable (the separator labeling is chosen from a feasible f). This contradiction formalizes by taking Q to be the actual right context used in the construction and invoking Lemma 11.\n\nLemma C — Quantifier minimization for the feasible-function check\nStatement.\n- Given a guessed f: T_long×{0,1}^2×T_long→Σ_out^2, define for each τ_b and s∈{0,1}^2:\n  OutR2(τ_b,s) := { second(f(τ_a,s,τ_b)) : τ_a ∈ T_long };\n  and for each τ_c and s′: OutL1(τ_c,s′) := { first(f(τ_c,s′,τ_d)) : τ_d ∈ T_long }.\n- The universal extendibility clause in Theorem 15 is equivalent to: for all τ_b,τ_c and s1,s2, and for all α_L ∈ OutR2(τ_b,s1), α_R ∈ OutL1(τ_c,s2), there exists (o1,o2,o3,o4) ∈ Ext_{τ_b⊙τ_c} with E(α_L,o1), E(o4,α_R).\nWhy useful here.\n- Eliminates explicit quantification over τ_a, τ_d in verification, reducing the number of cases and clarifying that only the sets of attainable seam colors matter.\nSketch proof.\n- “Only if” is tautological: α_L, α_R in the original clause range over exactly these sets. “If” follows by instantiating α_L, α_R with the values arising from some τ_a, τ_d.\nImplementation tip.\n- After guessing f, precompute the sets OutR2 and OutL1 (sizes ≤|Σ_out| each) and reduce the verification loops accordingly.\n\nOptimization — O(β^4) append update via slices\nObservation.\n- For k_flag≥4, (x1,x2,x3,x4) ∈ Ext_{t·a} iff x4∈A_a ∧ E(x3,x4) ∧ Left3_t[x1,x2,x3], where Left3_t[x1,x2,x3] := ∃z (x1,x2,z,x3)∈Ext_t.\nRoutine.\n- Precompute Left3_t (a β×β×β boolean tensor) in O(β^4) time. Then fill Ext_{t·a} by scanning all (x1,x2,x3) and for each, iterate neighbors x4 with E(x3,x4) and x4∈A_a, setting Ext_{t·a}[x1,x2,x3,x4]←true. This costs O(β^4 + β^3·Δ), where Δ is the max out-degree in E (Δ≤β), i.e., O(β^4) in dense worst-case.\nWhy useful here.\n- Brings append down from O(β^5) to O(β^4), improving the preprocessing constants while preserving single-exponential bounds overall.\n\nImplementation detail — Precompute seam-feasibility matrices W_{b⊙c}\nStatement.\n- For each pair (τ_b, τ_c), define a β×β boolean matrix W_{b⊙c}[α_L][α_R] that is true iff ∃(o1,o2,o3,o4)∈Ext_{τ_b⊙τ_c} with E(α_L,o1) and E(o4,α_R). Using the Left/Right 3D slices for τ_b⊙τ_c, W can be computed in O(β^4·Δ^2) or faster with sparse E.\nWhy useful here.\n- Stage-1 verification reduces to testing W_{b⊙c}[α_L][α_R] for α_L∈OutR2(τ_b,s1), α_R∈OutL1(τ_c,s2). This removes any per-case scanning over tuples in Ext during verification (all heavy work moved to preprocessing).\n\nSanity checks and small examples\n- Equality LCL (E={(x,x)}; A_0=A_1=Σ_out). Types collapse quickly; Ext_t contains only quadruples with equal coordinates per k_flag. Stage-1: OutR2=OutL1=Σ_out; concatenation Ext_{τ_b⊙τ_c} permits any α with E(α,α), so any f that outputs equal pairs is feasible. End segments are trivial by Lemma B.\n- Proper 2-coloring (Σ_out={a,b}, A_0=A_1=Σ_out, E forbids equal). Stage-1: feasible f exists (standard Θ(log* n)); verification with W_{b⊙c} succeeds for an appropriate f (alternating outputs), but the Stage-2 certificate is impossible (as noted earlier).\n- Degenerate A_0=A_1: δ base-case k=1 works with S_τ (Lemma A); seeds (0) and (1) merge to the same Type, which is intended.\n\nObstacles and caveats\n- Lemma B’s endpoint argument uses the fact that a feasible f exists (we are in the (⇐) direction); the nonemptiness of End(P)∩E^{-1}(α_R) is thus reduced to the existence of a global legal labeling and Lemma 11. This logical dependency should be stated explicitly when integrating Lemma B.\n- Quantifier minimization (Lemma C) does not asymptotically improve worst-case verification time, but it separates concerns and simplifies implementation.\n\nConcrete next steps (actionable)\n1) Amend Proposition 9 to remove references to the internal bit b for k_flag=1 and use S_τ explicitly; mention this in the k=1→2 update description.\n2) Add Lemma B to output.md to explicitly cover endpoint completion in the Stage-1 (⇐) proof; a short paragraph suffices.\n3) Add the O(β^4) append optimization as a proposition parallel to Proposition 5 (concatenation optimization) for completeness.\n4) Optionally incorporate Lemma C’s reformulation into the Stage-1 verification corollary, and mention the W_{b⊙c} precomputation trick.\n5) Continue toward Stage-2: either supply the constant-radius partition lemma for oriented paths (with parameters and a self-contained proof) or redesign the constant-time certificate to avoid periodicity. Until then, keep Stage-2 out of output.md.\n\nAppend-only regression checklist\n- For random Σ_out up to size 3, verify: (i) O(β^4) append matches the O(β^5) brute force; (ii) Ext-concatenation associativity; (iii) W_{b⊙c} agrees with direct scanning of Ext_{τ_b⊙τ_c}; (iv) Stage-1 acceptance on equality LCL and rejection on instances known to be Ω(n).\n"
}