{
  "content": "# Project framing\n\nWith no specific task provided yet, I propose to develop an additive-combinatorics thread focused on sumset growth and extremal structure in abelian groups. The immediate, incremental goals are:\n\n- Baseline inequalities for |A + B| in Z and Z/pZ.\n- Equality characterization in the integer case, and a nontrivial characterization in Z/pZ when one set has size 2.\n- Small examples and counterexamples illustrating the role of periodicity.\n- Next steps toward Vosper’s theorem and Kneser’s theorem via special cases.\n\nIdeas\n\n- Start from the 1D integer inequality |A + B| ≥ |A| + |B| − 1 and record a clean equality characterization: arithmetic progressions with a common difference.\n- Lift to Z/pZ: special structure when |B| = 2 using a simple graph-on-a-cycle argument.\n- Use examples in composite modulus to motivate Kneser’s theorem and the need for period/stabilizer.\n\nResults and proofs\n\nLemma 1 (Integer sumset bound)\nLet A, B be finite nonempty subsets of Z. Then |A + B| ≥ |A| + |B| − 1.\n\nProof.\nWrite A = {a1 < … < am}, B = {b1 < … < bn}. Consider the m + n − 1 sums\nS = {a1 + b1, a1 + b2, …, a1 + bn, a2 + bn, a3 + bn, …, am + bn}.\nWithin each of the two subsequences, sums strictly increase. Also, a2 + bn > a1 + bn, so all m + n − 1 displayed sums are pairwise distinct. Hence |A + B| ≥ |S| = m + n − 1. ∎\n\nProposition 2 (Equality case in Z)\nWith A, B as above, equality |A + B| = |A| + |B| − 1 holds if and only if A and B are arithmetic progressions with a common difference.\n\nProof.\nThe “if” direction is clear: sums of two APs with the same common difference form an AP of length |A| + |B| − 1.\nFor “only if,” suppose equality holds. Then the set A + B is exactly S from the proof above; in particular, no “interior” sum a_i + b_j with 2 ≤ i ≤ m and 1 ≤ j ≤ n − 1 can be new. Thus for each such (i, j) we must have a_i + b_j = a_{i−1} + b_{j+1}. Hence a_i − a_{i−1} = b_{j+1} − b_j. Fixing j = 1 yields a_i − a_{i−1} = b_2 − b_1 for all 2 ≤ i ≤ m, so A is an AP with difference d := b_2 − b_1. Fixing i = 2 yields b_{j+1} − b_j = a_2 − a_1 = d for all 1 ≤ j ≤ n − 1, so B is an AP with the same difference. ∎\n\nRemark. Proposition 2 can be seen as a 2k − 1 case of Freiman-type structure in Z.\n\nProposition 3 (Prime cyclic group, two-point B)\nLet p be prime, A ⊆ Z/pZ finite and nonempty, and let B = {x, x + d} with d ≠ 0. Then\n- Cauchy–Davenport gives |A + B| ≥ min(p, |A| + |B| − 1) = min(p, |A| + 1).\n- If |A + B| = |A| + 1 < p, then A is a non-wrapping arithmetic progression with common difference d, i.e., A = {a, a + d, …, a + (|A| − 1)d}.\n\nProof.\nBy translation, assume x = 0, so B = {0, d}. Then A + B = A ∪ (A + d), and\n|A + B| = |A| + |A + d| − |A ∩ (A + d)| = 2|A| − |A ∩ (A + d)|.\nIf |A + B| = |A| + 1 < p, then |A ∩ (A + d)| = |A| − 1.\nConsider the directed cycle on Z/pZ with edges y → y + d. The number of edges with both endpoints in A is |A ∩ (A + d)|. In the subgraph induced by A, each component is a directed path (since cycles would require |A| = p). The number of edges in a disjoint union of paths on m vertices equals m minus the number of path components. Hence |A ∩ (A + d)| ≤ |A| − 1, with equality if and only if the induced subgraph is a single path. This means A consists of |A| consecutive vertices along the d-edges, i.e., an arithmetic progression with common difference d and no wrap-around. ∎\n\nExamples\n\n- Tightness in Z: A = {0, 3, 7}, B = {1, 4}. Then |A + B| = 5 = |A| + |B| − 1; A and B are APs with common difference 3.\n- Composite modulus shows need for periodicity: In Z/6Z let A = {0, 3}, B = {0, 3}. Then A + B = {0, 3} has size 2, but |A| + |B| − 1 = 3. This illustrates failure of the integer lower bound in groups with nontrivial stabilizers (here H = {0, 3}). Kneser’s theorem predicts |A + B| ≥ |A| + |B| − |H| = 2, with equality here.\n\nObstacles and context\n\n- For general A, B ⊆ Z/pZ with |A + B| = |A| + |B| − 1 < p, the full equality characterization is Vosper’s theorem: both are arithmetic progressions with a common difference. Proving this in full requires more machinery (e.g., Dyson’s transform, isoperimetry, or Hamidoune’s methods).\n- For general abelian groups, Kneser’s theorem governs the role of the stabilizer H of A + B: |A + B| ≥ |A| + |B| − |H|, with equality cases structured by periodicity. Our examples show the necessity of |H|.\n\nNext steps\n\n- Prove Cauchy–Davenport rigorously (e.g., Dyson’s transform or the polynomial method) for completeness.\n- Extend Proposition 3 to |B| = 3 in Z/pZ and characterize near-equality.\n- Introduce Kneser’s theorem and prove selected special cases (e.g., when A + B is aperiodic) to bridge integer and cyclic settings.\n- Begin stability: quantify how close to an AP A and B must be if |A + B| ≤ |A| + |B| − 1 + ε min(|A|, |B|).\n\nChecks the verifier can run\n\n- Reproduce the proof of Lemma 1 and Proposition 2; test on random finite A, B in Z by computing |A + B| and verifying equality characterizations numerically for small cases.\n- In Z/pZ, test Proposition 3 by enumerating A, d, and checking that |A + {0, d}| = |A| + 1 occurs precisely for non-wrapping d-progressions.\n\nPotential literature pointers (for future rounds)\n\n- Tao & Vu, Additive Combinatorics, for Cauchy–Davenport, Vosper, and Kneser.\n- Hamidoune’s isoperimetric method for additive number theory.\n- Dyson’s transform for sumsets in Z/pZ.\n"
}