{
  "content": "Ideas\n- Consolidate and formalize the core structural lemmas flagged by the verifier: link cycles, K4-free, local Helly-type intersections, and the two families of large cliques in kG (vertex-stars T(v) and the 4-cliques N(t) around an interior face with three interior edges). These will be building blocks for a classification of maximal cliques of kG.\n- Prove rigorously that N(t) is a maximal K4 in kG using only K4-freeness of the primal and the Whitney property (every 3-cycle is a face). This directly corrects the “local Helly” overstatement noted previously.\n- Establish T(v) maximality for interior vertices (deg ≥ 4). This gives a lower bound ω(kG) ≥ max{4, max_deg_int} and a clean catalogue of maximal cliques in many instances.\n- Prepare a precise, local classification theorem for maximal cliques that contain a pair of faces sharing an interior edge: such maximal cliques are exactly T(u), T(v), or N(t). This provides a tractable description where “non-star” maximal cliques arise.\n\nRigorous proofs and lemmas\nLemma 1 (K4-freeness for disk Whitney triangulations). Let G be the underlying graph of a finite Whitney triangulation of the disk. Then G is K4-free.\nProof. Suppose G contains K4 on X={a,b,c,d}. The four 3-cycles on X are all faces by the Whitney property, and each edge of the K4 lies in exactly two of these faces. Hence the union of these four faces is a closed 2-dimensional subcomplex with empty boundary embedded in the disk. This is impossible because a nonempty closed 2-subcomplex cannot be a subcomplex of a disk triangulation (the disk has nonempty boundary and contains no closed 2-manifold component). Contradiction. ∎\n\nLemma 2 (Link of an interior vertex is a chordless cycle). Let v be an interior vertex of a Whitney triangulation of the disk. Then the induced subgraph on N(v) is a cycle and has no chords.\nProof. The faces incident to v, in cyclic order around v, are exactly the triangles of the form {v, w_i, w_{i+1}} where the neighbors of v are w_1,…,w_d in planar cyclic order. Thus edges w_iw_{i+1} exist for each i (indices mod d), and N(v) induces a cycle C_d. If there were a chord w_iw_j with j∉{i±1}, then the 3-cycle on {v,w_i,w_j} would exist and, by Whitney, be a face. That face and the two faces {v, w_{i-1}, w_i} and {v, w_i, w_{i+1}} would put the interior edge vw_i in three distinct faces, impossible in a triangulation. Hence there are no chords. ∎\n\nCorollary 3 (Interior degree bound). Every interior vertex has degree ≥ 4. If deg(v)=3 with neighbors a,b,c, then abc is an induced 3-cycle and, by Whitney, a face; but abc is subdivided by the three v-incident faces, contradicting that abc is a face. ∎\n\nLemma 4 (Facial triangles are the only maximal cliques of the primal). In the disk Whitney case, every maximal clique of G is a facial triangle.\nProof. Every 3-cycle is a face by Whitney. By Lemma 1, G has no 4-clique. Hence the maximal cliques are exactly the facial triangles. ∎\n\nLemma 5 (Connectivity of kG). If G has at least two faces, then kG is connected.\nProof. The usual dual graph (faces as vertices, adjacency across an edge) is connected. Since kG has an edge for any two faces that share a vertex, it contains the dual as a spanning subgraph. ∎\n\nLemma 6 (Local Helly across an interior edge). Let uv be an interior edge, with incident faces τ_1=uvx and τ_2=uvy (x≠y). If a face f intersects both τ_1 and τ_2, then f contains u or v.\nProof. If f contained neither u nor v, then to intersect τ_1 and τ_2 it must contain x and y. For f={x,y,z} to be a face, xy must be an edge. But then {u,v,x,y} would induce K4 (edges uv, ux, vx, uy, vy, xy), contradicting Lemma 1. ∎\n\nLemma 7 (Interior vertex-stars are maximal cliques in kG). Let v be an interior vertex of degree d≥4. Let T(v) be the set of faces incident to v. Then T(v) induces a clique in kG and is maximal.\nProof. Any two faces in T(v) share v, so T(v) is a clique. Let f be a face not containing v. By Lemma 2, N(v) induces a chordless cycle (w_1,…,w_d). The faces in T(v) are precisely F_i={v, w_i, w_{i+1}}. A triangle f not containing v can meet at most two consecutive neighbors of v; if it meets two, they must be consecutive, so f meets at most the three consecutive faces F_{i-1},F_i,F_{i+1}. As d≥4, some F_j is disjoint from f. Therefore no face outside T(v) meets all faces in T(v), so T(v) is a maximal clique in kG. ∎\n\nProposition 8 (N(t) is a maximal K4). Let t=uvw be a face whose three edges uv, vw, wu are interior. For each edge ab in {uv,vw,wu}, let f_ab be the other face incident to ab, with third vertex x_ab. Then C(t)={t,f_uv,f_vw,f_wu} induces a K4 in kG, and C(t) is a maximal clique.\nProof. Every pair in C(t) shares at least one vertex in {u,v,w}, so C(t) induces K4. For maximality, let f be a face meeting all members of C(t). Since f meets t, f contains at least one of u,v,w; assume u∈f. To meet f_vw, f must contain v or w or x_vw. But if u and x_vw were both in f then ux_vw would be an edge; with edges vx_vw and wx_vw, together with uv and uw, this would give a K4 on {u,v,w,x_vw}, contradicting Lemma 1. Hence f must contain v or w. If f contains u and v, then f is one of the two faces incident with uv, namely t or f_uv. Similarly, if f contains u and w, then f∈{t,f_wu}. Thus any face meeting all of C(t) already lies in C(t). ∎\n\nProposition 9 (Classification when a shared interior edge is present). Let C be a maximal clique of kG. Suppose C contains two faces that share an interior edge uv. Then C equals T(u), or C equals T(v), or there exists a face t incident with uv whose three edges are interior and C=N(t).\nProof. Let the two faces on uv be t=uvw and g=uvx. By Lemma 6, any face f∈C intersects both t and g only if f contains u or v. Thus every face in C contains u or v. If all faces in C contain u, then C⊆T(u), and maximality forces C=T(u). Similarly for v. Otherwise, some faces of C contain u but not v, and some contain v but not u. Let A be the set of u-faces in C and B the set of v-faces in C. For any a∈A and b∈B, a and b must intersect. Any common vertex of an arbitrary u-face and an arbitrary v-face is necessarily a common neighbor of u and v; in a Whitney triangulation, the only common neighbors of u and v are w and x (the third vertices of the two faces on uv), because any additional common neighbor y would create the 3-cycle uvy, which must then be a third face on uv, impossible. Hence every cross-pair (a,b) must share w or x. If some a∈A avoids w and some b∈B avoids x, then a and b are disjoint, contradiction. Thus either all v-faces in C contain w, and all u-faces contain w, or all v-faces contain x and all u-faces contain x. In the first case, C⊆{t,f_wu,f_vw,g}, and by Proposition 8 maximality forces C=N(t). In the second case, C⊆{g, (faces on ux), (faces on vx), t}, and similarly C=N(g): but N(g)=N(t). ∎\n\nConsequences\n- The only non-star maximal cliques in kG arise as N(t) for faces t whose three edges are interior (Proposition 9). All interior vertex-stars T(v) (deg v ≥ 4) are maximal (Lemma 7). Boundary vertex-stars may or may not be maximal, depending on whether a face outside T(v) meets all faces in T(v) (e.g., they are non-maximal in some outerplanar examples and maximal in others).\n- The clique number ω(kG) is at least max{4, max_deg_int(G)}. Establishing the matching upper bound ω(kG) ≤ max{4, max_deg_int(G)} reduces to proving that any clique not contained in a vertex-star must lie in some N(t) (see “Obstacles” below).\n\nExamples (sanity checks)\n- Fan (one interior vertex): kG is complete; k^2G≅K1.\n- Two triangles sharing one interior edge: kG≅K2; k^2G≅K1.\n- Hexagon triangulated by chords AC, AD, DF: faces ABC, ACD, ADE, DEF. kG is K4 minus one edge (ABC–DEF nonadjacent). Maximal cliques are T(A)={ABC,ACD,ADE} and T(D)={ACD,ADE,DEF}. Thus k^2G≅K2 and k^3G≅K1.\n- Central interior triangle with three surrounding faces (disk with a small “inward” triangle): C(t) forms a K4 in kG; thus k^2G≅K1.\n\nObstacles and open points\n- Full clique classification. We proved Proposition 9: any maximal clique that contains a pair of faces sharing an interior edge must be either a vertex-star or N(t). What remains is the case of maximal cliques C with no pair of faces sharing an edge. For the disk Whitney case we conjecture:\n  Conjecture (Helly-type). Any pairwise-intersecting family of facial triangles with no two sharing an edge has a common vertex. If true, the full classification follows: every maximal clique in kG is either T(v) for some v or N(t) for some interior t.\n- Outerplanar case (no interior vertices). Here N(t)-type cliques do not occur (each face has a boundary edge). We conjecture maximal cliques of kG are exactly T(v) for those boundary vertices v whose incident-face set is inclusion-maximal among {T(u)}. Proving this directly via the dual tree T (faces as nodes; T is a tree) seems feasible because each T(v) corresponds to a path S(v)⊆T, and maximality is equivalent to S(v) not being properly contained in S(w) for any w.\n- Acyclicity of k(kG) for outerplanar G. The planned ear-removal induction requires a careful local analysis of how maximal cliques of kG update when adding/removing an ear at boundary tip x (deg(x)=2). It is plausible that this operation corresponds to adding one vertex to k(kG) adjacent to at most one existing block, hence preserving the forest property, but a fully detailed proof is pending.\n\nNext steps (concrete, checkable)\n1) Formalize in proofs.md the four key results: Lemma 2 (chordless link), Lemma 6 (local Helly across an interior edge), Lemma 7 (T(v) maximal for interior v), and Proposition 8 (N(t) maximal K4). These are self-contained and ready.\n2) Prove the Helly-type conjecture for cliques with no edge-sharing pair. A promising approach: pick τ∈C; if C has no common vertex, there exist σ_u,σ_v∈C meeting τ at distinct vertices u,v. Show σ_u and σ_v must share an interior edge using the Whitney property and K4-freeness; if not, derive a contradiction by examining possible common neighbors of u and v (only the two across uv) and the link cycles at u and v.\n3) Outerplanar case: Precisely define S(v)⊆V(T) as the path of faces containing v. Show that the maximal cliques of kG are exactly those T(v) with S(v) inclusion-maximal. Then prove by ear-removal that the intersection graph of these S(v) is a forest, hence k(kG) is a forest. Verify small base cases explicitly and write the local update of maximal cliques when adding an ear.\n4) Computational check (to guide proofs): enumerate outerplanar triangulations up to n=10 and Whitney disks with one or two interior vertices of degree 4 or 5; compute k-iterations to confirm k-nullness and observe stabilization time. Record any example where k^3G≠K1 in the outerplanar case.\n\nRemarks on stabilization bounds\n- In all checked examples, outerplanar triangulations satisfy k^3G≅K1. If the ear-removal program confirms that k(kG) is a forest, then iterating k reduces to line graphs of trees, which eventually stabilize to a path and then to K2, and k maps K2 to K1. A universal bound of 3 or 4 iterations for all maximal outerplanar graphs seems plausible.\n\nSummary\n- We have supplied corrected and rigorous proofs of the structural lemmas requested: chordless links, local Helly across an interior edge, maximality of interior vertex-stars T(v), and maximality of N(t) around an interior face with three interior edges.\n- We proved a precise classification (Proposition 9) of maximal cliques that contain a pair of faces sharing an interior edge: they are exactly T(u), T(v), or N(t). The remaining classification step for cliques without edge-sharing pairs has been isolated as a Helly-type conjecture.\n- The outerplanar case is reduced to analyzing inclusion-maximal paths S(v) in the dual tree and handling ear-removal; this appears within reach and would establish k-nullness for the “no interior vertex” subproblem, with small stabilization time observed in examples."
}