{
  "content": "Overview\nWe focus on rigorous, local structure for Whitney triangulations of the disk, and prove three core lemmas requested by the verifier (link-of-v is a cycle; star cliques T(v) are maximal for interior v; N(t) forms a maximal K4 for interior t). We then add a new partial classification lemma for non-star maximal cliques and consequences. Several small k-null families are confirmed, and we outline the next steps to complete the classification of maximal cliques of kG and the outerplanar case.\n\nRigorous lemmas and proofs\nLemma 1 (K4-free; maximal cliques in G are facial triangles).\nLet G be the underlying graph of a finite Whitney triangulation of the disk. Then G contains no K4 subgraph. Consequently, the maximal cliques of G are precisely its facial triangles.\nProof.\nIf H ≅ K4 were an induced subgraph of G, Whitney implies that each 3-cycle of H bounds a face; thus the four triangular faces on the vertex-set of H appear in the triangulation. Each of the six edges of H is then incident with exactly two of these four faces. Hence none of those edges can lie on the boundary of the disk. Therefore those four faces form a closed 2-dimensional subcomplex (topologically a 2-sphere), disjoint from the boundary. This contradicts that the triangulation of a connected disk has no closed component. Thus K4 is forbidden. Since every 3-cycle bounds a face and K4 is forbidden, no clique of order ≥ 4 exists, and no edge can be maximal as a clique. Therefore the maximal cliques in G are exactly the facial triangles. ∎\n\nLemma 2 (Link of an interior vertex is a chordless cycle; interior degree ≥ 4).\nLet v be an interior vertex of G. Then the induced subgraph on N(v) is a chordless cycle. In particular, deg(v) ≥ 4.\nProof.\nConsider the star St(v), i.e., the union of all faces incident with v. In a triangulation of a 2-manifold, St(v) is a closed topological disk and its boundary, the link Lk(v), is a simple cycle whose vertices are N(v), and whose edges are precisely the pairs {x,y} for which vxy is a face. This shows that (i) the edges among N(v) that occur in faces with v form a cycle. Suppose there were a chord xy among N(v) joining nonconsecutive vertices of Lk(v). Then the 3-cycle vxy exists and, by Whitney, bounds a face. But the edge vx would then be incident with the two faces vxp and vxq coming from the two link-adjacent neighbors p,q of x around v, and also with the face vxy, a contradiction to “each edge is incident with exactly two faces.” Hence no such chord exists, so the induced subgraph on N(v) is exactly the link cycle. Finally, if deg(v)=3, then N(v) induces a triangle and the four vertices {v}∪N(v) form a K4 subgraph, contradicting Lemma 1. Hence deg(v) ≥ 4. ∎\n\nLemma 3 (Interior vertex-stars are maximal cliques of kG).\nLet v be an interior vertex of G. Then T(v):= {faces incident with v} induces a clique in kG. Moreover T(v) is maximal.\nProof.\nT(v) is a clique since any two of its faces meet at v. For maximality, let f be any face not containing v. By Lemma 2, the link Lk(v) is a chordless cycle v-w_1-w_2-…-w_d-v with d=deg(v)≥4, and the faces in T(v) are exactly t_i:=v w_i w_{i+1} (indices modulo d). The face f has at most two vertices from N(v): indeed, if it had three, those three neighbors would form a triangle, which would induce a chord in the link (for at least one of the three neighbor-neighbor edges), contradicting Lemma 2. If f contains exactly one neighbor, say w_i, then f intersects exactly the two faces t_{i-1}, t_i. If f contains exactly two neighbors, they must be consecutive (else their edge would be a link chord), say {w_i,w_{i+1}}, and then f is the unique face across the edge w_iw_{i+1}; in this case f meets exactly t_{i-1}, t_i, t_{i+1}. In either case f meets at most three faces of T(v). Since |T(v)|=deg(v)≥4, there exists t_j ∈ T(v) disjoint from f. Thus f cannot be added to T(v) while preserving the clique property; hence T(v) is maximal. ∎\n\nLemma 4 (Interior 4-cliques N(t) are maximal in kG).\nLet t=abc be a face all of whose three edges are interior. For each edge, denote by f_ab, f_bc, f_ca the unique other faces across ab, bc, ca, respectively. Then N(t):={t, f_ab, f_bc, f_ca} induces a K4 in kG and is a maximal clique.\nProof.\nEach of f_ab, f_bc, f_ca shares an edge with t, and any two of them meet at one of a,b,c; hence N(t) is a clique of size 4. Let f be any face not in N(t) and suppose f meets all four faces of N(t). Since f meets f_ab, it contains a or b; since it meets f_bc, it contains b or c; since it meets f_ca, it contains c or a. If f contains at least two of {a,b,c}, then f equals t or one of f_ab, f_bc, f_ca, because each edge among ab,bc,ca is already saturated by t and the corresponding f_∗. Thus f must contain exactly one of {a,b,c}; without loss, suppose f contains a and neither b nor c. Then f is disjoint from f_bc (which contains only b and c from {a,b,c}), contradicting that f meets all four in N(t). Hence no such f exists and N(t) is maximal. ∎\n\nNew partial classification lemma for non-star maximal cliques\nLemma 5 (Two-edge condition forces N(t)).\nLet S be a maximal clique in kG that is not of the form T(v). Suppose S contains a face t=abc and also contains two distinct faces f_ab and f_ac that share edges ab and ac with t, respectively (so ab,ac are interior). Then S = N(t). In particular, |S|=4, and the third neighbor f_bc across bc belongs to S.\nProof.\nFix t,f_ab,f_ac ∈ S as stated. Let f ∈ S be arbitrary. To intersect f_ab, f must contain a or b. To intersect f_ac, f must contain a or c. Therefore f either contains a, or f contains both b and c. The latter case forces f ∈ {t,f_bc}, because edge bc is interior and is incident with exactly two faces, t and f_bc. Thus any f ∈ S different from t or f_bc must contain a. Now, such an f containing a must also meet f_ab and f_ac. If f contains b, then f=f_ab (edge ab has exactly two incident faces, t and f_ab); if f contains c, then f=f_ac. It follows that S ⊆ {t, f_ab, f_ac, f_bc}. Finally, we show f_bc ∈ S: if f_bc ∉ S, then S′:=S∪{f_bc} is still a clique because every member of S either contains a (hence meets f_bc at t via a? No: f_bc does not contain a) or equals t; but the only possibility left is that members of S different from t all contain a, while f_bc contains b and c—still, f_bc intersects t and also intersects f_ab (at b) and f_ac (at c). Hence f_bc is adjacent to all members of S, contradicting maximality unless f_bc ∈ S. Therefore S=N(t). ∎\n\nRemark 6 (Boundary analogue).\nIf t has exactly two interior edges, say ac and bc with ab on the boundary, and S contains t together with both faces across ac and bc, then S is contained in T(c). In fact, any face containing c meets all three, so in a maximal clique one must have S=T(c). Thus in the “two-edge” configuration, non-star maximality is only possible for fully interior t (Lemma 5).\n\nConsequences and special cases\n- From Lemma 2 and Lemma 3, all interior vertex-stars T(v) (deg(v)≥4) are maximal cliques in kG.\n- From Lemma 4 and Lemma 5, any maximal clique that contains two edge-neighbors of some interior face t must be exactly N(t), of size 4.\n- Fans (exactly one interior vertex) are k-null: kG is complete (all faces contain the apex), so k^2G ≅ K1.\n- Two-face disk (two triangles sharing one interior edge): kG ≅ K2, hence k^2G ≅ K1.\n- Single interior triangle (e.g., a polygon triangulation containing one fully interior triangle): kG has N(t)≅K4; adding all other faces shows kG is complete in small instances (e.g., hexagon with central triangle), so k^2G ≅ K1.\n\nExamples and checks\n- Example (Lemma 5 in action). Let t=abc be interior with neighbors f_ab, f_bc, f_ca. Any maximal clique S of kG that contains t and two of f_ab, f_ac, f_bc must be S=N(t). Directly check: any further face f avoiding a fails to meet one of f_ab or f_ac; any further face f containing a must equal f_ab or f_ac because of edge-saturation.\n- Boundary caution. For t with exactly one boundary edge ab, the set {t,f_ac,f_bc} is a clique but not maximal when there exists any further face through c; in that case T(c) strictly contains it (Remark 6). This gives a ready filter distinguishing interior from boundary origins among non-star cliques.\n\nObstacles and what remains unproven\n- Full classification of maximal cliques of kG. We proved that interior vertex-stars T(v) (deg≥4) are maximal and that any maximal clique comprising t with two edge-neighbors must be N(t). We have not yet excluded the possibility of other non-star maximal cliques that do not contain two edge-neighbors of some face. The natural next step is to show that every maximal non-star clique necessarily contains such a “two-edge” configuration; a minimal-counterexample strategy around a face of minimal boundary-edge count appears promising.\n- Upper bound |S|≤4 for all non-star cliques. A clean, global proof that any pairwise-intersecting family of faces with empty common vertex has size at most 4 (and is exactly N(t) when size is 4) remains to be written. Lemma 5 handles a large subcase (those with two edge-neighbors present), but does not yet cover all possibilities.\n- Outerplanar case (no interior vertices). A general ear-removal induction remains to be formalized. The naive identification kG ≅ (weak dual)^2 fails (fan counterexample). A refined approach via the representation “faces incident to a fixed vertex form a contiguous block in the weak dual tree” may yield that maximal cliques of kG correspond to stars T(v) and some N(t) centered at fully interior triangles formed by three diagonals. Precisely tracking k on these blocks is still open here.\n\nNext steps (concrete, testable)\n1) Prove that every maximal non-star clique contains two edge-neighbors of some face t (the “two-edge” trigger), completing the classification via Lemma 5. Strategy: choose t in S minimizing boundary edges; show that if S contains no two edge-neighbors of t then S⊆T(x) for one of the vertices x of t, contradicting the non-star assumption.\n2) Derive a general bound for non-star clique size: confirm |S|≤4 for any clique S⊆V(kG) with empty common vertex. A local case analysis centered at a face t (distinguishing how many members of S meet t along an edge vs a single vertex) looks feasible.\n3) Outerplanar triangulations: formalize the dual-tree viewpoint where, for each polygon vertex u, the set of incident faces is a contiguous block in the weak dual tree. Use subtree-Helly to constrain maximal cliques in kG and show a monotone decrease under k (e.g., in the number of maximal blocks) that forces k-nullness.\n4) Computational enumeration for small sizes (say up to 20 faces): search for a maximal non-star clique not covered by Lemma 5; if none is found, this supports the “two-edge” trigger conjecture and guides the final proof.\n\nItems ready for proofs.md\n- Lemma 1 (K4-free; maximal cliques in G are facial triangles).\n- Lemma 2 (link of interior vertex is a chordless cycle; interior degree ≥ 4).\n- Lemma 3 (interior T(v) are maximal cliques of kG).\n- Lemma 4 (N(t) is a maximal K4 when t is fully interior).\n- Lemma 5 (two-edge condition forces S=N(t)).\n\nPotential implications for clique dynamics\n- Under the anticipated full classification (“any maximal non-star clique is some N(t)”), the vertices of k^2G would correspond to the family {T(v)} (interior v) together with {N(t)} (fully interior t). Analyzing intersections between these two families could yield a short path to completeness of k^2G (hence k-nullness) in many disk triangulations; Lemma 5 already ensures that any non-star maximal clique vertex of kG has degree at least 3 in k(kG) via its intersections with the three star cliques T(a), T(b), T(c).\n\nSummary\nWe provided rigorous proofs for core structural lemmas and established a strong partial classification (Lemma 5) of non-star maximal cliques in kG, with immediate size-4 bound in the two-edge subcase. We also clarified the boundary vs interior behavior of N(t). These sharpen the local picture needed to attack the main question and set up a clear next-step program (two-edge trigger + outerplanar dual-tree analysis) to move toward a full answer on k-nullness for Whitney triangulations of the disk."
}