{
  "progress_md": "Round 0001 — Critical review of brainstormed approaches; precise counterexamples; small rigorized lemmas and a concrete plan to target the parameter b in Dvořák’s scheme\n\nSummary of materials read\n- task.tex: Problem and brainstormed approaches (1–6).\n- Dvořák (2020) paper (ejc 27(2) #P2.26): Proof of the (3/8+o(1))n bound via Q3-patching; definitions of good/bad Q3, parameters p,a,b, and the resulting bound (1/3 + b/12 + o(1))n.\n- There is no output.md provided; nothing to curate yet.\n\nGaps and corrections to notes in task.tex\n1) “Deliverable sublemma” under approach 1 is false as stated.\n- Claim in notes: If a color occupies at least an ε-fraction of each block boundary δS_J for (1−θ) of the blocks, then that color has conductance Ω(ε) in the whole cube (hence a monochromatic antipodal path).\n- Counterexample (explicit): Color every edge (x,x⊕e_i) blue iff the Hamming parity of x is 0, and red otherwise. Then in every direction i and every block J we have exactly half of the edges blue, i.e. β_J = 1/2 for all J. Yet the blue subgraph has all odd-parity vertices isolated (degree 0), hence conductance 0 and is disconnected. Therefore, occupying a constant fraction of each δS_J does not imply any expansion or even connectivity. The obstruction is concentration on one bipartition side per direction.\n- Conclusion: Any usable block-to-expansion lemma must include a “balanced across endpoints” condition (e.g. per-direction, blue edges incident to each bipartition side in the block must form a constant fraction), not just an aggregate fraction across δS_J.\n\n2) Case A “Chernoff” bound in approach 1 is not valid as written.\n- Notes say: In a biased block J with β_J ∉ [1/2−ε, 1/2+ε], a random start and random ordering yields O(ε|J|) off-color edges, then 4-cycle commuting clusters defects and total switches ≤ T + O(ε n).\n- Issue: For a uniformly random start x and random ordering of the |J| directions, the i-edge encountered is uniformly distributed among all i-edges, so the expected number of blue edges encountered equals β_J|J| and red equals (1−β_J)|J|. If blue is the “majority,” the expected off-color count is (1−β_J)|J|, which is ≈ (1/2−ε)|J| when β_J = 1/2+ε — not O(ε|J|). Concentration inequalities do not apply directly here because these are m dependent edge-indicators evaluated at the same random vertex x.\n- Even existence via the method of conditional expectation only guarantees there is an order achieving at most the expectation (≈ (1/2−ε)|J| off-color edges in the mild-bias regime), not O(ε|J|). So the proposed inequality is overly optimistic.\n\n3) Why a naive “p-density of good Q3’s” cannot improve 3/8 by itself.\n- In Dvořák’s analysis, after defining p (fraction of good Q3), a (probability two random neighboring Q3 are both good), and b (probability one good, one bad), the final expected bound simplifies to (1/3 + b/12 + o(1))n using p = a + b/2. Thus p cancels out. Any plan focusing only on raising p above 1/2 (approach 2 as currently phrased) does not directly improve the constant; one must lower b strictly below 1/2 (or reduce the “a-case” boundary change probability below 1/2).\n\nSmall rigorized lemmas and bounds\nA) Vertex-wise Kneser (disjointness) graph viewpoint and a clean upper bound on mixed pairs.\n- Setup: For a fixed vertex v, Q3-subcubes through v correspond to 3-subsets K ⊂ [n] (directions). Two such Q3’s are v-neighbors iff K1 ∩ K2 = ∅. This is the Kneser graph KG(n,3) on vertices V = {K ⊂ [n]: |K|=3}, edges between disjoint triples. Let N = |V| = C(n,3), degree d = C(n−3,3).\n- For a given coloring, let G_v ⊆ V be the set of good triples at v; then b_v is the fraction of edges in KG(n,3) that cross the cut (G_v, V\\G_v). Dvořák’s “b” is the average over vertices of b_v, up to the normalization between ordered/unordered pairs (which cancels in fractions).\n- Spectral MAX-CUT bound (standard): For any d-regular graph with smallest eigenvalue λ_min, the maximum cut has at most |E|·(1/2)(1−λ_min/d) edges. For KG(n,3), the spectrum is known: eigenvalues are λ_0 = d, λ_1 = −C(n−4,2), λ_2 = n−5, λ_3 = −1. Hence λ_min = −C(n−4,2).\n- Therefore, for every v and every choice of G_v,\n  b_v ≤ 1/2 · (1 − λ_min/d) = 1/2 · (1 + C(n−4,2)/C(n−3,3)).\n  Since C(n−4,2)/C(n−3,3) = 3/(n−3),\n  b_v ≤ 1/2 + 3/(2(n−3)).\n- Averaging over v gives the same bound for b up to o(1/n) bookkeeping. This recovers and slightly sharpens Dvořák’s b ≤ 1/2 + o(1), giving an explicit o(1) term. It also clarifies the structural limitation: vertex-wise information alone cannot force b ≤ 1/2−γ for absolute γ.\n- Usefulness here: This pins down what extra (non-vertexwise) structure must be exploited to beat 3/8: correlations among the labels G_v across different vertices/edges, not captured by per-vertex cuts, are necessary.\n\nB) Formal “no-go” lemma for naive block-conductance.\n- Statement: There exist 2-colorings for which, for every block partition {J_t}, every block J satisfies β_J = 1/2 (blue occupies half of δS_J), yet the blue subgraph is disconnected (indeed, has 2^{n−1} isolated vertices) and has conductance 0.\n- Proof: The parity coloring described above has b_i(x) = 1 iff ⟨x,1^n⟩ mod 2 = 0 for every direction i. Then exactly half of i-edges are blue for every i, whence β_J = 1/2 for all J. But odd-parity vertices have zero blue degree, so the blue subgraph is disconnected. QED.\n- Usefulness here: Clarifies that any block-expansion lemma must additionally control endpoint-balance per direction (or within-block bipartition balance), not just overall fractions.\n\nRefined ideas targeting the boundary term (the parameter b)\nIdea I: Replace the per-vertex trivial cut bound with constraints across vertices via 4-cycle consistency.\n- Observation: The good/bad status of Q3(v,K) depends on the colors of edges both through v and away from v. Two disjoint triples K1,K2 at v involve disjoint sets of directions; hence many 4-cycles and 3-faces touching v and those directions mediate dependencies between “good at K1” and “good at K2”. The per-vertex MAX-CUT bound treats G_v as an arbitrary subset of triples, ignoring these constraints.\n- Plan (LP/SDP framework): Introduce variables for frequencies of local patterns around v on:\n  • 1-edge statistics at v: the color of each direction i.\n  • 2-edge statistics at v: for unordered pairs {i,j}, the multiset of colors on the 4-cycle through v in directions i,j (there are only a few 2-color isomorphism types), capturing parity constraints.\n  • 3-edge statistics: the 2-coloring type of Q3(v,K), with a flag good/bad and, for good, the color at v chosen by f1.\n- Impose consistency constraints: marginalization (3-edge types project to 2-edge and 1-edge types), and that for each fixed {i,j}, all four Q3 containing {i,j} at v aggregate consistently with the 4-cycle type. Also enforce that across a uniformly random direction set, distributions are invariant. Finally, encode that pairs (K1,K2) disjoint at v induce the boundary change indicator using the chosen colors for f1.\n- Objective: Maximize b (probability of good-bad among disjoint pairs) plus the “both-good boundary switch” probability, to reproduce Dvořák’s boundary analysis with the extra structural constraints. The hope: these constraints force b strictly below 1/2.\n- Auditable next step: Enumerate the finite type spaces explicitly (number of 2-edge types at v is small; number of Q3 types up to automorphism is also small), write the linear constraints, and solve the LP numerically to obtain a candidate γ > 0. If obtained, this gives a concrete target to then re-prove combinatorially.\n\nIdea II: Classify Q3 patterns more finely to reduce the “a-case” bound below 1/2.\n- In Dvořák’s proof, when both neighboring Q3’s are good (probability a), the probability of a boundary color switch at the common vertex is bounded by 1/2 + o(1). This is where structural savings may be hidden: for good Q3’s, the choice of f1 is not arbitrary; it tends to align with the majority color at the shared vertex in that Q3 (anchoring at a monochromatic star when present, see Lemma 8). Disjoint good cubes’ preferences may align more than random, leading to ≤ 1/2 − η for some absolute η.\n- Concrete step: Enumerate good Q3 isomorphism classes; for each class and a marked vertex, compute c_v (the color at v chosen by f1 in that Q3). Show that for two independent disjoint good cubes, P[c_v differ] ≤ 1/2 − η. Then the “a-term” contribution in Dvořák’s bound becomes (1/2 − η + o(1)) a, improving the constant.\n- Why plausible: The anchored-good subclass (Lemma 8) contributes a positive mass where c_v equals the common color at v; when degrees at v are slightly imbalanced these dominate. Even in the balanced case, the structure of bad patterns (Lemma 9) implies that good patterns have a constrained “preferred color” at v. This can be tested computationally for Q3.\n\nModest but checkable auxiliary computations\n- Re-derive the exact coefficient that Dvořák bounds in the “a-case.” In the paper (p. 5–6), the 1/2 + o(1) arises by a crude bound treating pairs of good v-neighbors that share another vertex as negligible. A tighter local counting (still within good Q3’s) may already give a c/n improvement in the “a-term.” While asymptotically negligible for our target, it will validate the direction and help calibrate the LP in Idea I.\n\nExamples to stress-test claims\n- Parity coloring (defined above):\n  • All blocks have β_J = 1/2; the blue subgraph is disconnected: demonstrates failure of naive conductance claims.\n  • Dvořák’s scheme applied here: almost surely a monochromatic antipodal path exists when n is even (choose blue if start and end in even parity class), but not necessarily via geodesics; confirms that the method’s lower-level constants must be disentangled from global connectivity phenomena.\n\nNext steps (concrete, auditable)\n1) Q3 pattern enumeration and “preferred color map” at a vertex.\n- Task: List all 2-colorings of Q3 up to automorphism, mark the isomorphism classes that are good/bad (using Dvořák’s definition), and for each good class and marked vertex identify the color at the marked vertex selected by f1 (minimal changes; fix a deterministic tie-break). Output: a table of classes with weights.\n- Deliverable: For two independent random good Q3’s at v with disjoint direction sets (approximating independence), compute the probability their f1-colors at v differ. If this is ≤ 1/2 − η for some η > 0, draft a lemma capturing this bias. If not, record the counterexample pattern mix.\n\n2) LP bound for b using local consistency.\n- Task: Set up a linear program over the frequencies of: (i) per-vertex degree of blue; (ii) per-pair 4-cycle type frequencies at v; (iii) Q3 pattern frequencies at v. Impose marginal constraints and consistency of pairs of disjoint triples at v. Maximize b subject to these constraints to test if b ≤ 1/2 − γ is forced by local structure. Start with a reduced symmetry model (assume per-vertex blue degree equals n/2) to simplify.\n\n3) Repair of approach 1 (block phase) via endpoint-balance conditions.\n- Task: Formulate and prove a corrected lemma: If in a block J and for each direction i ∈ J the set {x ∈ {0,1}^n : the i-edge at x is blue} has density in [ε, 1−ε] and additionally its correlation with the block-parity function p_J is at most 1−2ε, then the blue subgraph restricted to coordinates in J is connected within each coset of the other coordinates. Sketch a proof via expansion of a product of matchings with endpoint balance, or point out the precise obstacle.\n- Usefulness: Even if this does not directly lead to a global δ, it will clarify what endpoint-balance one must enforce to get monochromatic long runs.\n\n4) Document the exact dependence on b in Dvořák’s bound and isolate where boundary improvements can be inserted.\n- Task: Rewrite the final inequality as switches ≤ (1/3 + b/12 + φ)a + ψ with explicit φ,ψ capturing the “a-case” boundary term. Identify the component where replacing 1/2 by 1/2 − η moves the final constant by η·(a/3). This will quantify how large an η is needed for a given lower bound on a.\n\nWhy these steps are promising\n- They target the only parameter that matters in Dvořák’s calculation (b), or the only loose bound (the 1/2 in the a-case), and they incorporate cross-cube constraints (4-cycles and consistency) that weren’t used in the 3/8 bound. Either an LP certifies a strict gap or it produces extremal local statistics guiding a human proof.\n\nPotential obstacles\n- Independence assumptions between disjoint triples at v are false; the LP must encode enough consistency without exploding in size. Start with a relaxation.\n- Ties in the f1 choice for good Q3’s must be resolved canonically to keep the model deterministic; otherwise adversarial tie-breaking could push probabilities toward 1/2.\n- Even a verified η > 0 for the a-case might be offset by an adversarial increase in b; the LP must optimize both simultaneously.\n\nClosing\n- Immediate action items: (1) Implement Q3 pattern classification and compute c_v biases for good Q3’s; (2) Draft the LP skeleton and test a symmetric relaxation (n large, per-vertex blue degree n/2) to probe whether b ≤ 1/2 − γ is plausible under local constraints.\n"
}