{
  "content": "Ideas\n- Keep the permutation template f_i(π)=π(i) with E⊆S_k, F=[k]. Then the conflict graph G on E is complete, so the number of parts needed equals |E|. This makes maximizing |E| while keeping the fibre parameter small the key task.\n- Enforce many “small fibres” per value z by forbidding r permutation matchings of cells (i,z) and counting perfect matchings that avoid them via permanents. Van der Waerden’s bound yields a clean, rigorous e^{-r}-fraction of all permutations.\n\nLemma A (completeness for permutation template)\nLet k≥2, F=[k], E⊆S_k, and f_i(π)=π(i). For any distinct π,σ∈E choose s with π^{-1}(s)≠σ^{-1}(s). Then with p=π^{-1}(s), q=σ^{-1}(s), p≠q and f_p(π)=s=f_q(σ), hence xy is an edge. Thus G is complete on E.\nWhy useful: χ(G)=|E|; any lower bound on |E| under fibre constraints gives a counterexample.\n\nProposition B (large core with ≥r forbidden matchings via van der Waerden)\nFix k and r with 1≤r≤k. Let B be the union of r permutation matrices M_1,…,M_r (i.e., forbidden cells (i,σ_j(i)) in the k×k grid). Let A be the 0–1 matrix of allowed cells (complement of B). Then A has all row/column sums equal to t:=k−r. The number of permutations avoiding B equals per(A). Since B′:=A/t is doubly stochastic, van der Waerden yields per(B′)≥k!/k^k, hence\nper(A) = t^k per(B′) ≥ ((k−r)/k)^k k!.\nConsequently there exists a set E_0(r)⊆S_k of size at least ((1−r/k)^k)k! with π(i)≠σ_j(i) simultaneously for all j,i.\nWhy useful: E_0(r) gives a factorial-sized complete conflict graph while guaranteeing that for every z and each j there are zero preimages along the index i where the j-th forbidden matching hits z.\n\nCorollary C (factorial counterexamples with ≥r small fibres per z and n=1)\nFix r. Choose permutations σ_1,…,σ_r of [k] and let B=⋃_{j} M(σ_j). Let E_0(r) be as in Proposition B. For each (z,j), pick one permutation π^{(z,j)} with π^{(z,j)}(σ_j^{-1}(z))=z and avoiding all other cells of B (exists by Hall’s theorem; see also the quantitative bound below). Define\nE := E_0(r) ∪ {π^{(z,j)} : z∈[k], j∈[r]}.\nThen:\n- For every z, the r indices t_j:=σ_j^{-1}(z) satisfy |f_{t_j}^{-1}(z)|=1 (only the one added π^{(z,j)}), so the “≥r small fibres per z” variant holds with n=1.\n- By Lemma A, G on E is complete, so χ(G)=|E| ≥ ((1−r/k)^k)k! + rk.\n- In particular, for fixed r and large k, χ(G) ≥ (e^{-r}+o(1))k! with n=1. This rules out any bound of the form χ≤c(k)·n with subfactorial c(k), even under the stronger requirement that each z has r distinct small fibres.\nSketch that the completions exist in quantity: For a fixed pair (z,j) with row i=σ_j^{-1}(z) pinned, the remaining (k−1)×(k−1) allowed matrix has all row/column sums t (since we only removed row i and column z). Van der Waerden gives at least\n((k−r)/(k−1))^{k−1} (k−1)!\ndistinct completions through that pinned cell, so we can choose the π^{(z,j)} distinct, and even n of them for any n up to this bound.\n\nGeneral n\nBy the same argument, for any 1≤n≤((k−r)/(k−1))^{k−1}(k−1)!, we can pick for each (z,j) a set of n distinct completions. Then with E := E_0(r) ∪ ⋃_{z,j} A_{z,j} (|A_{z,j}|=n), we get\n- For every z there are r indices t with |f_t^{-1}(z)|=n.\n- G is complete; hence χ(G)=|E| ≥ ((1−r/k)^k)k! + rnk.\n- The intrinsic parameter n* is at most n (indeed equals 1 if some other index has a single preimage, but this only strengthens the counterexample).\n\nExample (small k)\n- k=3, r=1, pick σ_1=id. Then per(A)≥((2/3)^3)·6=16/9>1, and in fact |E_0(1)|=D_3=2. Adding π^{(1,1)},π^{(2,1)},π^{(3,1)} (the three transpositions) yields |E|=5, n=1, χ(G)=5>2n+1=3.\n\nRobustness under very strong regularity\n- Projective-plane family: For k=q+1 (q prime power), let E=lines, F=points of PG(2,q). Properly edge-color the incidence bipartite graph with k colors and set f_i(L) to be the unique point of color i on L. Then |f_i^{-1}(z)|=1 for all i,z (each f_i is a bijection), yet G is complete on |E|=k^2−k+1, so χ=k^2−k+1>3. This demonstrates failure even when all fibres are equal to 1.\n\nObstacles/remarks\n- Tight counting for the union of r permutation matrices can be refined via rook polynomials; the van der Waerden bound already suffices for exponential-in-k lower bounds with the correct e^{-r} limit.\n- n* in the constructions with r≥1 often equals 1 (not n) once other indices acquire at least one preimage via E_0(r); this only strengthens the negation of any 2n+1-type bound.\n\nNext steps\n- Record a concise proof that every allowed edge of A lies in some perfect matching (1-factorization of regular bipartite graphs), to justify the existence part without asymptotics.\n- Write the rook-polynomial derivation giving |E_0(r)|=(e^{-r}+o(1))k! and bounds on the number of completions through a fixed cell.\n- Explore upper bounds under extra regularity (e.g., all f_i surjective, nearly balanced fibres); the projective-plane family suggests Θ(k^2) is attainable with all fibres 1.\n"
}