{
  "content": "Ideas\n- Use the conflict-graph G on E: x–y is an edge iff ∃ p≠q with f_p(x)=f_q(y). The partition property is equivalent to a proper coloring; the minimum number of parts is χ(G).\n- Seek instances with n=1 that are robust under strong regularity constraints (all functions surjective, even bijective; all fibres equal; no “zero” fibres). Achieve χ(G) as large as possible, ideally complete graphs.\n\nA general design-based blueprint (very strong, n=1, all functions bijections)\nLet (V,B,𝓘) be a symmetric 2-(v,k,λ) design (v=b, each block contains k points, each pair of blocks meets in exactly λ≥1 points). Let H be its incidence bipartite graph with bipartition (B,V): edge (B,z) iff z∈B. Then H is k-regular on both sides. By Kőnig’s line-coloring theorem, H admits a proper k-edge-coloring with colors [k]; equivalently, a 1-factorization into k perfect matchings M_1,…,M_k.\nDefine functions f_i:B→V as follows: for each block X∈B, let f_i(X)=z where (X,z)∈M_i. Since M_i is a perfect matching, f_i is a bijection B→V; in particular, |f_i^{-1}(z)|=1 for all i and z (so n=1 and every function is surjective). For any block X, the values {f_1(X),…,f_k(X)} are precisely the k distinct points incident with X, so pointwise distinctness holds.\n\nLemma (completeness).\nFor distinct X,Y∈B, the conflict graph on B is complete: X and Y are adjacent.\nProof. Since λ≥1, X∩Y contains some point z. Let p be the color of edge (X,z) and q the color of (Y,z). As the edge-coloring is proper at z, p≠q. Hence f_p(X)=z=f_q(Y), so X and Y are adjacent in G. Therefore G is K_v and χ(G)=v.\n\nConsequences.\n- Extremely strong counterexample for the k-function problem with n=1: with k equal to the block size of a symmetric design and v blocks, we obtain χ(G)=v, while 2n+1=3. This persists under the very strong constraints: all f_i are bijections; all fibres equal 1; for every z and every i, |f_i^{-1}(z)|=1; in particular no “zero-fibre” shortcuts.\n- This also settles natural stronger variants such as “for each z there are at least r functions with |f_t^{-1}(z)|≤1”: here r=k (maximal).\n\nInstantiation: finite projective spaces (hyperplanes vs points)\nTake PG(d,q) with d≥2. Let V be the set of points and B the set of hyperplanes. Then (V,B,𝓘) is a symmetric 2-(v,k,λ) design with\nv = |V| = (q^{d+1}-1)/(q-1),\nk = |X| = (q^{d}-1)/(q-1) for each hyperplane X,\nλ = (q^{d-1}-1)/(q-1) ≥ 1.\nApply the blueprint to obtain k functions f_1,…,f_k:B→V with:\n- pointwise distinctness,\n- |f_i^{-1}(z)|=1 for all i,z (so n=1),\n- conflict graph G on B is complete, hence χ(G)=|B|=v.\nConcrete sizes: with k=(q^{d}-1)/(q-1) and n=1 we need at least v=(q^{d+1}-1)/(q-1) parts; for d=2 this is v=k^2−k+1; for higher d, v≈q·k grows superlinearly in k.\n\nSmall explicit examples (checkable)\n- k=3 (q=2,d=2): v=7. E=B= the 7 lines of the Fano plane; F=V= the 7 points. Each f_i is a bijection; |f_i^{-1}(z)|=1 for all i,z; G=K_7; χ=7>3.\n- k=4 (q=3,d=2): v=13. E the 13 lines of PG(2,3), F the 13 points; χ=13>3.\n- k=7 (q=2,d=3): v=15, k=7; χ=15>3.\n\nWhy this strengthens prior families\n- Compared to permutation-based n=1 examples that relied on some functions having zero fibres at many z, the design family enforces the strongest uniformity: each f_i is a bijection and every fibre has size 1.\n- It applies to several infinite families of k (all k of the form 1+q+⋯+q^{d−1}). In each, χ(G) is quadratic (d=2) or larger (d≥3) in k while n=1.\n\nObstacles/limits\n- Symmetric 2-(v,k,1) designs are precisely projective planes; more general symmetric designs (λ>1) still yield the same conclusion but with k and v constrained by design feasibility. Thus we get infinite families of strong counterexamples but not for all k.\n\nNext steps\n- Enumerate further symmetric designs (e.g., from classical polar spaces) to widen the k-range, recording the resulting (k,v) pairs and lower bounds χ(G)=v for n=1.\n- For k not covered by symmetric designs, explore near-symmetric bipartite graphs with degree k and 1-factorizations ensuring each f_i is surjective and fibres uniformly bounded (e.g., 1 or 2), while keeping pairwise left-neighborhoods intersecting to maintain completeness.\n- Formalize a unifying lemma: any k-regular bipartite graph with a 1-factorization and pairwise-intersecting left neighborhoods yields the same n=1 complete-graph counterexample.\n- Provide explicit constructions for k=5,6 via known symmetric designs (e.g., biplanes) where available.\n"
}