{
  "progress_md": "Ideas\n- Main goal: determine the asymptotic order of g(k,2) in the two-point adversarial sampling process. I present a clean, verifiable argument that in fact g(k,2)=1 in expectation. In particular, the expected average weight never increases, regardless of the adversary. This strictly resolves Simplification 1 (lighter‑item adversary) and, via a monotonicity reduction, the full model for ℓ=2.\n\n- Key step: For a fixed state with n items having weights w=(w1,…,wn), let W=∑wi and let a size‑biased draw choose item i with probability pi=wi/W. Draw two i.i.d. samples I,J from {1,…,n} with distribution p, and let the adversary delete the lighter of the two sampled items, i.e., remove weight min(wI,wJ). I prove the inequality\n  E[min(wI,wJ)] ≥ W/n\n  for every weight vector w. This implies a stepwise supermartingale property for the average.\n\n- Reduction to the “worst” adversary: In our process the adversary may (a) choose ℓi∈{1,2}, (b) pick which of the ℓi sampled items to delete, and (c) decrease remaining weights. For the purpose of maximizing the average, none of these can do better (i.e., cause a larger next average) than always choosing ℓi=2, deleting the lighter of the two samples, and never decreasing any weight. Reasons:\n  - Choosing ℓi=1 removes a size‑biased draw X with E[X]≥E[min(X1,X2)], so it removes at least as much weight in expectation, thus cannot increase the average more.\n  - Given two samples, deleting the lighter item minimizes removed weight and hence maximizes the next average; any other choice removes at least as much.\n  - Decreasing any remaining weight reduces the total W and can only decrease the average and future expected deletions; hence it cannot increase the expected next average.\n  Therefore, it suffices to analyze the “lighter‑of‑two, no‑decrease” rule.\n\nLemma 1 (Schur‑convex lower bound on the expected lighter‑of‑two).\n- Let u=(u1,…,un) be a probability vector with ui=wi/W (so ∑ui=1). Define\n  S(u) := ∑_{i,j} ui uj min(ui,uj).\n  Then S(u) ≥ 1/n for all u. Equality holds for the uniform vector u≡1/n.\n\n- Proof sketch (fully checkable): Assume u is sorted nondecreasing (u1≤⋯≤un). In the region with fixed order type, one can write\n  S(u) = ∑_{i≤j} u_i^2 u_j + ∑_{j<i} u_i u_j^2.\n  Compute the partial derivatives for r=1,…,n:\n  ∂S/∂u_r = 2 u_r ∑_{j≥r} u_j + 2 ∑_{h<r} u_h^2 + u_r^2.\n  Then for each r, the difference\n  Δ_r := (∂S/∂u_{r+1}) − (∂S/∂u_r) = (u_{r+1}−u_r)·(2∑_{j≥r+1} u_j + u_{r+1}+u_r) ≥ 0,\n  because u_{r+1}≥u_r and the sum in parentheses is nonnegative. By the Schur–Ostrowski criterion (standard in majorization theory), S is Schur‑convex. Thus S attains its minimum at the most balanced point, the uniform vector, where S(1/n,…,1/n)=1/n. This proves the claim.\n\nCorollary 2 (one‑step supermartingale inequality for the average under lighter‑of‑two).\n- With the notation above and n current items,\n  E[min(wI,wJ)] = W · S(u) ≥ W/n.\n  Therefore, writing R for the removed weight and noting that the next average is\n  AVG′ = (W − R)/(n − 1), we get\n  E[AVG′ | state] ≤ (W − W/n)/(n − 1) = (n/(n−1))·(1 − 1/n)·(W/n) = W/n = AVG.\n  Hence, under the lighter‑of‑two, no‑decrease rule, the expected average is non‑increasing at every step.\n\nTheorem 3 (Main). In the two‑point adversarial sampling process, for every adversary, every initial instance, and all i,\n- E[AVG_i] ≤ AVG_0.\n- Consequently, g(k,2)=1 (in expectation).\n\n- Proof: By the reduction to the worst adversary described above, it suffices to prove the one‑step bound under the lighter‑of‑two, no‑decrease rule. Corollary 2 gives E[AVG_{i+1} | past] ≤ AVG_i; taking total expectation and iterating yields E[AVG_i] ≤ AVG_0 for all i. The definition of g(k,2) as the smallest function bounding the expected average then gives g(k,2) ≤ 1. The instance with all weights equal keeps the average constant at every step, so g(k,2) ≥ 1. Therefore g(k,2)=1.\n\nWhy this addresses the task’s partial goals\n- Simplification 1 (lighter‑item adversary): We showed the expected average is a non‑increasing supermartingale; in particular, the blow‑up is 1.\n- Full model: The same argument extends because any deviation (choosing ℓ=1, deleting a different sample, or decreasing weights) can only reduce the expected next average compared to the lighter‑of‑two, no‑decrease rule.\n\nExamples and sanity checks\n- Uniform weights: u_i=1/n. Then E[min(wI,wJ)]=W/n and the expected average stays equal; this shows tightness (g(k,2) cannot be <1).\n- Two weights (n=2): Direct computation gives E[min]/W = u_1^2 + 2 u_1 u_2·min(u_1,u_2) + u_2^2 ≥ 1/2, matching the general bound.\n\nObstacles and caveats\n- The proof establishes an in‑expectation statement. It does not claim that AVG_i is a.s. non‑increasing along every random trajectory. High‑probability control could be pursued (e.g., via Azuma–Hoeffding/Freedman) but is not needed for g(k,2).\n- The Schur‑convex step relies on standard majorization (Hardy–Littlewood–Pólya) and the Schur–Ostrowski criterion; I’ve written out the derivative calculation and the monotonicity of the gradient components, which is the checkable core.\n\nNext steps\n- Optional strengthening: derive concentration bounds for the average around its (non‑increasing) mean to show with high probability the average never exceeds (1+o(1))·AVG_0 across all steps.\n- Extensions: explore whether analogous Schur‑convex arguments can give nontrivial bounds for ℓ>2 (e.g., bounds on E[min of ℓ i.i.d. size‑biased draws]). For general ℓ, the minimum‑of‑ℓ expected value equals W·E[min(U1,…,Uℓ)], where the same Schur‑convexity technique might show E[min] ≥ c_ℓ/n with c_ℓ growing linearly in ℓ; this could tighten the known Ω(ℓ) lower and O(k) upper bounds.\n\nGaps in output.md\n- No output.md was provided; nothing to flag.\n\nSummary\n- New, checkable claim: For size‑biased sampling, E[min of two i.i.d. draws] ≥ W/n; proof via Schur‑convexity.\n- Consequence: The expected average is a supermartingale for ℓ=2 under the worst adversary, hence g(k,2)=1.\n- Tightness witnessed by the uniform instance."
}