{
  "summary_md": "Round 0005 added several localized, verifiable triggers and closed small-case gaps while isolating a single remaining hard subcase. Prover-01 introduced unique-maximal case lemmas H' (boundary-threshold ⇒ unique type–1) and K/K' (top-row/right-column pivots ⇒ unique types 4/3) and gave a complete |U|=4 proof (Proposition P4). Prover-02 added complementary triggers XR (support ⊆ one row ∪ one column ⇒ unique 3/4), J (empty L–corner ⇒ unique type–2), and L (top/right extremality on consecutive maxima ⇒ unique type–2), and showed S=∅ (no strictly SW points of the unique maximum) is handled by XR. Both audits removed the earlier false global claim about “≥3 on a row/column ⇒ unique 4/3.” The remaining isolated obstacle is the unique-maximal subcase where every SW-maximal point fails the H' thresholds and α₂,β₂ reappear so K/K' don't fire; the plan is to finish it by formalizing a robust L-corner (D') and a pivot-or-corner dichotomy and to stress-test with |U|=5. Citations: prover-01.out.json, prover-02.out.json (Verifier: partial success).",
  "highlights": [
    "The earlier false global claim about “≥3 on a row/column ⇒ unique type 4/3” has been removed and replaced by correct single-line and single-row/column statements.",
    "New unique-maximal triggers (Prover-01): Lemma H' (gives a checkable certificate for a unique type–1 color) and Lemmas K/K' (pivot conditions yielding unique type–4 or type–3).",
    "Prover-02 supplied XR (row∪column support ⇒ unique 3/4), J (empty L–corner ⇒ unique type–2), and L (top/right extremality on consecutive maxima ⇒ unique type–2), which together handle several previously problematic patterns.",
    "Complete, verifiable proof for |U|=4 (Proposition P4) now provided; small-case analysis used the new triggers and covers all occupancy patterns.",
    "The unique-maximal remaining subcase is tightly isolated: S≠∅ but every SW-maximal p fails H' thresholds and α₂,β₂ reappear so K/K' do not fire. This suggests a pivot-or-corner dichotomy leading to either a singleton+extension trigger or a robust L-corner (D').",
    "Concrete verification strategy proposed: formalize D' (robust L-corner), implement a maxima-scan checking L/K/H' certificates, and then extend case analysis to |U|=5 to validate the trigger library."
  ],
  "next_questions": [
    "Formalize and prove Lemma D' (robust L-corner uniqueness) that tolerates extra points outside the open rectangle, and add it to the curated trigger library.",
    "Complete the unique-maximal case: prove the pivot-or-corner trichotomy (H' or K or K' must fire, or else produce a D'/singleton+extension witness) using an extremal choice of a SW-maximal p.",
    "Extend the verified case analysis to |U|=5 (implement the maxima-scan rules and test all occupancy patterns) to stress-test and refine the invariants before attempting the general proof."
  ]
}