{
  "content": "Ideas\n\n- Classify maximal cliques in k(G) for Whitney triangulations of the disc. Prior “Helly” for face-triangles is false in general (it holds for maximal outerplanar discs but fails with interior vertices). A correct classification splits maximal cliques of k(G) into two natural types: vertex-stars and triangle-stars. This makes k^2(G) auditable and sets up a pruning analysis.\n- Consolidate boundary-aware counting: keep the correct face-degree formula in k(G) and the corrected closed-surface sum identity.\n- For maximal outerplanar discs, rigorously recover that the only maximal cliques are vertex-stars; hence k^2(D) ≅ D[S] with S the degree≥3 vertices; refine the “zig-zag” corollary with the exact number of further steps via line graphs of paths.\n\nRigorous statements and proofs\n\nLemma 1 (degree of a face in k(G) with boundary; restated). Let G be the underlying graph of a finite Whitney triangulation of a disc. For a facial triangle f={a,b,c}, let B(f) be the number of boundary vertices among a,b,c and Eb(f) the number of boundary edges of f. Then\n\ndeg_{kG}(f) = deg_G(a)+deg_G(b)+deg_G(c) − 6 − B(f) + Eb(f).\nProof. As in previous round: split neighbors of f in k(G) into those sharing an edge of f and those sharing exactly one vertex, and count, noting that at a boundary vertex v the number of incident face-triangles equals deg(v)−1. The algebra yields the formula; details are unchanged.\n\nCorollary 2 (closed case sum identity; corrected). If G triangulates a closed surface, then for each facial triangle f={a,b,c}, deg_{kG}(f)=deg(a)+deg(b)+deg(c)−6, and\nΣ_f deg_{kG}(f) = Σ_v deg(v)^2 − 6F,\nwhere F is the number of faces. In particular, the average degree in k(G) satisfies 2|E(kG)|/|V(kG)| ≥ 3·(2|E|/|V|) − 6.\nProof. Each v appears in deg(v) faces, hence Σ_f Σ_{x∈f} deg(x) = Σ_v deg(v)^2, and Σ_f 6 = 6F.\n\nProposition 3 (no K4 subgraph in Whitney disc triangulations). If G is a Whitney triangulation of a disc, then K4 ⊄ G.\nProof. In a Whitney triangulation each edge is in at most two faces, boundary edges in exactly one, interior edges in exactly two, and each 3-cycle of G is a face. A K4 subgraph has six edges and four 3-cycles; every edge of K4 lies in exactly two of these four triangles. Hence along these edges there is no incidence to triangles outside the K4. The subcomplex formed by these four faces is a closed 2-manifold (a sphere) embedded in the disc, which is impossible. ∎\n\nProposition 4 (classification of maximal cliques in k(G) for Whitney discs). Let G be a finite Whitney triangulation of a disc and let K be a maximal clique in k(G) (i.e., a maximal family of facial triangles pairwise intersecting). Then exactly one of the following holds:\n- Vertex-star: there exists a vertex v of G such that K = P_v := { facial triangles containing v }. This occurs precisely when ⋂_{T∈K} T ≠ ∅.\n- Triangle-star: there exists an interior facial triangle f=abc such that K = Q_f := { f } ∪ { facial triangles that share an edge with f }. Equivalently, Q_f consists of f and its three edge-neighbors (some may be missing on the boundary, in which case Q_f is not maximal). This occurs precisely when ⋂_{T∈K} T = ∅.\nProof. First, both P_v and Q_f are cliques. P_v is a clique because any two facial triangles containing v intersect in v. For a face f=abc, let T_ab, T_bc, T_ca be the (at most three) facial triangles edge-adjacent to f along ab, bc, ca. Then any two distinct members among {f, T_ab, T_bc, T_ca} intersect (edge intersections when f is involved; single-vertex intersections among T_ab, T_bc, T_ca at a, b, c respectively), hence Q_f is a clique. We now prove maximality and the dichotomy.\n(i) Suppose K has nonempty total intersection: choose v∈⋂_{T∈K} T. Then K⊆P_v. If K⊊P_v, pick T∈P_v\\K. Because every triangle in K contains v, T meets each member of K at v, so K∪{T} is a larger clique, contradicting maximality. Hence K=P_v.\n(ii) Suppose ⋂_{T∈K} T=∅. Pick three distinct triangles T1,T2,T3∈K. If some pair, say T1,T2, shares an edge uv, then T3 must intersect both but avoid a common vertex with them, thus it cannot contain u or v; hence T3 must contain the two other vertices w1∈T1\\{u,v}, w2∈T2\\{u,v}, implying the edge w1w2 and producing the K4 on {u,v,w1,w2}, which is forbidden by Proposition 3. Thus, any three triangles in K must intersect pairwise at single vertices (no edge-sharing among them). Let the intersections be T1∩T2={x}, T2∩T3={y}, T3∩T1={z} with x,y,z distinct. Then xz is an edge (lies in T1), xy is an edge (lies in T2), and yz is an edge (lies in T3), so xyz is a 3-cycle in G; by the Whitney property, f:=xyz is a face. Consider Q_f as above. Each Ti contains two of {x,y,z}, so Ti∈Q_f. Hence {T1,T2,T3}⊆Q_f. If K did not contain f, then K∪{f} would still be a clique (f meets each Ti along an edge), contradicting maximality; thus f∈K. Finally, any triangle U not in Q_f either (a) misses f, hence cannot meet all T_ab, T_bc, T_ca, or (b) shares only a single vertex with f, hence fails to intersect one of the two neighbors not containing that vertex. In either case U cannot be adjacent to all members of Q_f, so K cannot be strictly larger than Q_f. Therefore K=Q_f. ∎\n\nRemarks.\n- For maximal outerplanar discs, every facial triangle has exactly one boundary edge, hence at most two neighbors; therefore Q_f⊆P_v for the unique vertex v incident to both neighboring edges, and Q_f is never maximal. Thus the only maximal cliques in k(D) are P_v with deg_D(v)≥3, recovering the outerplanar case cleanly.\n- In general discs with interior faces, triangle-stars do occur and are maximal precisely for interior faces with three neighbors.\n\nProposition 5 (maximal outerplanar: two-step structure and zig-zags). Let D be a maximal outerplanar triangulation (triangulated polygon). Then:\n- The maximal cliques of k(D) are exactly P_v for boundary vertices v with deg_D(v)≥3.\n- Consequently, the vertices of k^2(D) are in bijection with S={v:deg_D(v)≥3}, and two vertices u,v∈S are adjacent in k^2(D) iff uv∈E(D). Hence k^2(D)≅D[S].\n- If D[S] is a path P_m, then k^2(D)=P_m and k iterates on a path satisfy k(P_m)=L(P_m)=P_{m−1}, so k^{2+(m−1)}(D)=K_1. In particular, “zig-zag” triangulations (whose S induces a path) are k-null in at most m+1 iterations, with the precise number dictated by m.\nProof. First two bullets follow from Proposition 4 specialized to the outerplanar case. The last bullet uses that the maximal cliques of a path are its edges, and the clique graph equals the line graph. ∎\n\nExamples\n\n- Central-face patch: Let f=xyz be an interior face. Then the four facial triangles {f,T_xy,T_yz,T_zx} form a size-4 maximal clique in k(G) of triangle-star type; their common intersection is empty. This explicitly witnesses failure of Helly for facial triangles in the general disc case.\n- Fans: As previously proved, a fan with apex x satisfies k(D)≅K_{deg(x)} and k^2(D)≅K_1.\n\nObstacles\n\n- For general discs, k^2(G) has vertices of two kinds (P_v and Q_f). A full structural description of their adjacencies is still to be written; this is the next technical hurdle toward a general k-null proof.\n- For maximal outerplanar discs, showing termination of repeated k^2 without re-maximality of D[S] requires care if one proceeds by induction on k^2; Proposition 5 avoids this issue for “zig-zag” cases by moving to paths after one k^2.\n\nNext steps\n\n- Write the adjacency rules among P_u, P_v, Q_f in k^2(G): determine when P_u∼P_v (edges of G), P_u∼Q_f (u∈f or u incident to two edges of f), and Q_f∼Q_g (faces f,g sharing an edge or vertex with suitable overlaps). Aim: a compact combinatorial model of k^2(G).\n- Identify a monotone potential Φ(G)=|{P_v}|+|{Q_f interior}| and prove Φ(k^2(G))<Φ(G) unless Φ(G)=1, to drive k-nullness for all Whitney discs.\n- Computation: enumerate disc triangulations on up to, say, 12 vertices; verify Proposition 4 and map k^2 to the P/Q graph; search for extremal patterns that slow convergence.\n- Sphere (Q2): use Corollary 2 to seek a finite invariant that grows along a subsequence for non-K4 triangulations (e.g., count of triangles of large k-degree), complementing known divergence of octahedron and icosahedron.\n\nSummary\n\n- Corrected and fixed the structural picture for discs: Helly on facial triangles fails in general; we proved a clean classification of maximal cliques in k(G) into vertex-stars P_v and triangle-stars Q_f (Proposition 4). This is immediately checkable on examples and recovers the outerplanar subclass.\n- Clarified and corrected counting identities (Lemma 1; Corollary 2) and provided a precise “zig-zag” convergence bound via line graphs.\n- Laid out the concrete next technical target: adjacency rules among P/Q types to control k^2(G) and a monotone potential toward a k-null proof for all Whitney discs.\n"
}