{
  "content": "Ideas\n\n- Correct the structure of maximal cliques in k(G) for Whitney triangulations of the disc: a pairwise-intersecting family of facial triangles need not be a vertex-star; the only obstruction is a specific 4-triangle configuration around an interior face. Classifying these families precisely gives a usable description of V(k^2(G)).\n- Consolidate a correct global degree-sum identity for k(G) on discs (with boundary), derived from incident triangle counts at vertices and edges.\n\nRigorous results\n\nLemma A (K4-free for Whitney discs). In a finite Whitney triangulation of the disc G, no K4 subgraph can occur. Consequently, the maximal cliques of G are exactly the facial triangles.\nProof. As noted before: in K4, all four 3-cycles must be faces, impossible in a triangulated disc embedding (at most three can be interior, the fourth would have to be the boundary). ∎\n\nNotation. Let T be the set of facial triangles. For v ∈ V(G), let t(v) be the number of facial triangles incident with v. For an edge e, let t(e) ∈ {1,2} denote the number of facial triangles incident with e; t(e)=1 iff e is a boundary edge, and t(e)=2 iff e is interior.\n\nLemma B (Degree of a face in k(G)). For τ={a,b,c}∈T,\n deg_{kG}(τ) = t(a)+t(b)+t(c) − t(ab) − t(bc) − t(ca).\nProof. A neighbour of τ is a facial triangle meeting τ at a or b or c; triangles through a contribute t(a)−1, etc. Those meeting τ along an edge ab are counted twice; there are exactly t(ab)−1 of them (excluding τ). Summing and simplifying yields the formula. ∎\n\nLemma C (Global degree-sum identity). With notation above,\n Σ_{τ∈T} deg_{kG}(τ) = Σ_{v∈V(G)} t(v)^2 − Σ_{e∈E(G)} t(e)^2.\nIn particular, Σ_{e} t(e)^2 = 3|T| + 2·(# interior edges), and for boundary/interior vertices one can rewrite t(v) as deg(v)−1 / deg(v), respectively.\nProof. Sum the formula from Lemma B over all τ. Each τ contributes t(v) once for each v∈τ, so Σ_{τ}Σ_{v∈τ} t(v) = Σ_{v} t(v)·(# triangles containing v)=Σ_{v} t(v)^2. Similarly, Σ_{τ}Σ_{e∈τ} t(e) = Σ_{e} t(e)·(# triangles containing e)=Σ_{e} t(e)^2. ∎\n\nProposition D (Classification of pairwise-intersecting families). Let F⊆T be a family of facial triangles in a finite Whitney disc triangulation G such that any two members of F intersect. Then either:\n- (Star case) there is a vertex v with F⊆T(v):={τ∈T: v∈τ}; or\n- (Wheel-of-four case) there is an interior facial triangle T0 so that F⊆W(T0):={T0 and its three facial neighbours along the edges of T0}. In particular, if ⋂F=∅, then |F|≤4 and F⊆W(T0) for some interior T0; equality |F|=4 occurs iff F=W(T0).\nProof. If ⋂F≠∅, we are in the star case. Suppose ⋂F=∅. Pick any three T1,T2,T3∈F. Let their pairwise intersections be vertices v1∈T1∩T3, v2∈T1∩T2, v3∈T2∩T3 (they are distinct, else ⋂F≠∅). Since T1 contains v1v2, T2 contains v2v3, and T3 contains v3v1, the 3-cycle v1v2v3 is a triangle of G by the Whitney property; denote it by T0. Consider the planar embedding of G. The union U:=T1∪T2∪T3 forms the boundary triangle T0 with three disjoint wedge regions U12, U23, U31 outward along edges v1v2, v2v3, v3v1 containing the third vertices of T1,T2,T3, respectively. Any triangle τ that avoids {v1,v2,v3} and intersects, say, T1 must lie in U12 (its only possible intersection point is the third vertex on that edge). But then τ cannot simultaneously intersect T2 (it would have to lie in U23) or T3 (in U31), as U12,U23,U31 are pairwise disjoint. Hence any τ∈F intersecting all Ti must contain at least two of {v1,v2,v3}. For an edge e∈{v1v2,v2v3,v3v1}, exactly two facial triangles contain e; one is the corresponding Ti, and the other is T0. Thus the only triangles containing two of {v1,v2,v3} are the three Ti and T0. Therefore F⊆{T1,T2,T3,T0}⊆W(T0), proving the claim. ∎\n\nCorollary E (Clique number bound). For any finite Whitney disc triangulation G, ω(k(G)) ≤ max{max_v |T(v)|, 4}, and every clique of size ≥4 equals W(T0) for some interior triangle T0.\n\nConsequences for k^2(G)\n\n- Vertices of k^2(G) correspond to maximal cliques of k(G), which by Proposition D are exactly:\n  (i) W(T0) for interior faces T0 (size 4), and\n  (ii) T(v) when it is not strictly contained in any W(T0) (in particular, |T(v)|≥2, and if v is a corner of some interior T0 with |T(v)|=3 equal to the two edge-neighbours plus T0, then T(v) is not maximal).\n- Adjacency in k^2(G) can be read off combinatorially:\n  • Two star-vertices T(u), T(v) are adjacent iff uv is an edge of G (the intersection consists of the triangle(s) on uv).\n  • A star-vertex T(v) is adjacent to a wheel W(T0) iff v is one of the three corners of T0 or the third vertex of one of the three neighbours of T0 (the intersection is the corresponding triangle).\n  • Two wheels W(T0), W(T1) are adjacent iff T0 and T1 share an edge (they then share the unique common neighbour triangle along that edge).\n\nExamples and checks\n\n- Minimal “wheel-of-four” (hexagon with chords 13,35,51): k(G) has a K4 on the four triangles W(T0). Thus k^2(G)≅K1 (k-null in two steps). This is a counterexample to the earlier (incorrect) claim that maximal cliques of k(G) are vertex-stars.\n- Two-triangle disc: k(G)=K2; the unique maximal clique is {both faces} which equals T(v) for the common-edge endpoints v; hence k^2(G)≅K1.\n\nObstacles\n\n- Classifying exactly when a star T(v) is maximal requires a careful case analysis of deg_face(v) and local configurations; deg_face(v)=1 never yields a maximal clique; deg_face(v)=3 at a corner of an interior triangle is contained in a wheel; deg_face(v)=2 can be maximal (e.g., the two-triangle disc), but need not be if extendable by a wheel.\n- A global monotone potential Φ under G↦k^2(G) for arbitrary disc triangulations remains to be pinned down; Proposition D suggests Φ counting interior faces (wheels) plus the number of maximal stars could work.\n\nNext steps\n\n1) Formalize the “star maximality” criterion: necessary and sufficient conditions on the cyclic order of triangles at v ensuring T(v) is maximal in k(G). Prove: T(v) is non-maximal iff either |T(v)|=1, or |T(v)|=3 and v is a corner of an interior face whose three neighbours exhaust T(v).\n2) From the adjacency rules above, derive a precise description of k^2(G) and prove that the potential Ψ(G):= (# interior faces) + Σ_v max(|T(v)|−3,0) strictly decreases under k^2, at least for maximal outerplanar discs; verify on small patches computationally.\n3) Extend the planarity wedge argument to general closed surfaces to control large cliques in k(G) and to isolate divergence mechanisms for Question 2 (sphere), benchmarking against octahedron/icosahedron.\n"
}