{
  "progress_md": "Round 0013 — Towards a sound Stage‑2 (O(1) vs Θ(log* n)) on oriented paths: typed anchors + corrected partition injectivity; small audits, new lemmas, and NEXPTIME checks\n\nSummary of this round\n- I propose a type‑based “anchor” certificate f_anc that avoids the earlier length/phase mismatch and does not rely on tiling a long block by a single quadruple Q_τ. The anchors are 2‑node windows placed at a canonical phase inside long periodic runs; they only fix seam colors and rely on Ext‑based bridging to fill the O(1) gaps. All checks are reducible to finite Ext/Bridging matrices and verifiable in NEXPTIME (single‑exponential in β).\n- I give a corrected per‑component injectivity lemma for the irregular remainder Pirreg and an O(1) greedy MIS construction on the ℓ_pattern‑th power of each Pirreg component. This patches the partition lemma gap flagged in the feedback (explicitly avoiding the distance‑mixing issue and boundary leaks). The parameters and proof outline are stated fully so they can be curated into output.md after polishing.\n- I add two small, unit‑testable identities: a reversal identity for W‑matrices (useful to cut verification work by ≈2×) and a formal “no tiling” counterexample to document why Q_τ cannot be naively repeated.\n- Minor output.md hygiene: an indexing reminder near OutR2/OutL1, and a cross‑reference for Lemma E3 where Out‑sets and W are used.\n\nAudit of output.md (gaps/clarifications)\n- OutR2/OutL1 indexing. Suggest adding, immediately after the Definition “Feasible function; Out‑set form,” a one‑liner “Indexing reminder: Ext quadruples are (L1,L2,R2,R1), hence the middle block’s left seam meets o1 and right seam meets o4.” This is used implicitly in Lemma E3.\n- Stage‑2 is intentionally absent (good per the verifier). The proposed additions below (typed anchors + corrected partition) are designed to be inserted as a new Stage‑2 section once curated.\n\nPart I — Typed anchor certificate for Stage‑2 (avoids length/phase mismatch and tiling)\nIdea at a glance\n- Instead of tiling long periodic blocks by Q_τ, we place 2‑node anchors at a canonical phase in each period and require two kinds of finite checks:\n  (A) self‑compatibility of the anchor within a periodic context (no collisions when repeating anchors at period‑spacing), and\n  (B) bridging existence across any short middle type τ_S between two anchored contexts (including the empty middle and one‑sided endpoint cases).\n- All checks are expressed via Ext concatenations and Bridging matrices on short types; no word enumeration, no full‑period outputs.\n\nObjects\n- T, T_long, Ext, W_{b⊙c} as in output.md. Fix constants (as in the paper and notes): ℓ_pattern := ℓ_pump, ℓ_width := ℓ_pump, ℓ_count := 2ℓ_pump + 2.\n- Period base types: Let T_base := {σ ∈ T : k_flag(σ) ∈ {1,2,3} and 1 ≤ |σ| ≤ ℓ_pattern}. Intuitively, σ represents a short block of length p ≤ ℓ_pattern that can act as a period tile when repeated.\n  Remark. We avoid word‑level primitive testing; instead, the verifier (see below) checks only those σ that actually appear as a base in some long periodic type realized by σ^{⊙k} for k ≥ ℓ_count (all in type space via Ext‑concatenation).\n- Long periodic types from a base σ: define Π(σ) := {τ ∈ T_long : ∃k ≥ ℓ_count with τ ≡ Type(σ^{⊙k})} (computed by repeated concatenation in T). This is singly‑ex enumeratable since σ ∈ T and k ≤ ℓ_count is a constant depending only on β.\n\nCertificate (typed anchors)\n- For each σ ∈ T_base used by the certificate, choose a phase m ∈ {0,1,…,|σ|−1} and an anchor pair a(σ) = (α1(σ), α2(σ)) ∈ Σ_out^2.\n- Canonical phase selection rule (executed locally in O(1) inside Plong): On a long period run whose long type lies in Π(σ), nodes know |σ| and rank mod |σ| (from the partition); the anchors are exactly those two‑node windows whose left endpoint has rank ≡ m (mod |σ|). This fixes one anchor per period, spaced by |σ|.\n\nTyped anchor feasibility checks (finite, NEXPTIME)\nLet σ ∈ T_base. Define τ = any member of Π(σ) (choice irrelevant by periodic pumping; picking the τ with k = ℓ_count suffices). Let α(σ):=a(σ).\n- (F1‑anc self‑compatibility): Repeatability of anchors at period spacing:\n  There exists a witness in Ext for the middle σ of σ ⊙ σ ⊙ σ, such that the seam edges toward the two neighbors are E‑adjacent to α(σ) on both sides. Formally, define M_self[σ] := “W_{σ⊙σ}[α(σ)][α(σ)] = true”. This guarantees that placing anchors at phase m in consecutive periods imposes no conflict across the intervening σ block. Because of associativity (Prop. 12), iterating this condition yields consistency for any number of repeats.\n  Why this captures local legality: the adjacency E(α1,α2) and node constraints at the two anchor nodes are baked into the Bridging table via Ext (the middle block σ must accept α(σ) on both seams to be extensible); we do not need to read input bits explicitly.\n- (F2‑anc bridging across arbitrary short middle type): For every τ_S ∈ T (including τ_S = ∅) and for every pair of periodic long types τ_L ∈ Π(σ_L), τ_R ∈ Π(σ_R), require bridging across τ_S from α(σ_L) to α(σ_R):\n  Bridging[τ_S][α(σ_L)][α(σ_R)] = true, where Bridging[τ_S] is the β×β mask defined in the notes and computable from Ext_{τ_S} and E.\n- (F3‑anc endpoints one‑sided): For every τ ∈ Π(σ) and every τ_S ∈ T,\n  • left endpoint: ∃(o1,o2,o3,o4)∈Ext_{τ_S} with E(o4, α1(σ)), i.e., α1(σ) ∈ N_E(RightAllow(τ_S)), and\n  • right endpoint: ∃(o1,o2,o3,o4)∈Ext_{τ_S} with E(α2(σ), o1), i.e., α2(σ) ∈ N_E^{-1}(LeftAllow(τ_S)).\nThese are the one‑sided analogues of Stage‑1’s V_left/V_right, now phrased via Ext projections of τ_S.\n\nWhy this is enough for an O(1) algorithm (to be added after partition is curated)\n- Compute in O(1) the (ℓ_width,ℓ_count,ℓ_pattern)‑partition (Part II). On each P ∈ Plong with long type in Π(σ), place anchors at the canonical phase m modulo |σ|.\n- The anchors carve P ∈ Plong into O(|σ|)=O(1) gaps (each equal to σ). Gaps between distinct Plong blocks, and all of Pshort components, have length O(ℓ_pump) by construction. Use (F2‑anc) to fill each such gap S (between left α(σ_L) and right α(σ_R)), and (F3‑anc) at endpoints, by table lookups; (F1‑anc) ensures no conflicts between adjacent anchors inside the same Plong block.\n- Everything depends only on constant‑radius information and precomputed tables; hence O(1) LOCAL rounds.\n\nNEXPTIME verification of f_anc (single‑exponential)\n- Enumerate T (Prop. 9), compute Ext_τ for τ∈T and Bridging[τ_S], RightAllow/LeftAllow of each τ_S. For each σ ∈ T_base and k ∈ [ℓ_count], compute Type(σ^{⊙k}) via Prop. 5 to populate Π(σ).\n- Check F1‑anc for each σ by querying W_{σ⊙σ}[α(σ)][α(σ)]. Check F2‑anc for all triples (σ_L,τ_S,σ_R) and all τ_L ∈ Π(σ_L), τ_R ∈ Π(σ_R) by Bridging[τ_S][α(σ_L)][α(σ_R)]. Check F3‑anc for all (σ,τ_S) via precomputed allow‑sets.\n- Total work: |T_base|·β^O(1) for F1, |T_base|^2·|T|·β^O(1) for F2, and |T_base|·|T|·β^O(1) for F3; with |T| ≤ 4·2^{β^4}, this is 2^{poly(β)}.\n\nNotes on correctness vs earlier gaps\n- No tiling by Q_τ: We never assume a reusable interior tile; σ ⊙ σ compatibility (F1‑anc) is enforced by W and guarantees only that anchors coexist when separated by one σ, which by associativity extends to any number of periods.\n- No phase/length mismatch: The algorithm fixes a canonical m modulo |σ| and only places anchors at that phase. The check is independent of the actual bit pattern and uses Ext tables to ensure local legality via extendibility.\n\nPart II — Corrected partition: injectivity in Pirreg and an O(1) MIS\nParameter recap\n- ℓ_width = ℓ_pattern = ℓ_pump, ℓ_count = 2ℓ_pump + 2, as in output.md prose.\n- Lwin = (ℓ_count + 2ℓ_width)·ℓ_pattern + (ℓ_pattern − 1). This is chosen so that equal length‑Lwin windows at shift p ≤ ℓ_pattern imply a p‑periodic substring of length ≥ (ℓ_count + 2ℓ_width)·p fully contained in the union interval (Fine–Wilf), see below.\n\nConstruction (directed case; undirected handled by an initial ℓ‑orientation as in the paper)\n1) Detect and trim long periodic runs (unchanged): For each p ∈ [1..ℓ_pattern] and each short type σ of length p, identify maximal σ^{⊙K} runs with K ≥ ℓ_count + 2ℓ_width. Trim ℓ_width·p nodes from both ends. The interiors form Plong; the remainder is Pirreg.\n2) Define legal window colors on Pirreg: For each directed component H of Pirreg, define c(v) for a node v ∈ H that has at least Lwin successors also in H, as the binary window of length Lwin starting at v and fully contained in H. Nodes within Lwin−1 from the H‑boundary are marked boundary and will not attempt to join the MIS (handled by the fallback cuts below).\n3) Injectivity lemma (per component, induced metric). For any H, if u,v ∈ H with dist_H(u,v) ∈ [1..ℓ_pattern], and both have defined colors c(u)=c(v), then H contains a p‑periodic subpath of length ≥ (ℓ_count + 2ℓ_width)·p for p = dist_H(u,v). This contradicts the construction of Pirreg, since such a subpath would have been captured (and trimmed) in step 1.\n  Proof sketch. Let P_H be the unique directed simple path in H from u to v (length p ≤ ℓ_pattern). Since both length‑Lwin windows at u and v lie entirely within H and are identical, the standard Fine–Wilf lemma implies that the length‑(Lwin+p) union interval (in the ambient path) is p‑periodic. Because P_H is contained in H, the entire union interval also lies within H (by the choice of c(·) we excluded windows spilling outside H), yielding a p‑periodic subpath inside H of length at least Lwin ≥ (ℓ_count+2ℓ_width)·ℓ_pattern ≥ (ℓ_count+2ℓ_width)·p. This would have created a run σ^{⊙K} with K ≥ ℓ_count + 2ℓ_width in step 1, hence is impossible in Pirreg.\n4) Greedy MIS on the ℓ_pattern‑th power of H in O(1): Process color classes in any fixed total order on {0,1}^{Lwin}. In the phase for color x, a node with c(·)=x joins I_H if none of its predecessors within distance ≤ ℓ_pattern in H has already joined. By the injectivity (step 3), no two conflicting nodes share a color within distance ℓ_pattern, so the greedy per‑color process yields an MIS on the ℓ_pattern‑power. Consequently, each component of H\\I_H has directed length in [ℓ_pattern, 2ℓ_pattern].\n5) Final partition: Plong are as in step 1. Pshort consists of (i) all components of H\\I_H over all H (each length ∈ [ℓ_pattern, 2ℓ_pattern]), and (ii) for boundary nodes within distance < Lwin of H’s endpoints, attach them to neighboring Pshort pieces to ensure every piece has length ≥ ℓ_width (this is feasible since Lwin ≫ ℓ_width). Each node knows its role and rank in O(1) rounds.\n\nRemarks\n- All constants depend only on β; the number of color phases 2^{Lwin} is a large constant, but the LOCAL time is O(1).\n- This fixes the feedback issues: injectivity is proved within the induced metric of H, and colors are defined only by windows fully contained in H, preventing “leaks” into trimmed interiors.\n\nPart III — Small, testable identities and examples\n1) Reversal identity for W.\nLemma W‑rev. For any τ_b, τ_c ∈ T and α_L,α_R ∈ Σ_out,\n  W_{Rev(τ_c) ⊙ Rev(τ_b)}[α_R][α_L] = W_{τ_b ⊙ τ_c}[α_L][α_R].\nProof. Combine Lemma 10 (Rev) with the definition of W via Ext and E, and swap coordinates.\nUse. Halves the number of distinct W‑checks in preprocessing and in Stage‑2 verification.\n\n2) “No tiling by Q_τ” counterexample (documenting a pitfall).\nLet Σ_out={a,b}, A_0=A_1={a,b}, and E={(a,b)} (single directed edge). For a length‑4 block τ with Ext_τ containing (a,b,b,a) and (a,b,b,b), one can pick Q_τ=(a,b,b,a)∈Ext_τ and E(R1_τ,L1_τ)=E(a,a) fails. Even if a different Q_τ has E(R1_τ,L1_τ) true, repeating Q_τ creates two adjacent b at the seam (needs E(b,·)), which is impossible. Hence Ext_τ does not imply an interior tile repeatable at period‑1. This illustrates why our anchor‑only approach is needed.\n\n3) Early rejection filters for anchors.\n- If for some σ, W_{σ⊙σ}[α][α] is false for every α∈Σ_out^2, σ cannot be a usable base; skip σ.\n- If Bridging[τ_S] has a row or column of all false entries for some τ_S, any certificate must fail; reject early.\n\n4) Sanity examples.\n- Equality LCL: take any σ, set α(σ)=(c,c); all F1–F3 pass trivially.\n- Proper 2‑coloring: With E={(0,1),(1,0)}, any attempt to anchor at period‑1 fails F1‑anc (W_{σ⊙σ}[α][α]=false). Stage‑1 feasible f still exists; classification Θ(log* n).\n\nPart IV — How to integrate (suggested edits)\n- Add the typed anchors section as Stage‑2 (path version): objects, certificate (σ,m,α(σ)), feasibility checks (F1–F3), and the O(1) construction sketch. Defer inserting the full partition proof until Part II is curated. Explicitly point out that all verification reduces to finite Ext/Bridging tables.\n- Insert Lemma W‑rev in the preprocessing section to shrink checks; reference it in Stage‑1/2.\n- In the Stage‑1 section, add the short Indexing reminder after Lemma E3 as noted above.\n\nWhy these steps are incremental and auditable\n- The anchor checks (F1–F3) are boolean matrix queries over objects already defined (Ext, W, Bridging, allow‑sets). They can be unit‑tested directly on small β.\n- The corrected injectivity lemma is local to each Pirreg component and uses only standard Fine–Wilf periodicity; it fixes the earlier distance‑mixing flaw and is independently testable.\n- The reversal identity for W is an immediate corollary of existing lemmas (Rev + Ext‑concatenation); it reduces implementation burden and can be asserted with a simple proof.\n\nOpen items\n- Provide the full, polished write‑up of Part II’s partition (directed and undirected cases), including the small boundary‑aggregation argument in step 5.\n- After integrating the partition, complete the (⇐) proof: full O(1) algorithm using typed anchors + Bridging tables on oriented paths. Finally, add the NEXPTIME verification argument tying together F1–F3.\n"
}