{
  "content": "Ideas\n- Recast kG for Whitney triangulations. For a finite Whitney triangulation G of a disk, every maximal clique of G is a face (triangle); hence V(kG) ≅ F(G). Two faces are adjacent in kG if and only if they share a vertex. Equivalently, kG is obtained by taking, for each vertex v ∈ V(G), the set T(v) of faces incident to v and making T(v) a clique, then taking the union over all v.\n- The central structural problem is to understand the maximal cliques of kG. Trivial cliques come from stars T(v) around vertices v, but there are also cliques that do not have a common vertex (e.g., for an interior face t=abc, the set {t} together with the three faces adjacent across ab, bc, ca).\n- Goal: Classify maximal cliques of kG in Whitney disk triangulations. As a consequence, attempt k^2-structure and k-nullness in special families (notably outerplanar triangulations and fans). Provide rigorous lemmas and special-case proofs.\n\nBasic facts and clean lemmas\nLemma 1 (No K4 in a disk Whitney triangulation; maximal cliques of G are triangles). Let G be the underlying graph of a finite Whitney triangulation of a disk. Then G has no K4 subgraph. Consequently, the maximal cliques of G are exactly the triangular faces.\nProof. Since every 3-cycle in G bounds a face, a K4 subgraph would force its four 3-cycles to be faces. Each of the six edges of K4 belongs to exactly two of these four faces; hence these six edges cannot be incident with any other face of the triangulation. Thus K4 would be a closed component of the 2-complex, contradicting that we triangulate a connected disk with nonempty boundary. Therefore no K4 occurs. Every edge of G is contained in a face, so no edge is a maximal clique; and since K4 is forbidden, a triangle cannot be contained in a larger clique. ∎\n\nNotation. For a vertex v of G, let T(v) be the set of faces incident to v. For a face t with edges e1, e2, e3, denote by N(t) the set consisting of t itself together with, for each interior edge ei of t, the unique other face across ei. Thus |N(t)| ∈ {2,3,4} depending on how many edges of t are interior.\n\nLemma 2 (Vertex-stars yield cliques; their maximality). Let v be an interior vertex of G.\n- T(v) is a clique in kG.\n- If deg(v) ≥ 4, then T(v) is a maximal clique of kG.\n- If deg(v) = 3 with N(v) = {a,b,c}, then T(v) ∪ {abc} is a clique of size 4 and is the unique maximal clique containing T(v).\nProof. The first claim: any two faces in T(v) meet at v, so they are adjacent in kG. For maximality when deg(v) ≥ 4: the open neighborhood induced by N(v) in G is a chordless cycle; in particular, among neighbors of v there are no chords (else some neighbor-edge would be in ≥3 faces). A face f not containing v has only three vertices, so it cannot meet all faces in T(v): indeed f could meet at most three consecutive faces around v, but when deg(v) ≥ 4 there exist faces in T(v) disjoint from those three vertices. Hence T(v) is maximal. For deg(v) = 3, the neighbors a,b,c form a triangle abc, which is necessarily a face. Then T(v) ∪ {abc} is a 4-clique in kG. Any face not containing v and meeting all three faces (vab),(vbc),(vca) must contain at least two of {a,b,c}, hence would be abc itself; thus the 4-clique is maximal. ∎\n\nLemma 3 (Triangular 4-cliques). If t is an interior face (all three edges interior), then N(t) has size 4 and induces a K4 in kG. Moreover, N(t) is a maximal clique of kG.\nProof. The three faces across the edges of t each share an edge with t and pairwise meet at the three vertices of t, so N(t) is a clique. If a face f ∉ N(t) met all faces in N(t), then f would meet each of the three edge-neighbors of t; since those three meet pairwise only at the vertices of t, f would have to contain at least two vertices of t to meet all three — impossible unless f=t, contradiction. Thus N(t) is maximal. ∎\n\nRemark. For boundary faces t (with some boundary edge), N(t) is a clique of size 2 or 3; whether it is maximal depends on local degrees at the edge-neighbors.\n\nConsequence (bounded non-star cliques). Any clique in kG that does not have a common vertex has size at most 4, and equality implies it is of the form N(t) for an interior face t.\nSketch. Let S be a clique with no common vertex. Choose t ∈ S minimizing the number of boundary edges; then each f ∈ S must meet t. If S contains a face f not sharing an edge with t, then f meets t in exactly one vertex. With two distinct such faces f1,f2 ∈ S meeting t in different vertices, pairwise intersection forces any g ∈ S to meet each among t,f1,f2; this is only possible when S ⊆ N(t). The detailed case split (edge-sharing vs single-vertex-sharing) yields S ⊆ N(t), hence |S| ≤ |N(t)| ≤ 4; if |S|=4 then t must be interior. This reduction can be checked locally and is robust under the Whitney constraints (each edge in at most two faces and each 3-cycle a face).\n\nSpecial cases proving k-null\nCase A: Fans (one interior vertex). Let G be a triangulation of a polygon obtained by joining a single interior vertex v to every boundary vertex. Then every face contains v, so kG is complete: kG ≅ K_f where f is the number of faces. Hence k^2G ≅ K1 and the sequence is stationary afterward. Thus all fans are k-null (in 2 steps).\n\nCase B: Two faces sharing an edge. If G has exactly two faces (two triangles sharing an edge), then kG ≅ K2 and k^2G ≅ K1; hence k-null.\n\nCase C: Single interior triangle. Consider a triangulated polygon obtained by adding three diagonals forming a single interior triangle t (and the three adjacent boundary faces). Then kG ≅ K4, so again k^2G ≅ K1.\n\nCase D: Paths in the weak dual (illustrative small examples). If the weak dual of a maximal outerplanar triangulation is a path P_m (e.g., stacked triangulations), then direct computation for small m shows:\n- m=3: kG ≅ K3, then k^2G ≅ K1.\n- m=4: kG has maximal cliques {1,2,3} and {2,3,4} (indices along the dual path); k^2G ≅ K2, then k^3G ≅ K1.\n- m=5: kG’s maximal cliques are {1,2,3},{2,3,4},{3,4,5}; k^2G ≅ K3, then k^3G ≅ K1.\nThese computations support that all stacked outerplanar triangulations are k-null, with the number of iterations bounded by ⌈(m−1)/2⌉+1. A general inductive proof for all maximal outerplanar triangulations seems within reach (see Next steps) but is not fully written here.\n\nHeuristic picture for general disk triangulations\n- The structure of kG is governed by the family of cliques T(v) (interior vertices v of degree ≥ 4) and the 4-cliques N(t) around interior faces t. Lemma 2 and Lemma 3 strongly constrain the maximal cliques of kG: all maximal cliques are either T(v) with deg(v) ≥ 4 (and, for deg(v)=3, extended uniquely to N(t) with t=N(v)) or of the form N(t) for interior t (size 4). In particular, ω(kG) = max{ max_{v interior} deg(v), 4 }.\n- This strongly suggests a coarse two-level alternation under k: from G (triangles) to kG (vertex-stars and interior-face quads), then k^2G where vertices represent these maximal intersecting families, and so on. In many disk triangulations, this coarse alternation appears to drive the dynamics to a complete graph quickly (hence k-null), as seen in the cases A–D.\n\nObstacles and limitations\n- The precise description of all maximal cliques of kG for general Whitney disk triangulations needs a complete proof that any clique without a common vertex lies inside N(t) for some face t (we provided a proof sketch and a local planarity-based argument to reduce to this situation). Tightening this to a full proof is a critical step.\n- Even with the above classification, determining k^2G in closed form (and iterating) requires understanding intersections among the families {T(v)} and {N(t)}. Some pairs may be disjoint, so k(kG) need not be complete in one step.\n- For maximal outerplanar graphs (no interior vertices), a conceptual proof that all are k-null is very plausible via weak dual trees and ear decompositions, but a fully rigorous, general argument (beyond the computed small path cases and fans) remains to be written here. The earlier tempting identity kG ≅ (weak dual)^2 is false in general (counterexample: fan), so a different invariant is needed.\n\nNext steps (concrete, testable work)\n1) Formalize and prove the “bounded-size non-star cliques” lemma rigorously: In Whitney disk triangulations, any pairwise-intersecting family of faces with no common vertex has size ≤ 4 and is contained in N(t) for some interior face t. This can be verified locally via case analysis around shared edges/vertices using that (i) open neighborhoods of interior vertices are chordless cycles, (ii) each edge lies in ≤ 2 faces.\n2) Classify maximal cliques of kG completely: show they are exactly T(v) for interior v with deg ≥ 4 and N(t) for interior t, plus determine boundary-vertex contributions (most often non-maximal). This is primarily local.\n3) Outerplanar case: Prove by induction on the number of faces that maximal outerplanar triangulations are k-null. A promising route: remove an ear T; analyze how k behaves with respect to the decomposition at the ear’s interior edge in terms of maximal cliques of kG, and show that the number of maximal cliques strictly decreases under k until a complete graph appears.\n4) Mixed-degree interior: For disk triangulations with interior vertices of degree ≥ 5 except for finitely many degree-3 vertices, try to show k-null by showing that large T(v) cliques intersect all N(t) cliques and force k(kG) to be complete. Start with the case “all interior vertices have degree ≥ 5 except possibly isolated degree-3 vertices no two sharing a face.”\n5) Computational check: Generate random Whitney triangulations of the disk with small sizes (say up to 20 faces), compute k-iterations, and attempt to find a counterexample to k-nullness. If none appears, examine the structure of k^2G to identify invariants decreasing under iteration (e.g., size of a minimum hitting set by vertices for the faces).\n\nSummary of provable contributions\n- Clean structural lemmas (no K4, maximal cliques of G are triangles; Lemma 2 and Lemma 3) with proofs.\n- Exact k-null behavior for fans, for two-face disks, and for the “single interior triangle” disks.\n- A plausible and partially justified classification of maximal cliques of kG and a bound ω(kG) ≤ max{deg_int, 4}.\n- A concrete plan to settle outerplanar disks (very likely all k-null) and to push toward the general disk case.\n\nThese items can be ported to proofs.md (Lemmas 1–3) and notes.md (heuristics, obstacles, and next steps), and the special-case outcomes to output.md as interim results."
}