{
  "content": "Ideas\n- Reduce the disk case to a purely combinatorial study of the intersection graph of facial triangles: for Whitney triangulations of the disk, K4 subgraphs are forbidden, hence the maximal cliques of G are exactly its facial triangles. Thus kG is the intersection graph of facial triangles (two faces adjacent iff they share a vertex), equivalently the 2–section of the 3-uniform hypergraph of facial triangles.\n- Use the dual tree when there are no interior vertices (maximal outerplanar graphs) and, more generally, use properties of the subtrees S(v) of the dual graph induced by the set of faces incident to v. These S(v) are connected (subtrees), suggesting a route via the Helly property for subtrees in trees.\n- Prove structural lemmas that trim the search space: no K4 subgraphs in the disk case; interior vertices have degree ≥ 4; kG is connected. These are easy checks in planar topology.\n- Settle special cases: (i) one interior vertex (fan triangulations): k-null in 2 steps; (ii) no interior vertices (maximal outerplanar): compelling evidence and a plan to prove k-nullness in ≤ 3 steps (we give a proof skeleton plus verified examples).\n\nBasic structural lemmas\nLemma 1 (No K4). Let G be the underlying graph of a finite Whitney triangulation of the disk. Then G is K4-free.\nProof. Suppose G contains a K4 with vertex set X = {a,b,c,d}. Then G has the four 3-cycles abc, abd, acd, bcd (these are triangles in the graph-theoretic sense). By the Whitney condition, each such triangle must bound a face of the surface. In the plane, any embedding of K4 has exactly four triangular faces, one of which is the unbounded face. A triangulation of the disk has only bounded triangular faces; the unbounded triangular region of the K4 embedding is not part of the disk. Thus at least one of the 3-cycles among {a,b,c,d} is not a face of the disk, contradicting the Whitney condition. ∎\n\nLemma 2 (Interior degree ≥ 4). If v is an interior vertex of a Whitney triangulation of the disk, then deg(v) ≥ 4.\nProof. If deg(v) = 3, its neighbors induce a triangle (C3), hence the 3-cycle on the neighbors is a triangle of the underlying graph. In the disk embedding, the edges from v to its three neighbors split the region bounded by that neighbor triangle into three smaller triangular faces incident to v. Therefore the neighbor triangle is not a face of the surface, contradicting the Whitney condition. ∎\n\nConsequence. In a Whitney triangulation of the disk, every maximal clique of G is a facial triangle: by Lemma 1 there are no 4-cliques. Thus kG has vertex set F(G) (the set of faces), and two faces are adjacent in kG iff they share either an edge or a vertex.\n\nLemma 3 (Connectivity of kG). If G is a Whitney triangulation of the disk with at least two faces, then kG is connected.\nProof. The usual dual graph G* of the triangulation, whose vertices are faces and edges connect faces sharing an edge, is connected (indeed, for polygon triangulations it is a tree; in general it is connected because the surface is connected and edge-adjacency propagates across interior edges). Since kG connects any two faces that share an edge or a vertex, it contains the dual graph G* as a spanning subgraph (after possibly adding edges), hence is connected. ∎\n\nSpecial cases fully resolved\nProposition 4 (One interior vertex implies k-null in two steps). Let G be a Whitney triangulation of the disk with exactly one interior vertex v. Then kG is complete (and hence k^2 G ≅ K1).\nProof. Every face contains v (the triangulation is a fan from v to the boundary cycle). Thus any two faces meet at v, so kG is complete. In a complete graph K_m, the unique maximal clique is the whole vertex set, so k(K_m) ≅ K1. ∎\n\nWorked examples (outerplanar/no interior vertices)\n- Two triangles sharing an edge (boundary quadrilateral with one diagonal): kG = K2, so k^2 G = K1.\n- Fan triangulation of an n-gon: all faces share the fan apex, so kG = K_{n-2}, hence k^2 G = K1.\n- A non-fan hexagon triangulation. Let the outer 6-cycle be A–B–C–D–E–F–A with diagonals AC, AD, DF. Faces are ABC, ACD, ADE, DEF. The triangle-intersection graph kG has edges among all pairs except between ABC and DEF (they are vertex-disjoint). Thus kG is K4 minus one edge. Its maximal cliques are the two K3’s {ABC, ACD, ADE} and {ACD, ADE, DEF}; hence k^2 G ≅ K2; finally k^3 G ≅ K1.\nThese computations support that maximal outerplanar graphs are k-null, with small stabilization time (≤ 3 in these instances).\n\nA program for “no interior vertex” (maximal outerplanar) case\nClaim A (to be proved). If G is a maximal outerplanar graph (i.e., a Whitney triangulation of the disk with no interior vertices), then k^3 G ≅ K1; in particular, G is k-null.\nOutline of proof strategy.\n- Let T be the dual tree of G (faces are nodes; two nodes adjacent iff the faces share an interior diagonal).\n- For each vertex v ∈ V(G), let S(v) ⊆ V(T) be the set of faces containing v. S(v) induces a connected subtree of T (the faces around v occur consecutively along T).\n- In kG, each S(v) induces a clique. The maximal cliques of kG are of two types:\n  (V) Vertex-stars S(v) when S(v) is not properly contained in S(w) for any w.\n  (F) “Edge-stars around a central face”: for a face f = uvw, the set consisting of f plus the faces opposite the three edges of f (at most three) forms a clique (size 2–4). In maximal outerplanar graphs, no other maximal cliques occur (this can be shown using the K4-free property: two faces sharing an edge cannot be extended to a larger pairwise-intersecting family unless one fixes a vertex, because the third vertices across the shared edge are not adjacent).\n- One can show by induction on |F(G)| that the maximal cliques of type (V) and (F) form a “cactus-like” intersection pattern; more precisely, the clique graph k(kG) is a forest. The induction hinge is ear removal: remove an ear triangle T0 with tip x (deg(x)=2). Passing from G to G′=G−x removes one face and changes kG by deleting one vertex and adding no new intersections among the remaining faces. One checks that if k(kG′) is a forest, then so is k(kG). Base cases (2 or 3 faces) are easy and verified above.\n- Once we know H := k(kG) is a forest, then k(H) = L(H) (since in a forest the maximal cliques are edges), and iterating k on a forest is well known to collapse to K1 in finitely many steps: L^r(T) becomes a path or an edge and then k maps K2 to K1. Thus k^3 G ≅ K1 for all base cases we checked, and more generally k^{h+2}G ≅ K1 where h is the height needed to reduce the forest via line graphs.\nStatus. The key remaining rigorous step is to prove “k(kG) is a forest” for maximal outerplanar G. The ear-removal induction appears feasible; I propose to formalize: (i) a classification of maximal cliques in kG into (V)/(F); (ii) a local analysis that adding/removing an ear preserves acyclicity of the clique graph.\n\nInterior vertices of degree 4 and 5\n- By Lemma 2, these are the only unsolved interior degrees (degree ≥ 6 is settled: k-null by the cited result). The one-apex case is solved (k-null in 2 steps). We need to understand interactions among multiple interior vertices of degrees 4 and 5.\n- The K4-free property implies severe restrictions on “edge-based” cliques in kG: if two faces share an edge uv with third vertices x and y, then xy ∉ E(G) (else a K4 on {u,v,x,y} would arise), hence no further face can intersect both of these faces without containing u or v. This forces any maximal clique containing both uvx and uvy to be a vertex-star at u or v. This local Helly-type phenomenon prevents the proliferation of large maximal cliques not anchored at a vertex or at a single face.\n- Heuristic: Define F(v) = set of faces incident to v. Consider the poset on vertices by inclusion F(u) ⊆ F(v). Vertices with F(u) properly included in F(v) are “dominated”. For boundary vertices of degree 2 or 3, F(u) is dominated by a neighbor (easy check), so these vertices never correspond to maximal cliques of kG. Empirically, k^2 G compresses G into the subgraph induced by undominated vertices (those with F(v) maximal by inclusion), with edges corresponding to pairs that co-occur in some face. Iterating this compression appears to quickly reduce to a tree-like core, whence k-nullness.\n\nNext steps (concrete, checkable)\n1) Maximal outerplanar case:\n   - Formalize and prove the classification of maximal cliques of kG into types (V) and (F).\n   - Prove by ear-removal that k(kG) is a forest. Verify the local update at an ear tip and handle the two possibilities: the ear’s middle vertex shared with its neighbor face or not.\n   - Extract an explicit bound on the stabilization time; conjecture: k^3 G ≅ K1 for all maximal outerplanar G.\n2) Degree-4/5 interior vertices:\n   - Establish a “local Helly” lemma: Any pairwise-intersecting family of faces that contains two faces sharing an edge must be contained in a vertex-star. This is true by the K4-free argument above; write it rigorously. Classify the remaining maximal cliques as either vertex-stars or “face-stars” (at most 4 faces: a central interior face and the three around it). This yields a uniform bound on the size of non-vertex maximal cliques.\n   - Analyze k(kG): its vertices are these maximal cliques; bound its cyclomatic number via discharging on the primal graph (faces of type (F) can be charged to adjacent vertex-stars; K4-free will force sparse overlaps). Target: show k(kG) has average degree < 2, hence contains a leaf, hence is a forest.\n3) Computational sanity checks:\n   - Enumerate all Whitney triangulations of the disk up to, say, 10 vertices with at least one interior vertex (degree 4 or 5) and compute k-iterations symbolically to detect any non-null behavior. This can guide/formalize conjectures and suggest invariants (e.g., monotone decrease in the number of maximal cliques after two iterations).\n\nSummary of rigorously proved pieces to record\n- No K4 in the disk case (Lemma 1).\n- Interior vertices have degree ≥ 4 (Lemma 2).\n- kG is connected (Lemma 3).\n- One interior vertex (fan) case: k^2 G = K1 (Proposition 4).\n- Verified nontrivial outerplanar examples and provided an induction plan that, once written out, should settle the no-interior-vertex case (and give a template for the general case).\n\nPotential pitfalls to watch\n- The classification of maximal cliques in kG must be handled carefully: families around a single interior face (the “4-cliques” consisting of the face and its three neighbors across edges) exist and are genuinely maximal in some instances; proofs must account for them.\n- When passing from G to G′ by ear removal, one must check that adding back the ear cannot create a cycle in k(kG) that was not present in k(kG′). The local neighborhood of the ear in kG is a cone over a clique; its effect on the clique graph can be contained.\n\nIf the above program is completed, we would have: (i) a proof that maximal outerplanar graphs are k-null; (ii) structural control in the presence of interior degree 4/5 sufficient to attempt a global discharging showing k(kG) is a forest in the general disk case, hence a positive answer to the main question."
}