{
  "content": "Ideas\n\n- Sharpen Theorem 3.3 (out-arborescence with leaves satisfying a δ+-common property): replace the factor 2 in the “2kℓ^k” term by 1 + 1/(ℓ−1). This yields a smaller δ+ threshold, provably sufficient by a refined greedy packing argument.\n- Reduce the parameter h used in Theorem 3.4 (the size of the in-star subdivision we require at the leaves) from 3kℓ^{k+1} down to kℓ^{k+1} + 2ℓ^k + ℓ. This lowers the bound fed into f(k,h) from [1], and propagates to a significantly smaller quantitative δ+ bound (since f grows very quickly in h).\n- Point out a gap in the proof of Theorem 4.3 (linear bound for S^-_{2,ℓ}): the step “by maximality of s, all these paths have their first vertex in Q” is not justified. Propose a corrected counting that gives a slightly weaker inequality; the original constant 3.56 seems to require a different augmentation argument.\n\nImprovement 1: Sharpen Theorem 3.3\n\nStatement (sharpened). Let ℓ ≥ 2, k ≥ 1, and let P be a δ+-common property with threshold d(P). Define\n- M := (ℓ^k − 1)/(ℓ − 1), and\n- β := ℓ^k + M.\nIf δ^+(G) ≥ d(P) + kβ, then G contains a copy B of B^+_{k,ℓ} such that all leaves of B satisfy P in G.\n\nWhy this helps here: This reduces the add-on from 2kℓ^k down to k(ℓ^k + (ℓ^k − 1)/(ℓ − 1)), improving Theorem 3.3 as stated in the paper.\n\nProof sketch (modification of the original argument).\n- Define Γ(0) as in the paper, and for i ≥ 1 put Γ(i) := {v : deg^+_{Γ(i−1)}(v) ≥ β}.\n- The lexicographic-minimum-vector argument (Claim 3.5 in the paper) carries through verbatim with 2ℓ^k replaced by β. In the case z ≠ 0, we have deg^+_W(v) < |I|β ≤ kβ; in the case z = 0, we get δ^+(G[X]) ≥ d(P), contradicting the anti-monotonicity of P. Hence Γ(k) ≠ ∅.\n- Greedy construction of B: let v ∈ Γ(k). Build B_i inductively as in the paper. At step i (0 ≤ i ≤ k−1), the leaves L of B_i lie in Γ(k−i). For every w ∈ L we have deg^+_{Γ(k−i−1)}(w) ≥ β.\n- We must show that for each w ∈ L we can choose ℓ new out-neighbours from Γ(k−i−1) disjoint from V(B_i) and also pairwise disjoint across w ∈ L. We use two facts:\n  1) Fact A: |V(B_i)| ≤ 1 + ℓ + … + ℓ^i = (ℓ^{i+1}−1)/(ℓ−1) ≤ M. Hence each w has at least β − |V(B_i)| ≥ ℓ^k available neighbours in Γ(k−i−1) \\ V(B_i).\n  2) Fact B (simple packing lemma): If a family of at most t := |L| ≤ ℓ^{k−1} left vertices each has at least ℓ^k available neighbours in a common pool, then one can greedily assign to each left vertex a disjoint ℓ-set of neighbours. Indeed, when placing the j-th ℓ-set (j ≤ t), at most (j−1)ℓ ≤ ℓ^k − ℓ vertices have been used; since the current left vertex has at least ℓ^k available neighbours, there remain at least ℓ unused neighbours.\n- Using Facts A and B, we extend B_i to B_{i+1} with leaves in Γ(k−i−1). After k steps we obtain B = B_k with leaves in Γ(0), i.e., all leaves satisfy P in G.\n\nThus the construction works under δ^+(G) ≥ d(P) + kβ.\n\nImprovement 2: Reduce h in Theorem 3.4\n\nStatement (sharpened). Let h* := kℓ^{k+1} + 2ℓ^k + ℓ and P be the property “v is the center of S^-_{k,h*}”. Then for any digraph G with δ^+(G) ≥ f(k,h*) + k(ℓ^k + (ℓ^k − 1)/(ℓ − 1)), there is a copy of T(k,ℓ) in G.\n\nWhy this helps here: The paper sets h = 3kℓ^{k+1}. The tighter packing below shows that h* suffices; since f(k,h) (from [1]) grows quickly with h, replacing h by h* yields a far smaller quantitative δ+.\n\nProof sketch (modification of Theorem 3.4).\n- By Improvement 1 with P = “center of S^-_{k,h*}”, the graph G contains a copy B of B^+_{k,ℓ} whose ℓ^k leaves L are centers of S(w) ≅ S^-_{k,h*} (w ∈ L).\n- We now choose for each w ∈ L a subspider S′(w) ≅ S^-_{k,ℓ} contained in S(w) so that the family {S′(w)} is pairwise vertex-disjoint and disjoint from B\nexcept at w. We proceed greedily over w.\n- The union of B with previously chosen S′(w′) has size at most |V(B)| + (|already chosen leaves|) · (kℓ) ≤ 2ℓ^k + (ℓ^k − 1)kℓ.\n- Inside S(w), any vertex ≠ w lies on exactly one ray. Hence at most 2ℓ^k + (ℓ^k − 1)kℓ rays of S(w) can be blocked by the previously chosen union. Since S(w) has h* rays and h* − [2ℓ^k + (ℓ^k − 1)kℓ] = ℓ, at least ℓ rays remain available to form S′(w).\n- Choosing these ℓ rays for each w yields the desired copy of T(k,ℓ).\n\nRemarks.\n- The proof only uses disjointness and does not assume any structure on overlaps between the various S(w); the h* bound is tight for this argument up to the additive +ℓ (which we keep for clarity).\n- Numerically, h* = kℓ^{k+1} + 2ℓ^k + ℓ ≪ 3kℓ^{k+1} once ℓ ≥ 3.\n\nIssue detected in the proof of Theorem 4.3 (k = 2 spiders)\n\n- In the last part of the proof, after fixing a ∈ A with |V → B → {a}| ≥ d(d − 2ℓ), the argument takes a maximum-size family {(q_i,b_i)} with b_i ∈ N^-_B(a), q_i ∉ S ∪ {a}, and asserts: “By maximality of s, all the remaining paths V → (B \\ S) → {a} start in Q.”\n- This implication is not valid as stated: a remaining path may start in S or at a itself without contradicting maximality (since the choice q_i ∈ S is disallowed in the construction of the family {(q_i,b_i)}). Therefore, the lower bound used on the number of Q → (B \\ S) → {a} paths does not follow.\n- A safe correction is to bound the contribution from S ∪ {a} explicitly by s·d + d and deduce\n  s·d ≥ [d(d − 2ℓ) − (2ℓ − 1)s] − (sd + d),\n  which simplifies to s ≥ [d(d − 2ℓ − 1)]/[2d + (2ℓ − 1)]. This yields a weaker constant (about 2 + √6 ≈ 4.449 for large ℓ) rather than (3 + √17)/2 ≈ 3.561.\n- Conclusion: the 3.56 constant needs a refined augmentation/matching argument that prevents S ∪ {a} from carrying many remaining paths. For instance, one might aim to pick S and Q as a maximum matching between (V \\ (Y ∪ {a})) and Y = N^-_B(a) and then argue that edges from Y into Y \\ S are sparse under δ+ regularity; or use an alternating-path rerouting to ensure that most paths from Y \\ S enter Q rather than S ∪ {a}. We did not complete such a rerouting while preserving the vertex-disjointness constraints.\n\nExamples/sanity checks\n\n- Improvement 1 for k = 1: β = ℓ + (ℓ − 1)/(ℓ − 1) = ℓ + 1, so δ^+(G) ≥ d(P) + kβ = d(P) + (ℓ + 1) suffices. This matches the natural intuition that to grow an ℓ-ary out-star with leaves having property P, one needs the property threshold plus “ℓ + buffer”.\n- Improvement 2 for ℓ = 2: h* = k·2^{k+1} + 2·2^k + 2 = (k + 1)·2^{k+1} + 2. The paper used 3k·2^{k+1}; for k ≥ 2 this is a factor ~3/(k+1) improvement inside f(k,h).\n\nObstacles and limits\n\n- In Improvement 1 we used the crude bound |V(B_i)| ≤ M uniformly for all i, which is tight for i = k − 1 but pessimistic earlier. An attempt to reduce β further by tracking |V(B_i) ∩ Γ(k−i−1)| on the fly seems to require information about Γ-level intersections, which is not available in the abstract setting of δ+-common properties.\n- For Theorem 4.3, the matching-based obstruction is genuine: left vertices in S are forbidden as sources for the matching by design, and hence can absorb many of the remaining paths. Avoiding this difficulty seems to require a different selection of S, Q (perhaps via a two-phase greedy that first limits out-degree from S to Y \\ S) or a potential-function that charges such paths back to previously selected pairs.\n\nNext steps\n\n- Pursue a tightened version of Improvement 1 by replacing M with the exact bound for each stage: require deg^+_{Γ(k−i−1)}(w) ≥ ℓ^k + |V(B_i) ∩ Γ(k−i−1)|. Using a uniform upper bound for |V(B_i) ∩ Γ(k−i−1)| strictly smaller than M (e.g., M − ℓ^{k−1} in many stages) would improve β further.\n- For Theorem 3.4, tighten the “2ℓ^k” term in h* to (ℓ^k − 1)/(ℓ − 1) by noticing that |V(B)| = (ℓ^{k+1} − 1)/(ℓ − 1) and only vertices of B that actually lie in S(w) can block rays. While worst-case overlap may still force using |V(B)|, in many regimes the effective overlap might be much smaller, permitting a refined h* with a smaller additive term.\n- Repair Theorem 4.3 while keeping a 3.56-type constant: try selecting S, Q by an alternating-path augmentation that forbids edges from S ∪ {a} into Y \\ S, or show that the flow from S ∪ {a} into Y \\ S is o(d(d − 2ℓ)) under d-regularity. Alternatively, partition B into finer degree classes and show that many b ∈ N^-_B(a) have large in-degree from V \\ (S ∪ {a}).\n\nReferences mentioned\n\n- [1] Aboulker, Cohen, Havet, Lochet, Moura, Thomassé: Subdivisions in digraphs with large out-degree (for f(k,ℓ) and δ^+-maderian in-arborescences)."
}