{
  "content": "# New structural result: ply ≤ 3 implies 3-colorability\n\nStatement. Let G be a circle graph given by an interval-overlap (sweep) representation of ply w (maximum number of intervals covering any elementary segment). If w ≤ 3, then G is 3-colorable. Moreover, a 3-coloring can be found in linear time after sorting endpoints.\n\nProof. By the sweep construction, the bags B(σ) of intervals covering elementary segments σ form a path decomposition (Lemma 2 in notes) of width ≤ w−1. Thus if w ≤ 3, the pathwidth of G is ≤ 2, hence its treewidth is ≤ 2. Graphs of treewidth ≤ 2 are exactly partial 2-trees. Any 2-tree has clique number 3 and chromatic number 3; every partial 2-tree is a subgraph of a 2-tree, so χ(G) ≤ 3. Constructively, complete each bag B(σ) into a clique to obtain a chordal supergraph H with ω(H) ≤ 3. Order vertices by the index of their last bag (nondecreasing). This is a perfect elimination order for H; greedy coloring uses ≤ 3 colors on H and hence on G. Building H implicitly from the path decomposition and coloring greedily takes linear time in the number of bags, i.e., O(n) after sorting endpoints. ∎\n\nRemarks.\n- This strictly strengthens the earlier w ≤ 2 ⇒ forest fact and explains why the endpoint-DP with k=3 and w=3 always accepts.\n- For w=4, pathwidth ≤ 3 and treewidth ≤ 3; K_4 is realizable (and requires 4 colors), so the implication to 3-colorability fails for w ≥ 4.\n\n# Auxiliary facts (for proofs.md)\n\n- Path decomposition from sweep (recalled). Bags B(σ) for elementary segments form a path decomposition of width ≤ w−1 (vertex contiguity and edge coverage hold; |B(σ)| ≤ w).\n- Bags are permutation graphs. For fixed σ, each active interval has one endpoint on each side of σ; u,v ∈ B(σ) are adjacent iff their orders by left endpoints are inverted by their orders by right endpoints. So G[B(σ)] is permutation.\n- Helly-type clique lemma. Any clique of overlaps (no containment among the involved intervals) has a common point, so ω(G) = max_σ ω(G[B(σ)]) ≤ w. Consequence: If any bag has ω ≥ 4 (computable in O(n·w·log w)), then G is not 3-colorable.\n- Degeneracy bound. In any overlap representation with ply w, G is (2w−2)-degenerate: for a vertex b, at most w−1 earlier-start neighbors are active just right of s(b), and at most w−1 later-start neighbors are active just left of t(b). Hence m ≤ (w−1)n and a trivial (2w−1)-coloring exists via greedy.\n\n# Algorithms consolidated (auditable)\n\n- Endpoint DP (k stacks). Decides k-colorability, list-k-coloring, and counts colorings in O(n·w·k^w) time, O(k^w) space. Here w is the sweep ply; correctness via push/pop LIFO nesting per color.\n- Pivot with bipartite sides (exact). Fix a pivot x and a 2-coloring of each component of N(x). If both side subgraphs L and R are bipartite, extendability reduces to two independent 2-SAT instances with variables p_K (side-component orientation) and z_y (use color 3), and clauses enforcing independence of z=1 and avoidance of forbidden colors determined by S_y (computable in linear time on each side by prefix sums along the arc). Enumerating the 2^{cc(N(x))} orientations gives FPT behavior in cc(N(x)).\n\n# Examples\n\n- w = 3, χ = 3 scenario. Take three intervals forming a K_3 in overlap (mutual overlaps), plus any number of nested intervals fully contained in any single one; ply is ≤ 3; the above constructive proof yields a 3-coloring.\n- w = 4 obstruction. Four pairwise-overlapping intervals force ply ≥ 4 by Helly; K_4 appears, requiring 4 colors.\n\n# Obstacles and clarifications\n\n- Single-touch subclass and 2-SAT without branching: clauses of the form (¬z_y) ⇒ (p_K ⊕ q_C = α_y) arise; removing z_y produces parity constraints expressible in 2-CNF, but with z_y present they become 3-clauses. Thus, unless z is fixed (e.g., no optional color-3 usage), we cannot compress to a single 2-SAT across all orientations.\n- Separator strategy. The sweep gives balanced separators of size |B(σ)| ≤ w. Without a bound on w, enumerating colorings on separators is exponential in the worst case; no general subexponential algorithm follows.\n\n# Next steps (testable)\n\n- Add the ply ≤ 3 ⇒ 3-colorable theorem and its constructive coloring algorithm to proofs.md and output.md.\n- Implement: (i) the greedy 3-coloring via bag fill-in for w ≤ 3; (ii) endpoint-DP (lists/counting); (iii) pivot+2-SAT with linear-time S(y). Measure empirical w and cc(N(x)).\n- Two-pivot exploration: formalize the four-arc partition induced by two pivots a,b; prove interface lemmas to the middle N(a)∩N(b) (permutation), and attempt an orientation+2-SAT extension under bipartite sides with branching factor 2^{cc(N(a)∩N(b))}.\n- Parameterized extension: Branch on up to t optional z=1 per side after forced ones, then solve 2-SAT; analyze runtime in terms of t + cc(N(x)).\n"
}