{
  "progress_md": "Headlines\n- Model identification: each step is a parallel adjacent block transposition, i.e., the class PBT in Jelínek–Opler–Pekárek (arXiv:2311.08727). So we study the PBT-sorting time of the specific input π = bit-reversal on n = 2^d.\n- Known bounds from 2311.08727: wstp(PBT; n) = O(log^2 n); lower bound Ω(log n) for any proper class. The tight bound for PBT (and layered L) is explicitly left open; proving Ω(log^2 n) for the bit-reversal input would improve the general lower bound for PBT.\n- Proposed potential Φ(A) = Σ_j D_j(A), with D_j(A) := |log_2 B_j(A) − (d − j)|, where B_j(A) is the number of monochromatic runs under coloring by bit j. For the bit-reversal input A_0, Σ_j D_j(A_0) = Θ(d^2) = Θ(log^2 n). Goal: per step drop ΔΦ = O(1).\n\nNew rigor (small lemmas), why useful, and proofs/sketches\n1) Equivalence to PBT (why useful: aligns our model with the literature and its O(log^2 n) upper bound, and frames the task as a special-case lower bound within their class hierarchy).\n- In one step we partition into consecutive intervals and swap disjoint adjacent pairs of intervals in parallel. This is precisely a composition with an element of the class PBT (parallel block transpositions), namely a permutation obtained as a sum of rotations on the interval decomposition. Therefore “our model” = sorting by PBT.\n\n2) Exact values B_j at the endpoints (why useful: calibrates the potential function).\n- For n=2^d and the bit-reversal input A_0, B_j(A_0) = 2^{j+1} (j=0,…,d−1). For the fully sorted order A_⋆, B_j(A_⋆) = 2^{d−j}. Thus D_j(A_0) = |(j+1) − (d−j)| = |2j+1−d| and\n  Σ_{j=0}^{d−1} D_j(A_0) = Θ(d^2) = Θ(log^2 n).\n\n3) Per-level “additive” change bound via local boundary accounting (why useful: bounds how much B_j can move in one step in terms of which array boundaries are affected).\n- Fix j. Let T_j(A) ⊆ {1,…,n−1} be the set of indices i where the j-color changes between positions i and i+1; so |T_j(A)| = B_j(A) − 1.\n- One step picks disjoint adjacent interval pairs (L_k, R_k). For each matched pair there are exactly three index positions whose adjacent pair changes: the boundary before L_k, the boundary between L_k and R_k, and the boundary after R_k. All other internal adjacencies remain unchanged.\n- Hence the symmetric difference T_j(A) Δ T_j(A′) is contained in the set S_step of indices altered by this step, with |S_step| ≤ 3·(# matched pairs). Consequently, for every j we have |B_j(A′) − B_j(A)| ≤ |T_j(A′) Δ T_j(A)| ≤ 3·(# pairs).\n- Remark: this by itself is too coarse for our Ω(log^2 n) goal, because the number of pairs can be Θ(n) in a step. It does, however, isolate that only the 3-per-pair boundary changes can affect B_j.\n\n4) Per-level “useful boundary” refinement (why useful: ties the change in B_j to current j-run structure, not to the raw number of pairs).\nClaim 4.1. For fixed j, a matched pair can change B_j only if at least one of its three altered indices is either (i) itself in T_j(A), or (ii) adjacent to a run boundary in the following sense: the altered index shares one of its incident positions with a j-run boundary in A.\n- Rationale. If both positions adjacent to an altered index belong to the same j-run and neither end of the index abuts a j-run boundary in A, then the two items at that index (pre- and post-step) both come from the same j-run; in particular they have the same j-color both before and after, so the indicator “i ∈ T_j(·)” cannot flip at that index.\n- Consequence. Let U_j(A) be the set of indices that are in T_j(A) or adjacent to an element of T_j(A). Then |U_j(A)| ≤ 3·|T_j(A)| = 3(B_j(A) − 1). The number of indices at which T_j-membership can possibly change in one step is ≤ |U_j(A)|. Therefore\n  |B_j(A′) − B_j(A)| ≤ |T_j(A′) Δ T_j(A)| ≤ |U_j(A)| ≤ 3(B_j(A) − 1).\n- Corollary 4.2 (per-level constant-factor cap). For any A→A′ in one step and any j,\n  B_j(A′) ≤ 4·B_j(A) and B_j(A) ≤ 4·B_j(A′). Equivalently, |log_2 B_j| changes by at most 2 per step.\nProof. From the inequality above, B_j(A′) ≤ B_j(A) + 3(B_j(A) − 1) ≤ 4B_j(A). Apply the same inequality to the inverse step (also a PBT step) to get the reverse inequality.\n- Comment. The factor 4 is certainly improvable; I suspect factor 2 holds, but a clean proof that avoids overcounting “double-adjacent” alterations requires a tight charging scheme. Even factor 4 already implies |Δ log_2 B_j| ≤ 2.\n\n5) Alignment scarcity of cut positions across bit-levels (why useful: a quantitative cross-level restriction for the bit-reversal input A_0).\nLemma 5.1 (dyadic alignment bound). For the bit-reversal input A_0, let G_j ⊆ {1,…,n−1} denote the set of j-run boundary indices (so |G_j| = B_j(A_0) − 1 = 2^{j+1} − 1). For any set S of partition cut positions (i.e., indices where we place interval boundaries in a step),\n  Σ_{j=0}^{d−1} |S ∩ G_j| = Σ_{i∈S} (1 + v_2(i)) ≤ |S|(1 + ⌊log_2(n−1)⌋).\n- Proof. In A_0 the j-run boundaries are the indices i divisible by 2^{d−j−1}. Equivalently, i ∈ G_j iff d−j−1 ≤ v_2(i), where v_2(i) is the 2-adic valuation. Thus for a fixed i, the set {j: i ∈ G_j} has size 1+v_2(i). Summing over S and using v_2(i) ≤ ⌊log_2 i⌋ ≤ ⌊log_2(n−1)⌋ gives the bound.\n- Intuition: a single cut index can be simultaneously “useful” for only O(log n) bit-levels; hence even very fine partitions cannot align with all bit-level boundaries at once at linear density.\n\nSmall examples and sanity checks\n- n=8, A_0 = [0,4,2,6,1,5,3,7]. B_0=2, B_1=4, B_2=8. If we partition into singletons and match (1,2), (3,4), (5,6), (7,8), the three indices that change per matched pair are exactly the three boundaries around each pair; but for j=0 only the central boundary near the 0/1 split can be “useful”. Empirically B_0 cannot jump from 2 to Θ(n) in one step; more generally, the useful-boundary lemma predicts |ΔB_0| ≤ 3(B_0−1) = 3.\n- For j = d−1 (MSB) at A_0, B_{d−1} = 2^d = n. Then |ΔB_{d−1}| ≤ 3(n−1) is trivially true; the interesting regime is small j where B_j is small. There, Lemma 4.1 caps the number of useful indices by O(B_j), consistent with the block-coalescence intuition.\n\nWhy these are not yet enough for Ω(log^2 n)\n- The “per-level constant factor cap” (even with factor 2) alone only yields that each D_j can decrease by O(1) per step; summing over all levels gives ΔΦ = O(d) per step, implying only Ω(d) steps. To reach Ω(d^2) we need to argue that only O(1) levels can enjoy constant-factor progress in the same step (a cross-level scarcity lemma).\n- A naive “capacity” counting using Σ_j B_j(A_0) = Θ(n) and the observation that a matched pair of size L influences ≈ L/ℓ_j boundaries at level j (where ℓ_j = 2^{d−j−1} is the j-run length in A_0) suggests that simultaneously reducing B_j by a constant factor across many j is not obviously impossible: Σ_j (L/ℓ_j) = O(L), and Σ_j B_j(A_0) = Θ(n). So simple one-dimensional capacity arguments do not create a missing log factor.\n- The alignment lemma (Lemma 5.1) shows a single cut index hits O(log n) levels, but a partition has |S| ≈ n cuts in the extreme, and |S|·log n is still big enough to interact with all levels in principle. So we need a stronger statement than mere counting of aligned cuts; we must quantify how many aligned cuts are actually needed to produce constant-factor changes in B_j and show that a single partition cannot simultaneously supply that demand for many j.\n\nObstacles and gaps (explicit)\n- The factor-2 per-level cap is plausible but not yet proved cleanly; I gave a rigorous factor-4 cap (Corollary 4.2). Improving this constant strengthens the per-level bound but does not yet give Ω(log^2 n).\n- The key missing piece is a robust cross-level scarcity theorem. The naive union bound over cuts (Lemma 5.1) is insufficient—the capacity vs. demand calculation doesn’t produce an extra log. We need a structural reason why the same set of disjoint adjacent block swaps cannot simultaneously realize the “good pairings” of runs required for constant-factor reduction at many distinct bit-levels.\n- There is no output.md provided; thus far there is no curated, rigorously proved result beyond the baseline Ω(log n). Our Lemma 3–5 fill some pieces but do not yet imply Ω(log^2 n).\n\nIdeas for next steps (testable subgoals)\n- Strengthen the per-level cap: Aim to prove B_j(A′) ≤ 2·B_j(A) and B_j(A) ≤ 2·B_j(A′) in one step for every j. Strategy: refine the “useful boundary” charging so that every index whose membership toggles is charged to a unique j-run boundary in A or in A′, and each boundary receives O(1) charge. This would give |Δ log_2 B_j| ≤ 1 per step.\n- Quantify “demand” to get constant-factor progress at a fixed j: Formalize that reducing B_j by a factor of 1−ε requires selecting cuts that microscopically pair (most of) adjacent j-runs in an alternating fashion. Prove that such a pairing demands Ω(B_j) central cuts specifically at the j-run boundaries (not just adjacency to them) and also constraints on which of those cuts are matched. This could lift the per-level demand from mere Θ(B_j) “touched indices” to Θ(B_j) “central matched boundaries,” which then interacts more tightly across levels via disjointness of pairs.\n- Cross-level conflict via disjointness: For A_0 the sets of j-run boundaries form a family of dyadic arithmetic progressions. Try to show that if you match central boundaries to reduce B_j substantially, those same matched pairs necessarily misalign with the central boundaries needed to reduce B_k for |k−j| large; i.e., central boundaries for different j’s largely do not coincide and cannot all be matched at once due to disjointness of pairs. Precise goal: For any partition+matching M, let C_j(M) be the number of matched central boundaries that lie in G_j. Prove Σ_j C_j(M)/B_j ≤ O(1) (or at least O(log n)). This would imply that only O(1) (or O(log n)) levels can see constant-factor progress in a single step.\n- Computational probe (n=16,32): Enumerate partitions+matchings from A_0 (up to symmetries), compute all B_j before/after, and record which levels see ≥2× change. This can guide a conjecture on an absolute bound for the number of such levels per step.\n- Alternative potentials: Explore weighted potentials that penalize “simultaneous progress across many j” more severely, e.g., Φ_α(A) = Σ_j α^{|2j+1−d|}·|log_2 B_j(A) − (d−j)| for α>1, and try to prove a per-step drop independent of d. This would hinge on relating the weights to the dyadic structure of G_j.\n- Connection to known open problem: If we can show the desired cross-level scarcity for the specific A_0, it already yields Ω(log^2 n) for bit-reversal under PBT and strictly improves the general lower bound for the class. Even a weaker statement like “in any step, at most O(1) levels with |2j+1−d| ≥ c·d see constant-factor progress” would imply a near-Ω(log^2 n) bound.\n\nSummary\n- Formalized that our model is exactly PBT.\n- Established a clean per-step per-level bound: |ΔB_j| ≤ 3(B_j−1) ⇒ a constant-factor cap B_j′/B_j ≤ 4 (factor likely improvable to 2). This justifies that |Δ log B_j| is O(1) per level per step.\n- Proved an “alignment scarcity” lemma (Lemma 5.1) for A_0: a cut position can be aligned with at most O(log n) levels j. This is a building block towards a cross-level scarcity theorem, but by itself not sufficient.\n- Identified the main obstacle: converting alignment scarcity and disjointness of matched pairs into a sharp bound on how many levels can make constant-factor progress in the same step.\n- Outlined concrete next steps: (i) tighten the per-level cap to factor 2; (ii) quantify per-level demand in terms of central matched boundaries; (iii) prove a cross-level trade-off Σ_j C_j(M)/B_j ≤ O(1); (iv) run small-n experiments to test these phenomena.\n"
}