{
  "progress_md": "Ideas and setup\n- Model recap. One step picks a partition of the array into consecutive intervals and swaps some disjoint adjacent interval-pairs in parallel. This exactly matches one-step permutations in the class PBT (parallel block transpositions) as in Jelínek–Opler–Pekárek (JOP): partition into B1 B2 … B2k (allowing empty blocks formally, but we never need them) and swap each (B2i−1,B2i).\n- Significance. JOP show wstp(PBT;n) = O(log^2 n) but only Ω(log n) lower bounds are known. Proving Ω(log^2 n) for bit-reversal in our model would imply Θ(log^2 n) worst-case in PBT and address an open direction (their Problem 8.1 for L and PBT).\n- Strategy. Track, for each bit level j, the number B_j(A) of monochromatic runs when elements are colored by bit j. For bit-reversal input A0 (n=2^d): B_j(A0)=2^{j+1}. For the sorted order A⋆: B_j(A⋆)=n/2^j=2^{d−j}. The potential Φ(A)=∑_{j=0}^{d−1} D_j(A) with D_j(A)=|log_2 B_j(A)−log_2 B_j(A⋆)| satisfies Φ(A0)=Θ(d^2) and Φ(A⋆)=0. Goal: per-step drop of Φ is O(1) to force Ω(d^2) steps.\n\nClaim 1 (per-level constant-factor cap)\n- Statement. Fix j. In any single step A→A′, the run-count B_j can change by at most a constant multiplicative factor: there exists an absolute c such that B_j(A′) ∈ [B_j(A)/c, c·B_j(A)]. In particular, we can take c=7.\n- Why useful here. It prevents a step from massively improving a single level j.\n- Proof sketch (rigorous local counting). Let R_j(A) be the set of j-run boundaries (edges between adjacent items where bit j flips), so B_j(A)=|R_j(A)|+1. In a step, only adjacencies at three kinds of edges per swapped pair can change: the left outer boundary, the inner boundary between the two swapped intervals, and the right outer boundary. Hence if m pairs are swapped, at most 3m adjacency edges can change in total. However, only pairs that actually intersect the j-run boundary set can affect B_j: if a pair lies entirely within a single j-monochromatic run, all three affected adjacencies are between same colors, so B_j is unchanged. Let Q_j be the set of swapped pairs whose union intersects R_j(A). By disjointness, each boundary in R_j(A) lies in the union of at most one swapped pair, so |Q_j| ≤ |R_j(A)| = B_j(A)−1. For each such pair, at most O(1) of the three changed adjacencies can flip the “is boundary” status. Therefore |B_j(A′)−B_j(A)| ≤ C·|Q_j| ≤ C(B_j(A)−1) for some absolute C (one can take C=6 by a brute-force case check along the three edges). This implies B_j(A′) ≤ (1+C) B_j(A) and symmetrically B_j(A) ≤ (1+C) B_j(A′), hence the factor cap with c=1+C ≤ 7.\n- Sanity check on toy cases. For j=0 with initial 00…011…1, only the unique 0|1 boundary can be in Q_j, hence B_0 can increase or decrease by O(1) in one step, matching the known “merging needs Ω(log n)” folklore.\n\nEdge-to-level charging (a quantitative cross-level accounting tool)\n- Setup. Let S be the set of adjacency edges whose status (same-color vs different-color at level j) changes in a step. For a fixed j, the change Δ_j := |B_j(A′)−B_j(A)| is O(|S ∩ E_j|), where E_j is the set of j-run boundary gridlines (the edges periodically spaced by L_j=2^{d−1−j}).\n- Observation (valuation count). For an edge position e∈{1,…,n−1}, define ν_2(e) as the exponent of the highest power of 2 dividing e. The edge e belongs to E_j if and only if L_j divides e, i.e., j ≤ d−1−ν_2(e). Thus the number of levels j at which e is a j-grid boundary equals ν_2(e)+1. The harmonic identity ∑_{e=1}^{n−1} (ν_2(e)+1) = Θ(n) implies that “on average” an edge participates in O(1) levels.\n- Consequence (weighted bound). For any nonnegative weights w_j, we have ∑_j w_j·Δ_j ≤ C·∑_{e∈S} ∑_{j: e∈E_j} w_j. Choosing w_j = 2^{−(j+1)} gives ∑_j 2^{−(j+1)}·Δ_j ≤ C′·|S| because ∑_{j: e∈E_j} 2^{−(j+1)} ≤ 1 for every e. More generally, for w_j = 2^{−(j+1)}/(j+1) we get ∑_j w_j·Δ_j ≤ C′′·|S| (up to an extra O(log log n) factor if one tightens constants). These bounds are robust and will be useful for potentials that weight levels by 2^{−j} (or slightly heavier penalties near extremes).\n- Why useful here. This provides a cross-level scarcity principle: many changed adjacencies cannot produce “large” relative progress on many levels simultaneously, once progress is normalized appropriately by the density of j-boundaries.\n\nScale-sensitive refinement via pair sizes\n- Additional structure. Let each swapped pair p consist of two adjacent intervals of total length s(p). At level j, every j-run has length L_j=2^{d−1−j}. One pair p can affect at most O(min{1, s(p)/L_j}) distinct j-boundaries: the three adjacency changes are confined to O(1) blocks of length s(p), which intersect O(s(p)/L_j) of the L_j-spaced grid edges.\n- Lemma (deterministic). For all j, Δ_j ≤ C·∑_{p} min{1, s(p)/L_j}. Consequently, using B_j(A0)=2^{j+1} and L_j=2^{d−1−j}, we get for the bit-reversal input A0: Δ_j / B_j(A0) ≤ (C/n)·∑_{p} min{s(p), L_j}.\n- Summing in j and swapping sums yields: ∑_j Δ_j / B_j(A0) ≤ (C/n)·∑_{p} ∑_{t=0}^{d−1} min{s(p), 2^t} = (C/n)·∑_{p} O(s(p)·log(1+s(p))). Since ∑_{p} s(p) ≤ n in every step, the RHS is O(log n) per step. This recovers an Ω(log n) lower bound by a “fractional progress” argument and quantifies that a step cannot make constant-fraction progress on many levels at once unless it spends large total size in pairs.\n- Why useful here. This pins down quantitatively how pair sizes limit multi-level progress. It suggests going beyond additive counting toward scale-weighted potentials.\n\nToward an Ω(log^2 n) (or near) bound: a proposed program\n- Lemma 1 is now clean and rigorous. The remaining challenge is a cross-level bound strong enough to cap the drop of Φ(A)=∑_j |log B_j(A)−log B_j(A⋆)| by O(1) per step. The above tools give only O(log n) so far, recovering Ω(log n).\n- Heuristic strengthening. To achieve a constant-factor change in B_j, one needs Θ(B_j) changed adjacencies at level j (since each changes B_j by O(1)). By the “size lemma” above, generating Θ(B_j) changes at level j requires ∑_{p} min{1, s(p)/L_j} = Ω(1), i.e., the total s(p) across pairs must be Ω(L_j). Doing this for T different levels j in one step requires Ω(∑_{t=1}^T L_{j_t}) total size budget, but ∑_{p} s(p) ≤ n. For the dyadic sequence L_j=2^{d−1−j}, the sum over a set of T distinct levels is at least ≈ 2^{d−T} if clustered, but if spread out evenly across O(d) levels, ∑ L_j ≈ Θ(n). This suggests that making constant-factor progress on ω(1) distinct levels at once quickly exhausts the size budget, hinting that only O(1) levels can enjoy a constant-factor change per step (a formal version of speculative Lemma 2).\n- Formal target (to prove next). There exists an absolute c>0 such that in any step, the set J of levels j for which B_j changes by a factor ≥2 satisfies |J| ≤ c. Outline approach: assign to each pair p a unique “home level” h(p) so that (i) p can contribute at most O(1) to constant-factor progress for levels ̸= h(p), and (ii) the sum of s(p)/L_{h(p)} over all p is O(1). A natural home level is the unique j with L_j ∈ [s(p)/2, 2 s(p)]. Packing disjoint pairs implies ∑ s(p) ≤ n, hence ∑ s(p)/L_{h(p)} ≤ O(1). Use the size lemma to argue that constant-factor progress at level j requires total contribution Ω(1) from pairs with h(p)=j. Thus at most O(1) such levels exist per step.\n- If established, combining with the per-level factor cap (Lemma 1) implies that Φ can decrease by at most O(1) per step: each of the O(1) “active” levels can shrink |log B_j − log B_j⋆| by O(1), all other levels shrink by at most a constant fraction of a fraction, summing to O(1) overall. This would yield the desired Ω(log^2 n) lower bound.\n\nToy special case (to aim for as an intermediate milestone)\n- Restricted steps: equal-scale partitions. Suppose every step uses a partition into intervals whose lengths are within a factor 2 of a common L (and swaps a matching on these). Then: a pair has size s≈L. The size lemma gives Δ_j ≤ C·m·min{1, L/L_j}. Since m≤n/L, we have Δ_j ≤ C·(n/L)·min{1, L/L_j} ≤ C·min{n/L, n/L_j}. For j with L_j ≪ L, Δ_j ≤ C·(n/L_j), a tiny fraction of B_j(A0)=2^{j+1} unless L≈L_j. For j with L_j≈L, Δ_j ≤ C·(n/L) gives at best constant-fraction progress. Only O(1) neighboring j have L_j within factor 2 of L. Hence per step, only O(1) levels can change by a constant factor. This toy case supports Lemma 2 in a simplified setting and could be made rigorous.\n\nSmall examples and checks\n- n=8 (d=3), A0=[0,4,2,6,1,5,3,7]. Compute B_j(A0)=(2,4,8) for j=0,1,2; B_j(A⋆)=(8,4,2). Any step alters at most three adjacencies per pair; a pair not intersecting the unique B_0 boundary is irrelevant to B_0; at most one pair is relevant, so B_0 changes by O(1) factor. For B_1, the four boundaries are at positions multiples of 2; disjointness similarly limits pairs that can affect many of them at once unless s(p)≈2. This matches the scale-sensitive picture.\n\nConnections to literature (JOP and gaps)\n- Our model coincides (one-step-wise) with PBT. JOP prove O(log^2 n) upper bounds (also for L), and Ω(log n) lower bounds in general via counting. They leave open closing the gap to Ω(log^2 n). Our Lemma 1 aligns with their “boundary locality” arguments; the key remaining step is Lemma 2 (cross-level scarcity). The size-based accounting we developed above is a promising path; formalizing the “home level” charging to show only O(1) levels can change by factor ≥2 per step would settle the lower bound.\n\nNext steps (concrete, testable)\n1) Formalize and prove the size lemma: Δ_j ≤ C·∑_p min{1, s(p)/L_j}, including an exact constant C and a careful accounting of the three changed adjacencies per pair. This is local and checkable.\n2) Prove Lemma 1 rigorously with an explicit constant c (I gave c=7 via a union bound; tightening to c=3 or c=5 is likely with a refined boundary case analysis). Write the proof cleanly so the verifier can include it in output.md.\n3) Prove the toy special-case Lemma 2 for equal-scale partitions, giving an Ω(log^2 n) lower bound for that restricted algorithm class. This creates a baseline “special case” lower bound.\n4) Develop the “home level” charging in full generality: for each pair p, define h(p) with L_{h(p)}≈s(p). Show that to achieve a factor-2 change at level j, the sum over p with h(p)=j of min{1, s(p)/L_j} must be Ω(1). Since ∑_p s(p)/L_{h(p)} ≤ O(1), only O(1) levels can have such progress.\n5) If step 4 succeeds, deduce per-step Φ drop ≤ O(1) (each active level reduces D_j by O(1); inactive ones by at most a small fraction), hence Ω(log^2 n).\n6) Computational aid on small n (n=16,32): enumerate random partitions and measure how many levels j see a ≥2× change in B_j in a single step; record empirical maximum; this can guide constants and refine the “active level” definition.\n\nGaps or issues in current outputs\n- There is no output.md provided; hence no prior rigorous lemmas to cross-check. The present round delivers Lemma 1 in a form ready to be curated and a precise statement of the “size lemma” with a clear proof plan. The main open gap remains the core cross-level scarcity (Lemma 2), for which I outlined two routes: the equal-scale special case (feasible) and the general “home level” charging (harder but promising).\n"
}