{
  "content": "Status\nWe keep the general complexity of 3-coloring circle graphs open. I add three checkable items: (i) a structural lemma that every sweep bag induces a permutation graph; (ii) a balanced-separator lemma via the sweep/path decomposition; (iii) an explicit extension of the ply-DP to list-coloring and counting colorings, with rigorous state transitions and complexity.\n\nIdeas and structural lemmas\n- Overlap model: Chords become open intervals I(x)=(s(x),t(x)) after cutting the circle. Adjacency is overlap without containment: x∼y iff s(x)<s(y)<t(x)<t(y) or the symmetric pattern.\n\nLemma 3 (Every bag is a permutation graph)\nFix a segment σ (between consecutive endpoints) and let B(σ) be the set of active intervals covering σ. Then the induced subgraph G[B(σ)] is a permutation graph.\nProof. σ splits the circle (line) into two arcs L (to the left of σ) and R (to the right). Each x∈B(σ) has one endpoint on L (its start) and one on R (its end). Reading the order of starts along L and of ends along R as two permutations of B(σ), two vertices x,y∈B(σ) are adjacent iff their relative order on L is opposite to their relative order on R: precisely the permutation-graph model. ∎\n\nLemma 4 (Balanced separator of size ≤ w)\nLet w be the circular ply. There exists a segment σ such that removing S=B(σ) disconnects G into two parts A and C with |A|,|C| ≤ 2n/3.\nProof. Traverse segments σ1,…,σm in order. Let a(i) be the number of vertices x with t(x)≤σi (completely to the left), and c(i) the number with s(x)≥σi (completely to the right). Both a(i) and c(i) change by at most 1 between consecutive segments, are integer, and satisfy a(1)=0, c(m)=0, a(m)=n, c(1)=n. There exists i with a(i)∈[n/3,2n/3] (by IVT on integers). For this σ=σi, every vertex not in B(σ) lies entirely to one side, hence |A|=a(i) and |C|=c(i), and a(i)+c(i)=n−|B(σ)| ≤ n, implying |A|,|C| ≤ 2n/3. S=B(σ) separates by the path-decomposition property. ∎\n\nAlgorithmic consequences\nWe unify the sweep DP with a path-decomposition view, and extend it to lists and counting.\n\nTheorem 2 (List k-colorability FPT in ply w)\nGiven a circle representation with ply w and lists L(v)⊆{1,…,k}, list k-colorability can be decided in time O(n·w·k^w) and space O(k^w).\nProof. Use the path decomposition by bags B(σ); refine to a nice path where between consecutive bags, one vertex is introduced (its start passes σ) or one is forgotten (its end passes σ). Maintain for each bag all proper colorings c of the bag respecting lists, that extend to the already processed prefix. The number of states per bag is ≤∏_{v∈B}|L(v)| ≤ k^{|B|} ≤ k^w. Transitions:\n- Introduce u: Let r be the rank of t(u) among current ends to the right of σ. The neighbors of u in the bag are exactly those a with t(a) < t(u). For each state c on the old bag, extend by choosing c(u)∈L(u)\\{c(a): t(a)<t(u)}; discard if empty.\n- Forget u: Project c to the remaining vertices.\nEvery edge is enforced at the introduction of its later-starting endpoint, so correctness follows. Precomputing for each introduce the set of neighbors by ranks yields O(w) work per state per step, hence O(n·w·k^w). ∎\n\nCorollary 2 (3-colorability and counting are FPT in w)\n- Decision: set L(v)={1,2,3}; runtime O(n·w·3^w).\n- Counting: store in each state the number of extensions from the processed prefix; when introducing u, sum counts over allowed colors; when forgetting u, aggregate equal projected states by summation. Total number of 3-colorings is obtained at the end. Complexity remains O(n·w·3^w).\n\nRemarks and examples\n- Lemma 3 tightens local structure: bags are permutation graphs, not just neighborhoods. This may be useful for state compression heuristics and for deriving exact counts on small bags via permutation-graph DP at each step (though worst-case asymptotics remain O(k^w)).\n- Lemma 4 supplies a standard balanced separator of size ≤ w. While weaker asymptotically than the linear-time DP, it enables divide-and-conquer formulations and may help for other problems on circle graphs.\n- Tiny ply: w≤2 implies acyclic (previous round’s proposition). Combining with Theorem 2 gives a linear-time solver for w≤2 (and in fact any fixed w) with explicit constants.\n\nObstacles\n- Attempting to compress DP states below k^w via prefix color masks fails at forget steps due to loss of information about the color of the earliest-ending active interval; see prior round’s negative observation. Lemma 3 suggests using permutation-graph coloring inside bags, but consistency across introduces/forgets still requires tracking full assignments on the bag.\n\nNext steps (concrete and testable)\n- Implement list-3-coloring DP and counting; verify on random chord diagrams and on adversarial instances (high ply with many nested non-edges), reporting the empirical scaling with w.\n- Exploit Lemma 3: at each bag, precompute the clique-cover number/clique number of the permutation subgraph to prune infeasible states early (e.g., forbid 3-color states that already use 3 colors on a K4 substructure in the bag).\n- Use Lemma 4 to prototype a recursive separator-based solver and compare to the DP in practice.\n- Extend the pivot-side 2-SAT packaging explicitly to list constraints (lists propagated from a precolored separator), maintaining the FPT factor 2^{cc(N(x))} over components of N(x)."
}