{
  "progress_md": "Status and target\n- Goal: Close the remaining gap for the general Online-LOCAL(t) case on bounded-degree trees by finalizing the lower-bound route (localized round-elimination for sinkless orientation) and by clarifying the decision semantics so that the non-conflict step (“double grab implies contradiction”) is valid.\n- What is already archived and solid: Lemma 7 (2t-commutativity), Corollary 7.1 (witness localization), Lemma 8 (quiescent bridge with K = 2t+2W+1), Claim 8.1 (phase-locality inside a color phase), and Lemma 9 (strong witness localization at v). These give an O(log* n) upper bound for quiescent/output-only regimes and the tools needed to localize online effects to B(·,2t).\n\nGap identified in output.md (lower-bound program)\n- The previously sketched node→edge elimination step (LB.1) for sinkless orientation used the node-form (each node chooses an outgoing edge). As the verifier noted, “double witnesses” at the two endpoints of an edge do not contradict node-form feasibility—both endpoints may choose the same edge without violating “not a sink.” To proceed, we must (i) change to an edge-form LCL with a decisive step at the second endpoint, or (ii) use a universal-quantifier elimination variant that records sets of feasible labels per edge. Below I formalize both options, with a concrete normalization-and-extension lemma that is needed in either case.\n\nNew model ingredient (to make non-conflict well-defined)\n- Edge-decided Online-LOCAL(t) for sinkless orientation. For orientations, we adopt edge-form semantics: an edge e = uv becomes decidable at the moment the second endpoint arrives; in that arrival window (t rounds), the algorithm must irrevocably choose one of the two orientations for e, and encode it redundantly at both endpoints. Earlier arrivals may maintain local state and make temporary proposals, but the only irrevocable decision for e is the orientation made when the second endpoint arrives. The global LCL constraint is: in the final orientation, every vertex has outdegree ≥ 1, and every edge is oriented in exactly one direction.\n- Why useful: Under this semantics, two locally consistent histories that force opposite orientations for the same edge at the same decisive moment are genuinely contradictory; hence a “double-witness” proves inconsistency, fixing the non-conflict step in LB.1.\n\nNormalization-and-extension lemma (precise, to use in LB.1)\n- Lemma NE (Extension of localized schedules on trees). Fix an edge e = uv and radius t ≥ 1. Let X := B(e,2t). Consider any arrival schedule τ on X in which (i) only vertices of X arrive before the decisive step for e (the second of u,v), and (ii) outside vertices V\\X are absent up to that decisive step. Then τ extends to a global arrival order \n  \n  τ̂ on V(G) such that the transcript inside B(e,t) up to and including the decisive step is identical to that under τ.\n- Proof idea (tree + Lemma 7 + Corollary 7.1): Keep all steps on X exactly as in τ and defer all outside arrivals to after the decisive step. During each arrival inside X, any vertex w ∈ V\\X is at distance > 2t from both u and v (by definition of X), hence cannot affect B(e,t) within t rounds (Lemma 7). Thus, the absence of outside vertices is consistent and their later arrival cannot retroactively change the transcript in B(e,t). Corollary 7.1 guarantees we can push any stray outside arrival (if any) past the decisive moment without changing states in B(e,t). The tree structure prevents cycles across ∂X and ensures no “feedback” from absent nodes. Therefore τ̂ exists and preserves the local transcript. (We will write a fully quantified version for output.md; the above captures the key invariants.)\n- Sanity check (t = 1): X = B(e,2) contains u, v, their neighbors, and neighbors’ neighbors. Any path from V\\X to B(e,1) has length ≥ 2. In the 1-round windows of vertices of X, information from V\\X cannot reach B(e,1); hence deferring V\\X is harmless.\n\nLB.1e (node→edge reduction, decisive-edge variant)\n- Statement (existential form). Assume a deterministic Online-LOCAL(t) algorithm A solves sinkless orientation under edge-decided semantics for all arrival orders on bounded-degree trees. Fix an edge e = uv. After normalizing the prefix so that only vertices in X = B(e,2t) may arrive before the decisive step for e (by Cor. 7.1 and Lemma NE), the orientation of e produced by A depends only on the labeled ball X (IDs and port orderings restricted to X). Consequently, there is a well-defined edge-centered (t−1/2)-local rule A′ that, given X, outputs the unique orientation of e.\n- Proof sketch (two parts):\n  1) Dependence on X. Suppose there are two normalized schedules τ1, τ2 on X (with outside vertices absent) that lead A to choose opposite orientations at the decisive step. Apply Lemma NE to extend τ1, τ2 to global schedules τ̂1, τ̂2 that preserve the transcript inside B(e,t) up to the decisive step. Now consider a hybrid schedule that follows τ̂1 up to the decisive step and τ̂2 afterward (or vice versa). Since the decisive decision must be made based solely on the state in B(e,t) at that moment, and these states coincide with the ones in τ̂1 and τ̂2 respectively, we force A to choose both orientations on the same global input at the same decisive moment—a contradiction. Hence the orientation is unique and depends only on X.\n  2) Radius accounting and “−1/2”: The rule is edge-centered because the decisive step is tied to the second endpoint. Looking one “half layer” beyond B(e,t) suffices to resolve which endpoint arrives second in the normalized view and to collect all causal influences (the classical t→t−1/2 descent). The dependence on X = B(e,2t) matches the standard round-elimination radius on trees.\n- Why (t−1/2)-local: As in classical round-elimination, the node→edge step consumes half a round because the edge rule skips one endpoint’s final local step and aggregates the two adjacent node views into a single decision.\n\nLB.1u (universal-sets variant—safer and closer to classical elimination)\n- Statement (set labeling). Under the same setup, for each edge e and labeled ball X = B(e,2t), define S_e(X) ⊆ {u→v, v→u} to be the set of orientations that A may choose at the decisive step over all normalized arrival schedules on X consistent with the fixed labels on X (with outside vertices absent). By Lemma NE and Cor. 7.1, S_e(X) depends only on X. Moreover, S_e(X) ≠ ∅ (A always orients e when both endpoints have arrived). This yields an edge-centered (t−1/2)-local rule that assigns each edge a nonempty set of allowed orientations.\n- Preservation of node constraints under sets. For any vertex w and its incident edges E(w), define the node constraint “no-sink in sets” as: there exists e ∈ E(w) such that S_e contains an orientation pointing away from w. Suppose, for contradiction, that all S_e forbid an outgoing choice for w. Then, in every normalized local schedule on the union ⋃_{e∈E(w)} B(e,2t) consistent with the same labels, A would be forced to leave w without any outgoing edge at the moment all incident edges become decidable—contradicting correctness. Thus the “no-sink in sets” constraint holds locally for the family {S_e}.\n- Why this variant is attractive: It avoids the non-conflict/gluing subtlety entirely; instead of proving uniqueness, we carry sets of feasible labels as in classical round-elimination. The next elimination step will shrink these sets further.\n\nLB.2 (iteration to 0 rounds and ID-graph contradiction)\n- Statement (outline in the universal-sets framework). Alternating the localized node↔edge elimination steps 2t times, we obtain a 0-round edge-centered set-labeling rule S^{(0)} that assigns to each edge e a nonempty subset S^{(0)}_e ⊆ {u→v, v→u}, where S^{(0)}_e depends only on the ID labels in B(e,2t). The node constraints persist at each step (“no-sink in sets” remains satisfiable). As in the classical proof with ID-graphs, this induces a 0-round global prescription depending only on IDs in constant-radius neighborhoods which must satisfy the sinkless-orientation constraints. By the ID-graph property (Def. 2.16), such a 0-round prescription cannot exist, yielding a contradiction. Therefore, no deterministic constant-t Online-LOCAL algorithm (under edge-decided semantics) solves sinkless orientation on bounded-degree trees.\n- Remarks:\n  • The elimination preserves nonemptiness and the node constraints because both are verified locally on finite balls and follow from correctness of A over all normalized local schedules (by Lemma NE and witness localization).\n  • The final contradiction for 0 rounds mirrors Theorem 2.15’s ID-graph argument: a 0-round rule reduces to an ID-based choice for each edge with no room for coordination; the girth and independence properties of H forbid satisfying the constraints everywhere.\n\nAuditable components ready to integrate into output.md\n1) Add the new Edge-decided Online-LOCAL(t) semantics for orientations (a brief model paragraph). This cleanly separates edge orientation from node “grabs” and fixes the earlier non-conflict issue.\n2) Add Lemma NE (Normalization-and-extension of localized schedules) with a complete proof. It relies only on Lemma 7, Corollary 7.1, and the tree structure. We recommend including the explicit t=1 special case as an illustrative sublemma.\n3) Add LB.1u (universal-sets node→edge step) as the main elimination step (safer to verify). State precisely that S_e depends only on X = B(e,2t); prove nonemptiness and the local “no-sink in sets” property.\n4) State LB.2 (iteration to 0 rounds) at the same universal-sets level, and outline the ID-graph contradiction. If desired, include the decisive-edge variant LB.1e as a lemma following from uniqueness; its proof is short once Lemma NE is in place.\n\nSanity checks and small examples\n- t = 1, paths/trees. For e = uv, X = B(e,2) suffices. It is straightforward to enumerate normalized schedules on X and verify that S_e(X) is determined solely by labels on X; any attempted dependence on arrivals outside X would contradict Lemma NE.\n- Why “no-sink in sets” is preserved: If S_e(X) excluded all orientations out of u for e incident to u, then every completion of arrivals consistent with X would leave u sink at the decisive times—contradiction to A’s correctness.\n\nEdits and clarifications suggested for output.md\n- Add a short “Orientation semantics for lower bounds” remark: we work with edge-decided Online-LOCAL(t) for sinkless orientation (orientation fixed at the second endpoint’s arrival). This avoids the double-grab pitfall in the node-form.\n- Insert Lemma NE (Normalization-and-extension lemma) in the “Online round-elimination on trees” subsection; cite it in LB.1u/LB.2.\n- Present LB.1u (universal-sets node→edge) and LB.2 (iteration) as formal statements; defer the mechanical details of the edge→node half-step to the next iteration (we will mirror the standard set-propagation used in classical elimination and keep all radii explicit).\n\nNext steps (concrete, checkable)\n1) Write the full proof of Lemma NE with explicit quantifiers and a careful boundary argument (no edges across R_v regions for t rounds). Provide the t = 1 special case as a warm-up.\n2) Formalize the edge→node half-step in the universal-sets framework, including its exact radius transformation and the preservation of nonemptiness and node constraints.\n3) Complete the LB.2 write-up: define the inductive family of set rules S^{(k)}, prove invariants, and carry out the final ID-graph contradiction carefully (as in Theorem 2.15), referencing the girth and independence properties.\n4) Optionally, give a short note showing that, if one prefers, LB.1e (decisive-edge uniqueness) can be proven directly for t = 1 (trees), then extended to general t by induction on t using the universal-sets machinery.\n\nAdditional observations (minor)\n- Output.md is consistent on radii: Lemma 8 needs K = 2t+2W+1; Corollary B simulates a derived sequential (R,W)-rule and needs K = max(2W, R+W) (no +1). The explanatory remark is already present—good.\n- No further gaps spotted in the positive (quiescent) route. After integrating the LB lemmas above, we can state the main theorem existentially: Any LCL solvable in O(1) deterministic Online-LOCAL(t) on bounded-degree trees admits an O(log* n) deterministic LOCAL algorithm. (Proof: such an LCL cannot be in the log n-hard class by the lower bound; hence by tree classification it lies in the O(1)/Θ(log* n) class.)\n"
}