{
  "content": "Ideas\n- Use the conflict-graph viewpoint: vertices are E, and an edge xy exists if ∃ p≠q with f_p(x)=f_q(y). A partition into parts E_i with f_p(E_i)∩f_q(E_i)=∅ for all p<q is exactly a proper coloring of this graph.\n- Strengthen the known permutation construction by injecting “light” functions whose images are disjoint from the “heavy” functions, to force n=1 (or even many small fibres per z) while keeping the conflict graph complete.\n\nA very strong counterexample with n=1 (k≥4)\nLet k≥4. Put m:=k-1 and r:=1. Take E=S_m and F= [m] ⊔ B, where B is a set in bijection with S_m (to be specified). Define m “heavy” functions h_i:E→[m] by h_i(π)=π(i) for i∈[m], and one “light” function ℓ:E→B by ℓ(π)=b_π (a distinct element of B for each π).\n- Pointwise distinctness: For each π, the values h_1(π),…,h_m(π) are the distinct elements of [m], and ℓ(π)∈B disjoint from [m], so all k values are distinct.\n- Small fibres with n=1: For any z∈[m], ℓ^{-1}(z)=∅, so min_t |f_t^{-1}(z)|=0≤1. For any z=b_π∈B we have ℓ^{-1}(z)={π}, so again ≤1.\n- Completeness of the conflict graph: For any distinct π,σ∈S_m there exists s∈[m] with π^{-1}(s)≠σ^{-1}(s). Let p:=π^{-1}(s) and q:=σ^{-1}(s). Then h_p(π)=s=h_q(σ), hence πσ is an edge. Thus the conflict graph is K_{|E|}=K_{m!}.\nConsequently χ=|E|=m!=(k-1)!, so more than 2n+1=3 parts are needed for all k≥4. This refutes the 2n+1 bound in the strongest possible way: already with n=1 and even with one function injective (ℓ), the required number of parts is factorial in k.\n\nA family handling “many small fibres per z” (robust to weaker variants)\nFix k≥3, integers r with 1≤r≤k-2, and set m:=k-r. Let E=S_m. Take pairwise disjoint sets B_1,…,B_r, each in bijection with S_m, and set F=[m] ⊔ B_1 ⊔ … ⊔ B_r. Define heavy functions h_i:E→[m] by h_i(π)=π(i) for i=1,…,m, and light functions ℓ_j:E→B_j by ℓ_j(π)=b^{(j)}_π for j=1,…,r.\n- Pointwise distinctness holds as before.\n- For every z∈F, at least r functions have fibre size ≤1: \n  • If z∈[m], then ℓ_1^{-1}(z)=…=ℓ_r^{-1}(z)=∅, so r functions have fibre 0.\n  • If z∈B_j, then all heavy functions have fibre 0 at z, and all light functions ℓ_{j’} with j’≠j have fibre 0; in fact k−1 functions have fibre 0 and ℓ_j has fibre 1.\nThus for n=1 the property “for every z there exist at least s functions with |f_t^{-1}(z)|≤1” holds for any s≤r.\n- The conflict graph remains complete on |E|=m! by the same permutation argument (it uses only the heavy functions), so χ(E)=m!=(k−r)!.\nConsequences:\n- Even under the strictly stronger hypothesis “for each z at least s functions (s≤r) have fibres ≤1”, the required number of parts can be (k−s)!; in particular no bound of the form C(k,s)·n+O(1) with subfactorial C(k,s) can hold in general when n=1.\n- This also shows failure under the natural strengthening “there exists a fixed t with |f_t^{-1}(z)|≤1 for all z” (i.e., one injective function), by taking r≥1.\n\nRelation to the n* parameter\nLet n*:=max_{z} min_{t} |f_t^{-1}(z)|. In the above constructions, n*=0 (since some function avoids every z), so linear bounds in n* alone are vacuous for these families. The earlier permutation-only instance has n*=(k−1)! and χ=k·n*, showing any universal inequality χ≤c(k)·n* must have c(k)≥k. Our “light+heavy” instances complement this by showing that controlling n (even n=1) without preventing zero-fibres is far too weak.\n\nExamples\n- k=4, r=1, m=3: E=S_3, |E|=6. Need χ=6>3=2n+1. One light (injective) function suffices to force n=1.\n- General k≥4 with r=1 gives χ=(k−1)! against n=1.\n- General k and any s≤k−2: pick r=s to ensure “≥s small fibres per z”; then χ=(k−s)! with n=1.\n\nObstacles and remarks\n- For k=3, the m=2 construction yields |E|=2≤3, so it does not disprove the 2n+1 bound. A dedicated k=3 counterexample with n small and χ>3 would require a different design; worth exploring separately.\n- If one forbids “cheating by zeros” by requiring every z lie in the image of every function, then n*≥1 and the permutation-only instance shows χ≥k·n*. Whether stronger impossibility results persist under such surjective constraints across all k functions is an interesting next step.\n\nNext steps\n- Seek k=3 counterexamples with n as small as possible and χ>2n+1.\n- Investigate constraints like “every z appears in at least t functions” (t≥2) and quantify the minimal number of parts; our heavy+light family already gives χ=(k−t)! with n=1 when t≤k−1.\n- Explore whether completeness with m heavy functions is best possible (is |E|≤m! necessary for completeness under pointwise distinctness?). Proving such a cap would clarify optimality.\n"
}