{
  "content": "Ideas\n- We can force the conflict graph G (vertices E; x–y edge if ∃ p≠q with f_p(x)=f_q(y)) to be complete while keeping the hypothesis parameter n* = max_z min_t |f_t^{-1}(z)| equal to 1. Then any bound of the form χ(G) ≤ c(k) n* must satisfy c(k) ≥ χ(G), yielding the strongest possible lower bound on c(k) from n*=1 instances. We also want this construction to remain valid under natural strengthenings (e.g., many indices at each z having small fibres).\n- Finite projective planes supply exactly such instances, and they are optimal for n*=1: they give χ(G)=k^2−k+1 with n*=1, and one cannot make χ(G) larger in an n*=1 instance.\n\nConstruction (projective plane, n*=1, complete G)\n- Let q be a prime power and set k:=q+1. Let F be the set of points and E the set of lines in the projective plane PG(2,q). Then |E|=|F|=q^2+q+1=k^2−k+1. Each line has exactly k points; each point lies on exactly k lines; any two lines meet in exactly one point.\n- Consider the incidence bipartite graph B with parts F and E. It is k-regular on both sides, hence has a proper k-edge-coloring by Kőnig’s line-coloring theorem. For each i∈[k], define f_i(L) to be the unique point z∈L such that the incidence edge (z,L) is colored i.\n- Check:\n  1) Pointwise distinctness: for each line L, the k incident edges have pairwise distinct colors, hence the values f_1(L),…,f_k(L) are distinct.\n  2) Fibre sizes: for each point z and color i, there is exactly one line L through z whose incidence edge has color i; hence |f_i^{-1}(z)|=1 for all z,i. Therefore n* = max_z min_i |f_i^{-1}(z)| = 1.\n  3) Completeness of G: let L≠M be lines. They meet at a unique point z. At z, the two incidences (z,L),(z,M) receive distinct colors p≠q (proper edge-coloring). Thus f_p(L)=z=f_q(M) with p≠q, so L and M are adjacent. Hence G is complete on |E|=k^2−k+1 vertices.\n- Consequence: χ(G)=|E|=k^2−k+1 while n*=1. This is a very strong counterexample: the “2n+1” target equals 3, but one needs k^2−k+1 parts. It also satisfies the much stronger fibre condition “for every z and every i, |f_i^{-1}(z)|=1”.\n\nOptimality for n*=1\n- Claim. For any instance with k functions, pointwise distinct outputs, n*=1, and complete conflict graph, one has |E| ≤ k^2−k+1; hence χ(G) ≤ k^2−k+1.\n- Proof. Let m:=|E|. For x∈E write S_x={f_i(x): i∈[k]}, so |S_x|=k. Completeness implies S_x∩S_y≠∅ for all x≠y. For z∈F, let d(z):=|{x∈E: z∈S_x}|. If two distinct x,y both contain z, they must use different indices at z; otherwise their unique witness of equality at z would be via the same index, giving no edge. Thus d(z) ≤ k. Count pairs in two ways: every unordered pair {x,y} intersects in at least one z, so C(m,2) ≤ ∑_{z} C(d(z),2) ≤ |F|·C(k,2). Also incidences give mk = ∑_{z} d(z) ≤ k|F|, hence |F| ≥ m. Therefore C(m,2) ≤ m·C(k,2), i.e., (m−1)/2 ≤ k(k−1)/2, so m ≤ k^2−k+1. Equality holds in the projective plane construction. ∎\n- Thus for n*=1 the bound χ(G) ≤ (k^2−k+1) is best possible, and any universal linear bound χ(G) ≤ c(k)·n* must satisfy c(k) ≥ k^2−k+1.\n\nExamples\n- k=3 (Fano plane): |E|=7, n*=1, G=K_7. Required parts: 7 > 2n+1=3. This is a tiny, explicit, very strong counterexample.\n- General k: for any k, pick a prime power q≤k−1 and set k′=q+1. Use PG(2,q) to obtain |E|=q^2+q+1 ≥ Ω(k^2). Pad to k functions by giving each extra index a fresh value per x; this preserves pointwise distinctness, keeps n*=1, and keeps G complete. Hence for all k, we obtain χ(G) ≥ c·k^2 with n*=1.\n- Comparison: the permutation construction (E=S_k, f_i(π)=π(i)) gives χ(G)=k! and n*=(k−1)!, so χ/n*=k. The projective-plane family yields χ/n*=k^2−k+1, strengthening the lower bound on any c(k) from k to k^2−k+1.\n\nWhy useful here\n- Disproves the hoped-for “2n+1” partition for k≥3 in the strongest way: already for n=1 one needs Θ(k^2) parts.\n- Robust to weaker/stronger hypotheses: it satisfies even the stronger requirement that all k fibres at each z have size 1, so it defeats natural strengthenings of the hypothesis.\n\nObstacles and limits\n- Existence is guaranteed when k−1 is a prime power (projective planes PG(2,q)). For general k, padding with dummy indices preserves n*=1 and completeness, giving |E| ≳ k^2 up to constant factors (by Bertrand’s postulate choose a prime p∈(k/2,k]).\n- The upper bound m ≤ k^2−k+1 shows this family is optimal for n*=1: no n*=1 instance can force χ(G) larger than k^2−k+1.\n\nNext steps\n- Seek analogous near-optimal constructions for general n>1 achieving χ(G) ≳ (k^2−k+1)·n while keeping n* = n. This likely requires “layered” designs with controlled colour-multiplicities per z and pairwise-distinguishing labels across layers.\n- Investigate universal upper bounds of the form χ(G) ≤ C(k)·n. The n*=1 extremal bound suggests C(k) ≥ k^2−k+1 is necessary; can one prove χ(G) ≤ (k^2−k+1)·n always? If true, it would be tight up to equality at n=1.\n- Record small explicit instances (e.g., k=3,7 lines) for notes.md; they are easy for the verifier to check."
}