{
  "content": "# Goals this round\n- Make the “anchor-transfer” mechanism precise and correct the earlier flaw (recontamination when releasing an attachment vertex).\n- Prove h=2 on “necklaces” (cacti whose block–cut tree is a path) with an explicit invariant.\n- Prove h≤3 on all connected cacti via a two-anchors-plus-sweeper barrier.\n- State the periodic-lift criterion rigorously (with proof) as a reusable verification tool.\n\n# Preliminaries and notation\n- R-dynamics: R_1=V\\S_1 and R_{t+1}=N(R_t)\\S_{t+1}. A schedule wins by time T iff R_T=∅.\n- Permanent blockers (proved earlier): if U⊆S_t for all t, the evolution equals that on G−U with shots S_t\\U.\n- A cactus graph is one where each edge belongs to at most one simple cycle. The block–cut tree BCT(G) is a tree whose “B-nodes” are blocks (2-connected components; here cycles or K_2 edges) and “C-nodes” are cut vertices.\n- For a cycle block B, let attach(B) be the union of B and all tree components attached to vertices of B; for an edge block E=K_2, define attach(E)=E (plus its pendant trees if any).\n\n# Anchor-transfer and barrier maintenance\n\nLemma 1 (Transfer with local vacuum). Let G be a cactus. Let X and Y be consecutive cycle blocks in BCT(G) sharing the cut vertex a (i.e., …—X—a—Y—…). Fix indices so that “left” is the direction of X and “right” that of Y. Suppose at some time t we have:\n- a ∈ S_s for all s ≤ t (a anchored up to t),\n- R_t ∩ (attach(X) \\ {a}) = ∅ and R_t ∩ (attach(Y) \\ {a}) = ∅,\n- R_t has no vertex strictly to the left of a (i.e., in blocks whose unique connection to a lies through X).\nThen if we shoot S_{t+1} ⊇ {a,b}, where b is the next cut vertex to the right of a (i.e., b∈V(Y) is the articulation to the next block), and for all s ≥ t+1 we keep b ∈ S_s (anchor moves to b), we get for all s ≥ t+1,\nR_s ∩ (attach(X) ∪ attach(Y) \\ {b}) = ∅.\n\nProof. At time t, by assumptions, R_t contains nothing in attach(X)\\{a} and attach(Y)\\{a}, and nothing to the left of a. At step t+1 we shoot a and b, so R_{t+1} contains no a,b. Any vertex v in attach(X)∪attach(Y)\\{b} can enter R_{t+2} only if some neighbor u∈R_{t+1} lies in attach(X)∪attach(Y) (since in a cactus the only neighbors outside enter through cut vertices a or b). But u cannot be a or b (shot at t+1) and, by hypothesis, no other vertex in attach(X)∪attach(Y) belongs to R_{t+1}. Hence R_{t+2}∩(attach(X)∪attach(Y)\\{b})=∅. Inductively, for s≥t+1, the only possible re-entry into attach(X)∪attach(Y) from outside is via b, but b is shot in all rounds ≥t+1. Thus the intersection stays empty. ∎\n\nRemark. The “no vertex strictly to the left of a” clause is the global invariant that prevents recontamination from the left through the cut vertex preceding a.\n\n# Necklaces have h=2\nA necklace is a connected cactus whose BCT is a path and whose blocks are cycles (pendant trees allowed on cycle vertices).\n\nTheorem 2 (Necklace capture with 2 hunters). If G is a necklace with m≥1 cycle blocks arranged along a path B_1 — v_1 — B_2 — v_2 — … — v_{m−1} — B_m, then h(G)=2.\n\nProof. Lower bound: m≥1 implies a cycle subgraph, so h≥2.\nUpper bound: We present a 2-hunter schedule in m phases, maintaining this invariant after completing phase i and transferring the anchor: for the current articulation v_i (with v_0 undefined), we have\nI(i): R ∩ (attach(B_1) ∪ … ∪ attach(B_i) \\ {v_i}) = ∅ and v_i ∈ S at all subsequent rounds until the next transfer.\nBase (i=1): Anchor v_1. In phase 1, permanently shoot v_1 and, with the second hunter, execute a 1-hunter sweep on the forest F_1 := (attach(B_1) ∪ attach(B_2)) \\ {v_1}. By permanent blockers, the evolution on G−{v_1} restricted to F_1 matches the tree sweep, yielding R ∩ F_1 = ∅ at the end of the phase. Now transfer the anchor to v_2 by one round shooting {v_1, v_2}. By Lemma 1 (with X=B_1, Y=B_2, a=v_1, b=v_2) and noting there is no left-of-v_1 region, we obtain I(2).\nInductive step: Suppose I(i) holds for some 1<i<m. In phase i, keep v_i anchored and use the second hunter to sweep the forest F_i := (attach(B_i) ∪ attach(B_{i+1})) \\ {v_i}. This empties R ∩ F_i. Then transfer the anchor to v_{i+1} by one round shooting {v_i, v_{i+1}}. The “no left-of-a” condition of Lemma 1 is exactly I(i); applying Lemma 1 with a=v_i, b=v_{i+1}, X=B_i, Y=B_{i+1} yields I(i+1).\nAfter phase m−1 we have I(m). Finally, keep v_{m} undefined and just observe that I(m) says R ∩ (attach(B_1) ∪ … ∪ attach(B_m))=∅ since there is no v_m; the graph is covered by these attaches, hence R=∅. Thus 2 hunters suffice. ∎\n\n# General cacti have h≤3\n\nTheorem 3 (Three hunters suffice on connected cacti). If G is a connected cactus with at least one cycle, then h(G) ≤ 3; if G is a tree, h(G)=1.\n\nProof. Trees: h=1 as proved earlier. Assume at least one cycle. Root BCT(G) at an arbitrary block. Maintain two permanent anchors at two neighboring cut vertices along a currently chosen BCT edge e=(c,left)–(c,right) on the unique path from the root to the current frontier; more precisely, we keep both cut vertices u,v incident to the current frontier block anchored at all times. The third hunter acts as a sweeper.\nInvariant J(T): Let H_left be the union of blocks and attachments strictly on the root side of the anchored edge {u,v} (including the block between u and v). Then R ∩ (H_left \\ {u,v})=∅.\nInitialization: start with any cycle block incident to the root and choose its two cut vertices u,v; anchor {u,v}. Within that block and its attachments, G−{u,v} is a forest; sweep it with the third hunter to establish J.\nProgress: If there remains some block on the non-root side incident to v, advance the frontier one step: in one round, keep u anchored and shoot the next cut vertex w beyond v using the sweeper (so the two anchors become {v,w} at the next step); in the following round, drop u and keep {v,w} anchored. During the transfer round, both v and w are shot; a verbatim adaptation of Lemma 1 (with a two-vertex barrier in place) yields preservation of J with the new anchored edge {v,w}. With J holding, sweep the block between v and w (and its attachments) using the third hunter (again a forest after removing {v,w}). Repeat until all blocks have been passed; then the residual R is empty.\nBecause at all times two anchors form a barrier cutting the explored (left) side from the unexplored (right) side in the tree BCT, recontamination of H_left is impossible. The sweeper only targets forests obtained by removing the two anchors from a single cycle block plus attachments. Hence 3 hunters suffice. ∎\n\nRemark. Whether h(G)=2 holds for all cacti remains open here. The construction above shows h(G)≤3 and is tight with respect to the general bound h≤pw+1 since cacti may have pathwidth 2 or larger.\n\n# Periodic-lift criterion (rigorous)\n\nLemma 4 (Periodic schedule correctness via time-lift). Fix p≥1 and a p-periodic schedule S_1,…,S_p repeated indefinitely. Build the directed graph H on vertex set V×{1,…,p} with arcs (x,i)→(y,i+1 mod p) whenever xy∈E(G) and y∉S_{i+1}. Then the schedule is winning iff H is acyclic. Moreover, if acyclic, capture occurs within ≤ p·|V| rounds.\n\nProof. Let f be the round-to-round transition R↦N(R)\\S_{next}. Over one period, define F:=f_p∘…∘f_1; then R_{t+p}=F(R_t). The set of infinite avoiding walks corresponds exactly to directed cycles in H: a cycle (v_1,i_1)→…→(v_q,i_q)→(v_1,i_1) gives a p-periodic walk avoiding shots; conversely any infinite avoiding walk induces a directed cycle in the finite graph H by pigeonhole (same layer and vertex repeat). Thus the schedule wins iff H has no directed cycle. If acyclic, the longest path in H has length < p·|V|, bounding the capture horizon. ∎\n\n# Algorithmic consequences\n- Necklaces: linear-time recognition and h computation: h=1 if acyclic; else h=2 by Theorem 2. A schedule can be constructed by emitting, for each i, the anchored tree-sweep on F_i then one transfer round.\n- Cacti: h≤3 always; constructing a 3-hunter schedule follows Theorem 3. Determining whether h=2 on a given cactus remains open; Theorem 3 offers a constructive YES with k=3 and a NO lower bound h≥2 if a cycle exists.\n- Periodic verification: for any fixed k and proposed period p, checking the p-periodic schedule reduces to an acyclicity test on |V|·p nodes.\n\n# Examples and sanity checks\n- Necklace of three cycles: B_1—v_1—B_2—v_2—B_3. Phase 1 anchor v_1: sweep attach(B_1)∪attach(B_2) minus v_1; transfer to v_2; phase 2 anchor v_2: sweep attach(B_2)∪attach(B_3) minus v_2; done.\n- Cactus “Y” of cycles: A central cycle with three leaf cycles attached via distinct cut vertices. Anchors start on two adjacent cut vertices around the central cycle; sweep the central block; then pivot anchors along each branch in turn, preserving J, sweeping each leaf cycle; completes with 3 hunters.\n\n# Obstacles\n- Extending h=2 to all cacti needs a barrier that prevents recontamination through multiple previously released cut vertices without exceeding two shots per round. The two-anchor invariant solves this but needs three hunters (two anchors + one sweeper). It is unclear whether a subtler 2-hunter schedule can maintain a moving barrier across branches.\n- Proving lower bounds >2 on cacti (to show tightness of h≤3) requires new obstructions beyond minimum degree or bipartite minors; searching for small counterexamples computationally is advised.\n\n# Next steps\n- Implement a generator for cacti up to n≈14 and exhaustively determine h via R-BFS and the periodic-lift checker for k=2. Either find a cactus with h=3 or strengthen the 2-hunter strategy across branches.\n- Formalize h ≤ pw(G)+1 with precise coupling to monotone mixed search (Kinnersley; Fomin–Thilikos) for inclusion in proofs.md.\n- Design an XP algorithm for fixed k on graphs with small FVS: enumerate U of size ≤k−1; for each, simulate anchored multi-phase sweeps using at most k−|U| extra hunters on the forest components glued to U via the separator composition lemma.\n- Seek bounded-period guarantees p=f(k) for optimal schedules; even for k=2, a polynomial bound on p would yield an n^{O(k)} verification-by-search procedure via Lemma 4.\n\n# Summary of new rigorous content\n- Lemma 1: Corrected anchor-transfer under a local vacuum and a one-round overlap, preventing recontamination.\n- Theorem 2: h=2 for necklaces (block–cut path of cycle blocks with pendant trees), with a clean phase invariant and explicit construction.\n- Theorem 3: h≤3 for all connected cacti via a two-anchors-plus-sweeper barrier.\n- Lemma 4: Periodic-lift criterion with proof and capture-time bound ≤p·|V|.\n"
}