{
  "content": "Ideas\n- Separate two notions of guarantees: (A) graph-level (unconditional) guarantees that hold for all weight matrices W (with zero diagonal) and all external fields h consistent with the digraph; (B) guarantees that require additional structure on W (e.g., symmetry, unsignedness, structural balance), possibly per-SCC.\n- Provide a sharp graph-level classification (necessary and sufficient): the dependency digraph is a DAG. Give a short, checkable proof (constructive for sufficiency; cycle obstruction for necessity).\n- Refine SCC-wise analysis: (i) 2-node SCCs are universally PNE-admitting for all external fields iff the two arcs have the same sign (equivalently, the 2-node signed subgraph is structurally balanced). (ii) Odd-negative-cycle obstruction with dominant edges: a sufficient condition for nonexistence under h=0.\n- Note algorithmic implications: linear-time recognition (acyclicity), linear-time constructive PNE on DAGs; SCC topological construction under per-SCC guarantees (undirected/structural balance).\n\nTheorem 1 (graph-level classification: for all W,h)\nLet G=(V,E) be the dependency digraph (i→j iff W_{ij}≠0). The following are equivalent:\n(i) For every weight matrix W with zero diagonal supported on E and every h∈ℝ^V, the SNC game u_i(x)=h_i x_i + x_i∑_j W_{ij}x_j admits a pure Nash equilibrium.\n(ii) G is acyclic (a DAG).\nProof. (ii⇒i) Order vertices v_1,…,v_n topologically so i→j implies i<j. Construct x by backward induction: for k=n,…,1, pick x_{v_k}∈argmax_{a∈{±1}} a(h_{v_k}+∑_{j>k}W_{v_kj}x_{v_j}). Because u_{v_k} depends only on out-neighbors among indices >k, x_{v_k} is a best response in the final profile. This yields a PNE. (i⇒ii) Suppose G has a directed cycle C=(i_1→i_2→…→i_k→i_1). Choose h=0 and set all off-cycle weights to 0. Pick cycle weights so that the local best-response constraints along C become x_{i_ℓ}=s_ℓ x_{i_{ℓ+1}} with s_ℓ∈{±1} and ∏_{ℓ=1}^k s_ℓ=-1 (e.g., take all W_{i_ℓ,i_{ℓ+1}}<0 if k is odd; or pick an odd number of them negative if k is even). Then any PNE would have to satisfy these k constraints simultaneously, which is impossible since multiplying them yields 1=∏ s_ℓ=-1. Hence there exists W,h with no PNE, contradicting (i). ∎\nRemarks.\n- The necessity argument is robust: taking large-magnitude cycle weights (and zero elsewhere) makes the contradictions strict; we used h=0.\n- Thus, among graph-only guarantees (no structure assumed on W), DAGs are exactly the graphs that force existence for all W,h.\n\nProposition 2 (2-node SCCs; universal across external fields, fixed W)\nConsider a 2-player SCC with utilities u_1(x)=x_1(W_{12}x_2+h_1), u_2(x)=x_2(W_{21}x_1+h_2). The subgame admits a pure Nash equilibrium for every h∈ℝ^2 if and only if W_{12} and W_{21} have the same sign (including zero), equivalently the 2-node signed subgraph is structurally balanced.\nProof. If sgn(W_{12})=sgn(W_{21}), then after the gauge transform σ=(1,sign(W_{12})), [σ]W[σ] has both off-diagonals ≥0, hence the game is supermodular for any h and has a PNE. Conversely, if sgn(W_{12})≠sgn(W_{21}), with h=0 one gets the “discoordination” game (Example: W_{12}=1, W_{21}=-1) which has no PNE, hence not universally PNE-admitting. ∎\n\nLemma 3 (odd-negative-cycle obstruction under dominance)\nLet C be a directed cycle i_1→…→i_k→i_1. Suppose h=0 and there exist weights on cycle edges only, with |W_{i_ℓ,i_{ℓ+1}}|≫0 and sgn(W_{i_ℓ,i_{ℓ+1}}) chosen so that ∏_{ℓ=1}^k(-sgn(W_{i_ℓ,i_{ℓ+1}}))=-1. Then the SNC game has no PNE.\nProof. For each i_ℓ, the unique out-neighbor on the cycle dominates the local field, forcing the best-response constraint x_{i_ℓ}= -sgn(W_{i_ℓ,i_{ℓ+1}}) x_{i_{ℓ+1}}. Multiplying around the cycle yields a contradiction as above. ∎\nCorollary. Any SCC containing such an odd-parity signed cycle is not universally PNE-admitting across external fields (for the fixed W in Lemma 3).\n\nSCC-wise constructive existence (under per-SCC structure)\n- If each SCC U induces a subgame that is universally PNE-admitting for all external fields on U (examples: W_{UU} symmetric ⇒ exact potential; or ∃σ_U with [σ_U]W_{UU}[σ_U]≥0 ⇒ supermodular), then the full game admits a PNE. Construction: compute SCC condensation DAG, process SCCs in reverse topological order, freezing later components as external fields for earlier ones. This reproduces the theorem stated in the previous round with a precise dependency orientation justification.\n\nAlgorithmic notes\n- Graph-only guarantee: test acyclicity in O(|V|+|E|). If DAG, compute a PNE by a single backward pass (linear time).\n- With per-SCC structural tests: compute SCCs (Tarjan/Kosaraju), then per SCC test: (a) symmetry W_{ij}=W_{ji} (trivial); (b) structural balance via parity constraints σ_iσ_j=sgn(W_{ij}) (union-find with parity in O(|U|+|E_U|)); gauge if feasible. Then solve per-SCC PNE (potential: any local-improvement path terminates; unsigned after gauge: monotone BR).\n\nConnections to known sufficient classes (recap)\n- Undirected W: exact potential ⇒ PNE for any h.\n- Unsigned W≥0: supermodular ⇒ PNE for any h.\n- Structurally balanced (directed sense): ∃σ s.t. [σ]W[σ]≥0 ⇒ PNE for any h.\n- DAGs: unconditional (graph-only) guarantee for all W,h (Theorem 1).\n- Cohesive cores R⊔S from the paper: if w_i^R + a h_i ≥ w_i^S (or w_i^R + τ_i h_i ≥ w_i^S) and the S-subgame (with R frozen) has PNE (e.g., S undirected or structurally balanced), then a global PNE exists with x_R fixed to consensus/polarization.\n- Weight-dominance: if |h_i|>∑_j|W_{ij}| ∀i, then x=sgn(h) is a strict PNE.\n\nExamples\n- Directed 3-cycle with W_{i,i+1}=-1, h=0: no PNE (Lemma 3, k=3). Even cycles can also be made obstructive by choosing an odd number of negative edges on the cycle.\n- 2-node discoordination W_{12}=1, W_{21}=-1, h=0: no PNE (Proposition 2 converse).\n- DAG chain 1→2→3 with arbitrary W,h: PNE via backward induction x_3∈argmax, then x_2, then x_1.\n\nObstacles and limitations\n- Full characterization of “universally PNE-admitting for all external fields” SCCs (for fixed W) beyond the undirected and structurally balanced cases remains open. Lemma 3 gives a broad obstruction family.\n- Constructive per-SCC computation may be exponential in worst-case for potential games (general local-search), though existence is guaranteed.\n\nNext steps\n- Attempt necessity in the SCC setting: show that if W_{UU} is neither symmetric nor gauge-to-unsigned, then there exists an external field f making the subgame on U PNE-free (extend Lemma 3 to weighted, multi-outdegree cases).\n- Develop a parity-constraint/2-SAT formulation to test structural balance in directed sense and integrate weights to detect dominant contradictory cycles.\n- Provide end-to-end algorithm: (1) if G is DAG, output PNE by backward pass; else (2) decompose into SCCs and test each for symmetry or structural balance; if all pass, assemble PNE in reverse topological order; else (3) attempt cohesive-core conditions to salvage existence in mixed components. Verified complexity of steps and termination guarantees.\n"
}