{
  "content": "Ideas\nWe add two cycle-based, checkable criteria that (i) certify nonexistence of PNE (an obstruction) and (ii) enlarge the library of “universally PNE-admitting” SCCs beyond undirected/structurally balanced components. Both rely on a clean dominance inequality on a directed simple cycle that forces local best-responses irrespective of all other influences.\n\nSetup and shorthand\n- SNC game: u_i(x)=h_i x_i + x_i∑_j W_{ij}x_j, x_i∈{±1}. Player i depends only on out-neighbors {j: W_{ij}≠0}.\n- For a directed simple cycle C=(i_1→i_2→…→i_k→i_1), let s_r=sgn(W_{i_r,i_{r+1}})∈{±1} and define the dominance margin at i_r:\n  M_{i_r}:=|W_{i_r,i_{r+1}}| − (|h_{i_r}| + ∑_{j≠i_{r+1}} |W_{i_r j}|).\n- Dominance on C means M_{i_r}>0 for all r.\n\nLemma 1 (Dominant negative cycle obstruction)\nAssume there exists a directed simple cycle C with dominance (M_{i_r}>0 ∀r) and negative sign product ∏_{r=1}^k s_r = −1. Then the SNC game has no pure Nash equilibrium.\nProof.\nFix any profile x. Under dominance, for each r the best response at i_r is uniquely forced by the successor’s action: BR condition is x_{i_r}=s_r x_{i_{r+1}} because sgn(h_{i_r}+∑_j W_{i_rj}x_j)=sgn(W_{i_r,i_{r+1}}x_{i_{r+1}}). In a PNE x^*, these k equalities must hold simultaneously, hence x^*_{i_1}=(∏_r s_r)x^*_{i_1}=−x^*_{i_1}, impossible. ∎\n\nLemma 2 (Dominant positive cycle is universally PNE-admitting)\nAssume a directed simple cycle C has dominance (M_{i_r}>0 ∀r) and positive sign product ∏_{r=1}^k s_r = +1. Then, for the subgame on C with arbitrary “external field” f∈ℝ^C (i.e., utilities u_i(y)=y_i(∑_{j∈C}W_{ij}y_j + f_i)), there exist exactly two PNE on C, obtained by choosing x_{i_1}∈{±1} arbitrarily and propagating x_{i_r}=s_r x_{i_{r+1}} around the cycle; these best-responses are independent of f.\nProof.\nFor any f and any assignments outside C, the total nondominant contribution to i_r’s BR term has magnitude ≤ |h_{i_r}|+∑_{j≠i_{r+1}}|W_{i_rj}|, strictly smaller than |W_{i_r,i_{r+1}}| by dominance; hence the sign of the BR term equals sgn(W_{i_r,i_{r+1}} x_{i_{r+1}}), yielding the constraints x_{i_r}=s_r x_{i_{r+1}}. Positive product makes these constraints consistent with exactly two solutions. ∎\n\nCorollary (SCC composition with dominant cycles)\nLet the SCCs of the dependency digraph be C_1,…,C_m, ordered so edges go only from C_k to C_ℓ with k<ℓ. Suppose each SCC is one of:\n- undirected (exact potential ⇒ PNE for all external fields);\n- structurally balanced (gauge to unsigned ⇒ supermodular ⇒ PNE for all external fields);\n- a directed simple cycle satisfying dominance with positive sign product (by Lemma 2).\nThen the full game admits a PNE; a BR-path exists (solve SCCs in reverse topological order).\nProof.\nEach SCC is “universally PNE-admitting” under arbitrary external fields; apply the SCC composition theorem from the notes/current output. ∎\n\nExamples\n- Obstruction (no PNE): 3-cycle 1→2→3→1 with W_{12}=W_{23}=W_{31}=−2, h=0, no other out-arcs. Dominance holds (M_i=2>0) and product is (−1)^3=−1 ⇒ no PNE (Lemma 1).\n- Admissible cycle SCC: 4-cycle 1→2→3→4→1 with signs (+1,−1,−1,+1), weights |W|=3 on cycle, no other out-arcs, h=0. Dominance holds, product (+1)(−1)(−1)(+1)=+1. The two PNE on the cycle are the two assignments consistent with x_i = s_i x_{i+1}. If other SCCs exist downstream, compose by reverse topological order.\n\nObstacles/limits\n- Dominance is strong; without it, other neighbors can flip BR signs and break the cycle constraints. Lemma 1 then need not hold; counterexamples exist.\n- The “cycle” class enlarges but does not exhaust universally PNE-admitting SCCs.\n\nNext steps (auditable)\n- Relax dominance to “strict majority” on each i along the cycle and quantify robustness margins.\n- Characterize all universally PNE-admitting SCCs: e.g., exact-potential polymatrix blocks beyond symmetry, or classes defined by positive sign of every directed cycle plus suitable weight inequalities.\n- Implement a checker: find SCCs; within each, test (i) symmetric, (ii) structurally balanced (2-coloring of sign constraints), (iii) dominant-cycle condition (linear-time along cycles if SCC is a simple cycle). Construct PNE by reverse SCC order."
}