{
  "content": "Ideas\n\n- We add two new, checkable graph classes that guarantee existence of a pure Nash equilibrium (PNE) for every choice of real weights W and biases h in signed network coordination (SNC) games with binary actions x_i∈{±1} and utilities u_i(x)=x_i(h_i+∑_j W_{ij}x_j). Dependency arc i→j is present iff W_{ij}≠0 (i’s utility depends on its out-neighbor j).\n- We also give simple sufficient “weight-dominance” conditions ensuring a strict PNE, and an algorithmic checker for structural balance on strongly connected components (SCCs) via cycle-parity constraints.\n\nNew sufficient classes and lemmas\n\n1) Weight dominance (strict PNE for any graph)\nLemma. If for all i∈V, |h_i|>∑_{j∈V}|W_{ij}|, then x^* with x^*_i=sgn(h_i) is a strict Nash equilibrium.\nProof. For any i and fixed x^*_{−i}, u_i(x)=x_i(h_i+∑_j W_{ij}x_j). At x^*, x^*_i h_i=|h_i| and |∑_j W_{ij}x^*_j|≤∑_j|W_{ij}|. Hence x^*_i(h_i+∑_j W_{ij}x^*_j)≥|h_i|−∑_j|W_{ij}|>0. Flipping i changes utility by −2x^*_i(h_i+∑_j W_{ij}x^*_j)<0, so i is a strict best responder. Since i is arbitrary, x^* is a strict PNE.\n\n2) Forest with sign-symmetric digons ⇒ PNE (new graph class)\nDefinition. The underlying undirected graph of a directed signed network has an undirected edge {i,j} iff at least one of (i,j) or (j,i) is an arc. A digon on {i,j} occurs if both directions are present. A digon is sign-symmetric if sign(W_{ij})=sign(W_{ji}).\n\nTheorem (Forests with sign-symmetric digons ⇒ PNE). If the underlying undirected graph is a forest and every digon is sign-symmetric, then for any real W,h the SNC game admits a PNE.\nProof. In a forest, every directed cycle must be a digon; hence each strongly connected component (SCC) is either a singleton or a 2-node digon {i,j}. For a singleton, the induced subgame is trivially universally PNE-admitting (for any external field). For a 2-node SCC with sign-symmetric digon, pick σ∈{±1}^{\nobreak{ {i,j} }} with σ_iσ_j=sign(W_{ij}) (which equals sign(W_{ji})). Then [σ]W_{ {i,j},{i,j} }[σ] has both off-diagonal entries nonnegative, so the 2-player subgame is unsigned and hence supermodular; thus for any external field f it admits a PNE; mapping back by x←[σ]y preserves PNE. Therefore each SCC is “universally PNE-admitting” (admits a PNE for all external fields). The SCC condensation digraph is acyclic (no directed cycles beyond SCCs). By the SCC composition theorem (process SCCs in reverse topological order, treating downstream choices as external fields), the whole game admits a PNE.∎\n\nRemark. The sign-symmetry condition on digons is tight: with a 2-node digon of opposite signs (W_{12}>0, W_{21}<0), the subgame is the discoordination game, which has no PNE for h=0.\n\n3) SCC composition (constructive PNE, restated as a module)\nTheorem (SCC composition). Let C_1,…,C_m be SCCs of the dependency digraph in topological order (edges only from C_k to C_ℓ with k<ℓ). If each induced subgame on C_k is universally PNE-admitting (e.g., C_k is undirected, or structurally balanced as per the directed convention below, or 2-node sign-symmetric digon), then for any W,h the full game admits a PNE, constructible by solving SCCs from sinks upwards.\nSketch. For the sink C_m, pick a PNE (depends only on x_{C_m},h). Given choices on C_{k+1},…,C_m, treat f^{(k)}=h_{C_k}+W_{C_k,>k}x_{>k} as an external field and select a PNE on C_k by the universal property. Concatenate.\n\n4) Structural balance in SCCs via cycle parity (algorithmic check)\nDirected structural balance (convention). A subgraph U is structurally balanced if ∃σ∈{±1}^U with [σ]W_{UU}[σ]≥0 (entrywise) i.e., W_{ij} has the same sign as σ_iσ_j for every arc i→j in U.\nProposition (cycle-parity characterization on SCCs). In a strongly connected U, the following are equivalent:\n- U is structurally balanced;\n- For every directed cycle C in U, the product of edge signs along C equals +1.\nProof. If σ exists, then for cycle i_1→…→i_k→i_1, ∏ sign(W_{i_t i_{t+1}})=∏ σ_{i_t}σ_{i_{t+1}}=1. Conversely, in an SCC, pick a root r and set σ_r=1; for any v, pick a directed path r→…→v and set σ_v to the product of edge signs along the path. Strong connectivity and positive sign on all directed cycles imply this definition is path-independent. Then σ_iσ_j=sign(W_{ij}) on each arc i→j, hence [σ]W_{UU}[σ]≥0.\nThis yields an O(|U|+|E(U)|) check (e.g., maintain parity labels along a spanning arborescence; detect a violation upon encountering a back edge whose cycle has negative sign).\n\nExamples\n\n- Forest with sign-symmetric digons. Take a star on center c with arcs both ways to leaves ℓ, with W_{cℓ}=a_{ℓ}, W_{ℓ c}=b_{ℓ}, and sign(a_{ℓ})=sign(b_{ℓ}) for all ℓ; plus arbitrary outward arcs from leaves to outside (acyclic condensation). Each 2-node digon {c,ℓ} is structurally balanced; singletons elsewhere are trivial. A PNE exists by the SCC composition theorem.\n- Counterexample (sign-asymmetric digon). Two nodes with W_{12}=1, W_{21}=−1, h=0 is the discoordination game: no PNE. This violates the digon sign-symmetry condition.\n\nObstacles\n\n- Characterizing “universally PNE-admitting” SCCs beyond undirected and structurally balanced: necessary and sufficient conditions appear to reduce to potentiality (W_{UU} symmetric) or transformability to unsigned (structural balance) for polymatrix binary games; broader classes require care.\n- Necessary conditions for PNE in general SCCs (with h=0): negative-signed directed cycles obstruct structural balance but may be rescued by weight/bias magnitudes; clean graph-only necessity is subtle.\n\nNext steps (auditable)\n\n- Implement a polynomial-time pipeline: (i) compute SCCs and condensation DAG; (ii) for each SCC, check symmetry (W_{UU}=W_{UU}^T) or structural balance via cycle parity; (iii) if all pass, construct a PNE by reverse topological order. If not, test the “forest with sign-symmetric digons” shortcut; else attempt cohesive-core conditions from the paper (choose R,S; solve S under frozen R) or weight-dominance.\n- Explore maximality: attempt to prove that if an SCC is neither undirected nor structurally balanced, then there exist external fields f causing nonexistence of PNE (extend discoordination/3-cycle counterexamples).\n- Quantify bias-dominates-frustration: for a target σ, define κ_i(σ)=∑_{j: σ_iσ_j≠sign(W_{ij})}|W_{ij}|−∑_{j: σ_iσ_j=sign(W_{ij})}|W_{ij}|; if σ_i h_i≥κ_i(σ) for all i, then σ is a PNE. This yields constructive sufficient conditions per-instance.\n\nProof snippets suitable for proofs.md\n\n- Weight-dominance lemma (strict PNE): as above.\n- Forest with sign-symmetric digons theorem: SCC classification + structural balance of 2-node sign-symmetric digons + SCC composition.\n- SCC structural balance cycle parity: equivalence on SCCs via path-product labeling and cycle consistency.\n"
}