{
  "summary_md": "Goal: show NEXPTIME-hardness of the 3-way LOCAL classification for β-normalized, r=1 LCLs on oriented paths by reducing Succinct-3SAT to Feasible-Function Existence (F1). The last round (prover-04) gives a concrete reduction P_C: radius-1 gadgets (HEAD · RID · GID · RUN) plus an existential witness-chain that, when S is colored, nondeterministically selects an index i and locally verifies Hot_RID[i] and the clause bit V^{(±)}[i] via a row-by-row U-simulation. Key bounds: |Types| ≤ ℓ_pump = 2^{Θ(β^4)}, finite Z ≤ ℓ_pump^2 for (F2), and extension-check DP in O(k β^2). Neutralizing (F2) with a ⊥-filler transfers F1-hardness to the three-way classification. Correctness (completeness/soundness) sketched; remaining formal work: explicit radius-1 adjacency tables, witness-chain formalization, and a separability lemma proving distinct RID/GID yield distinct context types. Verifier verdict: partial success.",
  "highlights": [
    "Reduction: Succinct-3SAT → Feasible-Function Existence (F1) via a radius-1 LCL P_C (proposed).",
    "Gadgets: blocks HEAD+RID+GID+RUN and an existential witness-chain checked locally by a fixed universal TM U (row-by-row tableau).",
    "Type/pumping bounds: |Types| ≤ ℓ_pump = 2^{Θ(β^4)}, enabling 2^B distinct variable/clause context types with β = poly(s).",
    "Algorithmic checks: (F2) requires checking z ≤ Z with Z ≤ ℓ_pump^2; partial-to-total extension decidable by layered DP in O(k β^2).",
    "Neutralizing (F2) with a global ⊥-filler makes (F1) equivalence decide O(1) vs Ω(n), transferring hardness to the 3-way classifier.",
    "Open technical gaps identified: radius-1 adjacency tables, explicit witness-chain rules, and an active-context separability lemma to prove type distinctness."
  ],
  "next_questions": [
    "Provide explicit radius-1 Cout–out / Cin–out tables for row separators, RUN seams, error chains and the witness-chain pointer gadget (with alphabet-size accounting).",
    "Prove the active-context separability lemma: show distinct RID/GID produce distinct types (different extendibility tables).",
    "Formalize the witness-chain gadget and prove correctness (local-checkability, existential choice semantics, and that non-matching pairs are forced inactive)."
  ]
}