{
  "feedback_md": "High-level assessment\n- The upper-bound ingredients (finite number of types for r=1; composition/pumping; DP for extension; finite-Z bound for (F2)) look solid across the reports and are worth recording formally. I have written them up as rigorous lemmas (with proofs) in output.md. They give a clean algorithmic skeleton for feasible-function verification and will be needed regardless of the hardness route.\n- The existing hardness sketches via Succinct-3SAT (reports 02–04) still have unresolved quantifier and type-invariance issues. Report 01 correctly identified the core mismatch for (F1) with clause-level existential quantification and proposed pivoting to Succinct 3-Coloring, which aligns with (F1)’s universal pair checks. This is the cleanest route so far and avoids the “exists a satisfied literal” difficulty.\n\nDetailed critique per prover\n- Prover 01 (pivot to succinct 3-coloring): Strong direction. Pairwise constraints “color(u) ≠ color(v) for edges” match (F1)’s for-all-pairs semantics if non-edges are gated to be vacuous. Two cautions to fix before formalization:\n  1) Seam codes cannot be O(1)-length and still distinguish 2^B indices. Instead, use a constant-size “pointer/handshake” near the boundary that leads into an O(poly(s))-size interior block where u (and v) are encoded and checked. Type separation can still be obtained by reserving a specific boundary-output probe that triggers an index-check subroutine reading the interior; different u must yield different yes/no outcomes under that probe.\n  2) Ensure the bridge computation depends only on locally available data: the two interiors (which the DP is free to complete) plus the global, fixed tables. The simulation of D(u,v) in the bridge region is standard via a 1D tableau, but write out the row interface carefully so all checks are radius-1 and locally refutable.\n  Value: High. This route plausibly leads to a clean NEXPTIME-hardness of (F1)-feasibility.\n\n- Prover 02 (boundary-keyed types and arbitrary truth tables): The idea of making identity a type property via boundary keys is good and we will need something like it. However, two claims are unjustified as stated:\n  1) “Realize any prescribed boundary truth table by tailoring plumbing around the 4 boundary nodes.” The Cout–out/Cin–out rules are global; you cannot choose a different truth table per type by local tailoring unless you encode distinguishing structure in the interiors that the boundary rules can detect uniformly. As written, this overstates our freedom.\n  2) Omissions remain on how the interior encodings enforce correctness while keeping radius 1 and type-invariance. Please avoid relying on arbitrarily programmable boundary truth tables; instead adopt the boundary-probe + interior-check mechanism (see Next steps).\n  Value: Mixed. The boundary-keyed separation principle is useful; the “arbitrary truth table” claim should be dropped.\n\n- Prover 03 (gating for 3SAT with local nondeterministic choice): Good diagnosis of the quantifier mismatch and a creative attempt to fix it with a bridge choice gadget. However, there is a fundamental issue: in the (F1) check the two S outputs are fixed to f(type_left), f(type_right). The bridge cannot “deactivate S” or alter those choices. Thus, for non-matching (Var_i, Cl_j) pairs, the only way to guarantee success for all ordered pairs would be to map at least one of the two types to ⊥ globally, which defeats the intended role of variable and clause types. Without a way to make non-matching pairs vacuous that is independent of f’s values, the gating does not resolve the mismatch. I recommend switching to the succinct 3-coloring route where no existential-in-clause is needed.\n  Value: Medium. Some gadget ideas may be repurposed (RID-forcing), but the existential-on-bridge approach is unnecessarily complex compared to 3-coloring.\n\n- Prover 04 (3SAT-based hardness): This repeats the quantifier error: (F1) is over all ordered pairs; restricting to “the three variables of a clause” is not allowed. The soundness/completeness argument does not go through as written. The positive parts (finite-Z for (F2), DP, rough bounds) are consistent with the lemmas we now formalize.\n  Value: Low for hardness, OK for upper-bound folklore.\n\nConcrete next steps (actionable)\n1) Formalize the type-composition lemma (now in output.md) and reuse it to present a precise bound Z ≤ |Types|^2 (or better) for (F2). This is already done.\n2) Pursue the succinct 3-coloring reduction (as per Prover 01), with these specific subtasks:\n   - Boundary-probe/type-separation lemma: Design a reserved boundary-output pattern and a radius-1 subroutine that, when invoked, walks to the interior, reads/validates the index u from a standard block format, and accepts iff u equals a prescribed value encoded near the boundary. Prove that this creates at least one distinct type per u.\n   - Seam handshake and bridge TM: Specify the constant-size interface near the seam and the row-by-row simulation schedule that computes D(u,v) within the bridge. Ensure all checks are local and errors are locally refutable.\n   - Gating non-edges: Enforce that if D(u,v)=0 the bridge always extends regardless of colors; if D(u,v)=1 the bridge extends iff the two colors differ. Prove soundness/completeness of the reduction.\n   - Neutralize (F2): Add a globally available ⊥-filler language that works for all repeated contexts so (F2) becomes vacuous.\n3) Keep the radius-1 and alphabet-size bookkeeping explicit: Σ_out size β = poly(|D|) should suffice; block sizes O(poly(|D|)) fit within pumped contexts.\n\nWe should not add hardness claims to output.md yet. Once the boundary-probe lemma and the bridge computation are written and verified, we can promote the hardness proof. Meanwhile, the formal lemmas on types/DP/finite-Z are now recorded and can be cited by the construction.",
  "new_notes_md": "Working model and notation (radius 1, β-normalized)\n- We study LCLs on globally oriented paths with fixed input alphabet Σ_in and output alphabet Σ_out of size β. The local legality is given by two global relations: Cin–out relating each input symbol to allowed output symbols at a node, and Cout–out relating allowed pairs of consecutive output symbols. The radius is 1.\n- A path segment w has four boundary nodes (two on the left, two on the right). For a fixed assignment to the four boundary inputs, we define the extendibility bitvector over all β^4 assignments to the four boundary outputs indicating for which boundary-output assignments there exists a legal extension to the interior.\n- The type Type(w) is the collection, over all 4-boundary input assignments, of these extendibility bitvectors. Two words share a type if they have identical extendibility behavior for all boundary input/output assignments. Let T be the finite set of all types realizable by some word.\n\nVerified technical facts (recorded in output.md)\n- Type bound: |T| ≤ |Σ_in|^4 · 2^{β^4}. Reason: a type is determined by four boundary input symbols and a Boolean function on the β^4 boundary output assignments.\n- Composition lemma: There is a computable binary operation ⊛ on T such that Type(uv) = Type(u) ⊛ Type(v) for all words u, v. Intuition: to decide extendibility of uv under a boundary-output assignment, one needs only (i) the extendibility tables of u and v, and (ii) existentially quantify over the two internal boundary outputs to satisfy Cout–out at the join.\n- Periodicity: For any fixed word w, the sequence τ_z := Type(w^z) is ultimately periodic with preperiod and period ≤ |T|. Thus the pair sequence (Type(w1^z), Type(w2^z)) is ultimately periodic with preperiod ≤ 2|T| and period ≤ |T|.\n- Finite-Z for (F2): Given any context (w1, S, w2), whether the (F2) check passes for all z ≥ 1 depends only on finitely many pairs (Type(w1^z), Type(w2^z)); it suffices to check z up to Z ≤ |T|^2 (a non-tight but simple bound).\n- DP for extension: For a fixed path with some outputs forced (e.g., on S), the existence of a global completion can be decided in O(k β^2) time for a length-k path by a layered dynamic program over output symbols.\n\nHardness direction we will pursue (pivot suggested by Prover 01)\n- Source problem: Succinct 3-Coloring of a graph G on V={0,1}^B, given by a circuit D(u,v) (size s) deciding adjacency; NEXP-complete.\n- Target LCL: Construct a β-normalized, r=1 instance P_D with Σ_out size β = poly(s). The plan:\n  1) For each u, build at least one context type τ_u whose boundary behavior (detected via a reserved boundary-probe) certifies that the interior encodes the index u in a standard, radius-1-checkable block. The interior also stores a copy of D on an input track and a runzone for a fixed TM U.\n  2) In a bridge between τ_u and τ_v, locally simulate U on input (D,u,v) across the seam for poly(s) steps to evaluate D(u,v); malformed simulations are locally refutable.\n  3) Gate constraints: if D(u,v)=0 (non-edge) allow completion regardless of colors; if D(u,v)=1 enforce color inequality across S. All other pairings (not recognized as vertex–vertex) are trivial.\n  4) Assigning a color to each τ_u by a feasible function f is then exactly a proper 3-coloring of G.\n  5) Make (F2) vacuous by allowing repeated sides to be filled with a globally available ⊥-plumbing language.\n\nOpen technical items for hardness (to be formalized next)\n- Boundary-probe/type-separation lemma: Exhibit a fixed boundary-output probe that, when used, triggers an interior index-check subroutine; show that for distinct indices u ≠ u′, the probe’s extendibility bit differs, hence τ_u ≠ τ_{u′}.\n- Seam handshake and computation: Specify the constant-size interface by which the bridge accesses (via pointers) the interior encodings of u and v and runs the 1D tableau for U for poly(s) steps, with radius-1 local checks and robust error refutations.\n- Alphabet/size bookkeeping: Keep Σ_out constant tracks (roles, colors, error, U’s work alphabet) constant, with β = poly(s) sufficient for all auxiliary symbols.\n- Soundness/completeness proof for the reduction P_D: G is 3-colorable iff a feasible f exists for P_D (with (F2) neutralized).\n\nCaveats and corrections logged\n- Short seam codes cannot distinguish exponentially many indices; instead use constant-size pointers/handshakes plus interior blocks that store and validate indices.\n- Do not attempt to “program arbitrary boundary truth tables per type” via Cout–out; all rules are global. Use boundary probes plus uniform interior checks to separate types.\n- For 3SAT-based reductions, the (F1) universal quantifier clashes with clause-level existential quantification unless one adds complex nondeterministic gating. The succinct 3-coloring pivot avoids this.\n",
  "new_notes_append": "True",
  "new_outputs_md": "Results validated for radius-1, β-normalized LCLs on oriented paths\n\nWhy these results matter\n- The decision procedures for feasible-function existence (and hence the O(1)/Θ(log* n)/Θ(n) classification on paths) rely on two ingredients: (i) that path segments admit a finite set of “types” which compose under concatenation, and (ii) that extendibility of partially labeled paths can be checked efficiently. The theorems below formalize these facts for radius 1 and yield a finite bound for the bridging (F2) checks.\n\nDefinitions (radius 1)\n- Fix finite alphabets Σ_in and Σ_out (|Σ_out| = β). Cin–out ⊆ Σ_in × Σ_out specifies allowed output symbols at a node given its input symbol. Cout–out ⊆ Σ_out × Σ_out specifies allowed pairs of consecutive output symbols along the oriented path. A labeling of outputs y_1…y_k over an input x_1…x_k is legal if (x_i, y_i) ∈ Cin–out for all i and (y_i, y_{i+1}) ∈ Cout–out for all i.\n- For a word w of length k ≥ 2, let the four boundary positions be i=1,2 and i=k-1,k. For a fixed assignment a ∈ Σ_in^4 to the boundary inputs (x_1, x_2, x_{k-1}, x_k), define E_w(a) ⊆ Σ_out^4 to be the set of boundary-output assignments b = (y_1, y_2, y_{k-1}, y_k) for which there exists a legal output labeling y_1…y_k extending b, given the boundary inputs a (interior inputs may be arbitrary in Σ_in; if the model fixes interior inputs, the definition is with respect to those fixed inputs). The type of w, Type(w), is the map a ↦ E_w(a). Let T be the set of all types realized by some w.\n\nTheorem 1 (Finite number of types and an explicit bound)\nLet m := |Σ_in|. For radius 1 we have |T| ≤ m^4 · 2^{β^4}.\nProof. For each fixed boundary-input assignment a there are exactly β^4 possible boundary-output assignments; E_w(a) is an arbitrary subset of these, hence at most 2^{β^4} possibilities. There are m^4 possible a’s. The type is fully determined by the tuple (a, E_w(a))_{a∈Σ_in^4}. Thus the total number of distinct types is at most m^4 · 2^{β^4}.\n\nLemma 2 (Composition of types under concatenation)\nThere is a computable binary operation ⊛: T × T → T such that for all words u, v we have Type(uv) = Type(u) ⊛ Type(v).\nProof. Fix boundary inputs a on uv, i.e., inputs on positions 1,2 and at the last two positions of uv. For each boundary-outputs choice b on uv, extendibility is equivalent to the existence of output symbols p,q ∈ Σ_out at the shared boundary between u and v (the last two outputs of u = first two of v) such that:\n- (i) (Type(u) under its corresponding boundary inputs) accepts the boundary outputs given by the left two outputs of b together with p,q; and\n- (ii) (Type(v) under its corresponding boundary inputs) accepts p,q together with the right two outputs of b; and\n- (iii) the two internal adjacencies across the u|v seam are allowed by Cout–out (these involve only (y_{|u|-1}, y_{|u|}) = (p_left, p_right) and (p_left, p_right) = (y_1, y_2) of v, but these are exactly the p,q we quantify over).\nBecause radius is 1, no other interior constraints couple u and v. Thus extendibility of uv under (a,b) can be decided solely from Type(u), Type(v), and Cout–out by existentially quantifying p,q. Defining ⊛ to implement this decision for all (a,b) yields Type(uv) = Type(u) ⊛ Type(v).\n\nLemma 3 (Ultimate periodicity of repeated concatenation)\nFix w and let τ := Type(w). Define the sequence σ_1, σ_2, … in T by σ_z := Type(w^z). Then σ_{z+1} = σ_z ⊛ τ for all z ≥ 1. Consequently, the sequence (σ_z) is ultimately periodic with preperiod and period at most |T|.\nProof. By Lemma 2, σ_{z+1} = Type(w^{z+1}) = Type(w^z w) = Type(w^z) ⊛ Type(w) = σ_z ⊛ τ. Since T is finite, the sequence must revisit a previous value within at most |T| steps, after which it evolves deterministically with fixed period ≤ |T|.\n\nCorollary 4 (Finite bound for the bridging (F2) check)\nLet ℓ := |T|. Fix a context (w_1, S, w_2) with |S| = 2 and a forced output assignment s ∈ Σ_out^2 on S. For each z ≥ 1, consider the path w_1^z S w_2^z with S fixed to s, and let P(z) be the predicate “there exists a legal completion of outputs on w_1^z and w_2^z consistent with s.” Then P(z) depends only on the pair (Type(w_1^z), Type(w_2^z)). Moreover, it suffices to check P(z) for 1 ≤ z ≤ Z with Z ≤ ℓ^2; if all these hold then P(z) holds for all z ≥ 1.\nProof. For fixed s, feasibility is determined by whether there exist outputs on the two boundary nodes adjacent to S on each side such that the two segments extend and Cout–out holds across the two adjacencies touching S; this depends only on Type(w_1^z) and Type(w_2^z). By Lemma 3, each of the two type sequences is ultimately periodic with preperiod and period ≤ ℓ. Hence the pair sequence (Type(w_1^z), Type(w_2^z)) takes values in a set of size ≤ ℓ^2 and is ultimately periodic. If P(z) holds for one full traversal of the distinct pairs (which occurs within the first ℓ^2 indices), it holds for all subsequent z.\n\nTheorem 5 (DP for extension on a partially labeled path)\nGiven a path of length k with a fixed input string and some outputs preassigned on a subset of nodes, there is an O(k β^2) time algorithm that decides whether the outputs can be completed to a legal labeling.\nProof. Construct a layered graph with k layers, each layer’s vertices being the output symbols allowed at that node by Cin–out and any preassignment. Add a directed edge from y at layer i to y′ at layer i+1 iff (y, y′) ∈ Cout–out. There exists a legal completion iff there is a path from some vertex in layer 1 to some vertex in layer k. The graph has O(k β) vertices and O(k β^2) edges; reachability is decidable in O(k β^2).\n\nRemarks\n- The bounds above are not tight (e.g., the ℓ^2 bound in Corollary 4 can be improved using lcm of periods), but they suffice for verification in exponential time in β. They also isolate exactly where only the types matter (composition and periodicity), which is crucial for hardness reductions that aim to make (F2) vacuous and focus on (F1).\n",
  "new_outputs_append": "True",
  "verdict": "partial success"
}