{
  "content": "# Ideas\n\n- Complete the trichotomy by giving an EXPTIME-checkable certificate for the top gap (O(1) vs Ω(log* n)) in the radius-1, oriented-path, β-normalized setting, using the transfer-matrix abstraction M(w) and output-adjacency E.\n- Key observation: For a long periodic input block of type τ (matrix M_τ), a constant-time labeling can be arranged by tiling with a constant-size chunk whenever there is some output label x and exponent e ≤ β with ((M_τ·E)^e)[x,x] = 1. This follows from closed-walk/cycle arguments on the β-vertex output digraph induced by M_τ·E.\n- Bridging across short separators reduces to constant-size matrix conditions (E·M_σ·E)[x_l,x_r]=1 for σ a short-type and x_l∈L_τl, x_r∈L_τr, where L_τ = ⋃_{e=1..β} diag((M_τ·E)^e).\n- Thus we obtain a deterministic EXPTIME decision for O(1): compute all reachable types, their L_τ sets, enumerate short types, and check the bridging condition universally (witness existentially via L_τ). Combining with the NEXPTIME middle-gap test (developed earlier) yields a full NEXPTIME trichotomy algorithm.\n\n# Setup and notation (radius 1)\n\n- Σ_in={0,1}, Σ_out of size β.\n- Boolean β×β matrices: E with E[x,y]=1 iff (x,y)∈C_out–out; for i∈{0,1}, S_i diagonal with (S_i)[x,x]=1 iff (i,x)∈C_in–out.\n- For an input word w=i_1…i_k, define the transfer matrix M(w)=S_{i_1}·E·S_{i_2}·E·…·E·S_{i_k} (Boolean semiring). Types are these matrices; composition: M(P·Q)=M(P)·E·M(Q).\n- Replacement lemma (radius-1 specialization): if two segments P,P′ have M(P)=M(P′), they are interchangeable in any context without affecting the outside labels nor feasibility; all boundary/global checks reduce to finite Boolean matrix equalities.\n\n# Lemma A (closed walk bound ≤ β)\n\nLet A be a Boolean β×β matrix. If A^m has a 1 on the diagonal for some m≥1, then A^e has a 1 on the diagonal for some e≤β.\n\nProof. A^m[v,v]=1 means there is a closed walk of length m at vertex v in the directed graph with adjacency A. Any closed walk contains a directed cycle; its length e is at most the number of vertices, hence e≤β. Then A^e[v,v]=1.\n\n# Consequence for periodic input types\n\nFix a type τ with matrix M_τ, and define A_τ:=M_τ·E. Consider a cycle whose input is w^m, where M(w)=M_τ. Any legal labeling induces A_τ^m[x,x]=1 for some output label x (choose x as the output at a chosen boundary position and follow through m copies). By Lemma A, there exists e≤β with A_τ^e[x,x]=1.\n\nDefine the per-type loop set L_τ := { x ∈ Σ_out : ∃ e∈{1,…,β} with (A_τ^e)[x,x]=1 }.\n\n- Computation: L_τ is computable by summing diagonals of A_τ,…,A_τ^β. Cost poly(β) per τ.\n- Intuition: L_τ are precisely the boundary outputs that allow a constant-size chunking of the periodic input block (e copies) with both ends labeled x and internal outputs consistent with Cin–out and E.\n\n# Bridging across a short separator\n\nLet σ be any short type, i.e., σ=M(S) for some S with |S| ≤ 2·L_width, and define C_σ:=E·M_σ·E. If a long block of type τ_l meets a short σ on its right and another long block of type τ_r on σ’s right, then the necessary and sufficient boundary feasibility is\n\n∃ x_l ∈ L_{τ_l}, x_r ∈ L_{τ_r} with C_σ[x_l, x_r]=1.\n\nReason: x_l can be enforced at the right boundary of the left long block by tiling its interior with a chunk of length e_l (since (A_{τ_l}^{e_l})[x_l,x_l]=1). Analogously for the left boundary x_r of the right long block. The short block in between is feasible iff C_σ[x_l,x_r]=1 (left E-edge to S, internal S via M_σ, and right E-edge to the next block). As |S| is O(L_width), such fillings are computable in constant time in the LOCAL model.\n\n# Theorem (EXPTIME decision for O(1))\n\nGiven (Cin–out, Cout–out), there is a deterministic EXPTIME algorithm that decides whether the complexity is O(1) on oriented paths.\n\nAlgorithm.\n1) Build the reachable type set T by BFS in the transfer-matrix DFA with transitions δ(M,i)=M·E·S_i from the seeds {S_0,S_1}. Time 2^{O(β^2)}·poly(β).\n2) Let K:=|T| and set L_width=L_pattern=K as in the O(1) partition. Compute the set of short types T_short = ⋃_{ℓ=1}^{2 L_width} R_ℓ, where R_ℓ are types reachable by exactly ℓ letters (iterate δ; each R_ℓ ⊆ T).\n3) For each τ∈R_{≤L_pattern}, compute L_τ = ⋃_{e=1}^{β} diag((M_τ·E)^e). If L_τ=∅ for some τ in R_{≤L_pattern}, return “not O(1)”.\n4) For each triple (τ_l,σ,τ_r) with τ_l,τ_r∈R_{≤L_pattern} and σ∈T_short, compute C_σ=E·M_σ·E and check whether ∃ x_l∈L_{τ_l}, x_r∈L_{τ_r} with C_σ[x_l,x_r]=1. If any triple fails, return “not O(1)”. Otherwise return “O(1)”.\n\nComplexity. |T| ≤ 2^{β^2}. Steps 3–4 enumerate at most |T| + |T|^3 cases, each with O(β^ω) arithmetic (ω≤3) and table lookups. Overall EXPTIME in β.\n\nSoundness. If the algorithm returns “O(1)”, construct an O(1)-round labeling strategy as follows: compute the (L_width,L_count,L_pattern)-partition (in O(1) rounds) of the input cycle/path. For each long block of type τ, choose any x∈L_τ and tile it by e copies (e ≤ β) of the underlying primitive period to enforce boundary x on both ends (exists by definition of L_τ), and fill the interior by local DP of constant radius. For each short block σ, pick any pair (x_l,x_r) as certified by C_σ[L_{τ_l},L_{τ_r}] and fill σ by DP. All steps are O(1) in n.\n\nCompleteness. Suppose the problem is O(1). Then for every τ∈R_{≤L_pattern} and every m≥1, the cycle with input w^m (M(w)=M_τ) is solvable; hence for some x and m we have (A_τ^m)[x,x]=1, and by Lemma A there exists e ≤ β with (A_τ^e)[x,x]=1. Thus L_τ ≠ ∅. For bridging, take any triple (τ_l,σ,τ_r); consider the cycle formed by a long block of type τ_l, the short σ, and a long block of type τ_r (with buffers if needed), which is solvable by the O(1) algorithm. Using the replacement lemma, we can locally modify each long block by swapping a constant-size suffix/prefix with the chunk guaranteed by L_{τ_l}, L_{τ_r} to enforce chosen boundaries x_l∈L_{τ_l} and x_r∈L_{τ_r} without affecting the far interior. If for all (x_l,x_r)∈L_{τ_l}×L_{τ_r} the entry C_σ[x_l,x_r]=0, then the short block cannot be completed, contradicting solvability. Hence C_σ[L_{τ_l},L_{τ_r}] must contain a 1 for all triples. Therefore the EXPTIME test accepts.\n\n# Middle gap (Ω(n) vs O(log* n)) — recap\n\n- Use the type-based separator certificate f_type: T×{00,01,10,11}×T → Σ_out^2, and verify, for τ_b,τ_c∈R_{K}∪R_{K+1}, the bridging scalar (E·M_{τ_b}·E·M_{τ_c}·E)[ℓ_2,r_1]=1 where L1=f_type(·,S1,τ_b) and L2=f_type(τ_c,S2,·). Verification time EXPTIME. Guess f_type in NEXPTIME, yielding a NEXPTIME decision.\n\n# Full trichotomy NEXPTIME algorithm\n\nGiven (Cin–out,Cout–out):\n1) Run the EXPTIME O(1)-test above. If it accepts, output “O(1)”.\n2) Otherwise, run the NEXPTIME middle-gap test (guess f_type, verify) to decide O(log* n) vs Θ(n). If the middle test accepts, output “Θ(log* n)”; else output “Θ(n)”.\n\n# Example (β=2)\n\nLet Σ_out={a,b}. Suppose E has edges a→a, a→b, b→b (Boolean upper triangular), and Cin–out allows both outputs for input 0, and only b for input 1. Then S_0=I, S_1=diag(0,1). For any w, M(w) zeroes out rows/cols where an input-1 position forces output a; specifically A_τ=M(w)·E will retain only rows/cols reachable via b on 1-positions. One computes L_τ by diagonals of A_τ,…,A_τ^2; as E has cycles at a and b, L_τ contains b (and possibly a if w has no 1). For any short σ, C_σ=E·M_σ·E will have at least one 1 in rows L_{τ_l} and columns L_{τ_r}; hence the O(1) test accepts.\n\n# Obstacles and checks\n\n- Replacement lemma must be applied carefully: replacing a boundary-adjacent slice inside a long block by a constant-size chunk with boundary x requires that both edges into/out of the chunk remain feasible (guaranteed by (A_τ^e)[x,x]=1). This preserves extendibility by the radius-1 replacement argument.\n- Enumerating T_short requires exact-length sets R_ℓ, ℓ≤2|T|. These are computed by iterating δ; the number of new matrices per step is ≤|T|.\n- The bound e≤β is tight and independent of |T|, avoiding a blow-up in the chunk size.\n\n# Next steps\n\n- Move Lemma A, the definition and computation of L_τ, and the EXPTIME O(1)-test into proofs.md with full details of the replacement surgery at block boundaries.\n- Implement a prototype to generate T, R_ℓ, and compute the O(1) test, and cross-check randomly generated small β instances.\n- Integrate with the existing NEXPTIME middle-gap test: shared precomputation of T and R_ℓ sets.\n- Optional: streamline the middle test by restricting τ_b,τ_c to R_K∪R_{K+1} (K=|T|), as noted in previous feedback, to ensure completeness.\n\n# Summary\n\n- We give a concrete, EXPTIME-decidable criterion for O(1) via per-type loop sets L_τ = ⋃_{e≤β} diag((M_τ·E)^e) and universal bridging checks across short types σ. This completes the top-gap decision within our transfer-matrix framework.\n- Combined with the prior type-based NEXPTIME test for O(log* n) vs Θ(n), we obtain a full NEXPTIME trichotomy algorithm for β-normalized, radius-1 LCLs on globally oriented paths.\n"
}