{
  "content": "Ideas\n\n- Fix F_i := E·S_i for i ∈ {0,1} and T_w := F_{i_1}F_{i_2}⋯F_{i_k} (Boolean semiring). This convention makes all statements uniform and keeps “edge-then-node” checks inline. Types are exactly T_w.\n- Middle-gap: finalize the EXPTIME verifier using only matrix products and the length-filter correction (τ_b,τ_c ∈ R_K∪R_{K+1}). No language complementation needed.\n- Top-gap: isolate an EXPTIME-computable necessary condition for O(1) (period feasibility without anchors) via the “right-stabilizer” set Z_per := { Z ∈ ⟨F_0,F_1⟩ : ∃M∈⟨F_0,F_1⟩, M·Z = M }. Show diag(Z)≠∅ is necessary. Also give a simple, EXPTIME-checkable sufficient condition (SCC-constant certificate) that, together with the middle-gap f_type, yields an O(1) algorithm. This is not yet a full characterization but is a concrete step toward a compressed certificate.\n\nReplacement and composition (radius 1)\n\nDefinition. Let E[x,y]=1 ⇔ (x,y)∈C_out–out and S_i diagonal with S_i[x,x]=1 ⇔ (i,x)∈C_in–out. Define F_i := E·S_i and, for w=i_1⋯i_k, T_w := F_{i_1}⋯F_{i_k}. Two segments P,Q have the same type iff T_P=T_Q. Concatenation obeys T_{uv}=T_u·T_v.\n\nLemma (matrix replacement). Let G be a directed path/cycle. Let P⊆G and P′ another segment with T_P=T_{P′}. Suppose a labeling of G is locally consistent at all nodes of P. Then replacing P by P′ yields a labeling that is locally consistent on P′ and unchanged outside P′. Proof. With radius 1, the only interface a segment exposes is the boundary relation T_P; equal relations imply identical extendibility. Composition follows from T_{uv}=T_u·T_v.\n\nMiddle-gap certificate: EXPTIME verification\n\n- Build the reachable set T by BFS on δ(M,i)=M·F_i from I; cost 2^{O(β^2)}·poly(β).\n- Compute R_ℓ ⊆ T, the types realized by exactly ℓ inputs, by iterating R_{ℓ+1}={M·F_i : M∈R_ℓ, i∈{0,1}}; set K=|T| and use τ_b,τ_c ∈ R_K∪R_{K+1}.\n- Guess f_type: T×{00,01,10,11}×T→Σ_out^2; verify for each triple (τ_L,S,τ_R) that (i) local legality holds: S[1] on left output, edge E between the pair, and S[2] on right output; (ii) for all τ_b,τ_c ∈ R_K∪R_{K+1} and S1,S2, if f_type(·,S1,τ_b)=(ℓ_1,ℓ_2) and f_type(τ_c,S2,·)=(r_1,r_2), then (F_{τ_b}·F_{τ_c}·E)[ℓ_2,r_1]=1. Here F_{τ}:=T_w for any w with type τ. The check is a scalar lookup after precomputing the products; total EXPTIME.\n- If some f_type passes, conclude O(log* n); else Θ(n). This completes a NEXPTIME decision for the middle gap.\n\nTop-gap: periodic necessity via right-stabilizers\n\nDefinition (period generators). Let S:=⟨F_0,F_1⟩⊆{0,1}^{β×β}. Define Z_per := { Z ∈ S : ∃ M ∈ S with M·Z = M } (Z stabilizes some type on the right; these are exactly products labeling cycles in the type automaton).\n\nLemma (necessary condition for O(1)). If the LCL has an O(1) algorithm, then for every Z∈Z_per, ∃x∈Σ_out with Z[x,x]=1.\nProof. Consider any long periodic input segment w^m whose period w yields Z=T_w and whose run in the type automaton stays in a cycle. A constant-time, ID-free algorithm cannot introduce anchors on a fully periodic instance; its output on w^m must be shift-invariant and hence valid on arbitrarily many repetitions. This implies the existence of a one-period closed witness of outputs; algebraically, Z has a diagonal 1. Otherwise, any attempt to close the period creates an interface conflict at the wrap-around. Since Z_per has size ≤ |S|·|S| ≤ 2^{O(β^2)}, this test is EXPTIME.\n\nTop-gap: a sufficient certificate (SCC-constant)\n\nLet 𝔄 be the type automaton on state set T with transitions δ(M,i)=M·F_i. Compute its SCCs C. The following is sufficient for O(1):\n- There exists f_type passing the middle-gap verifier (above), and\n- For each SCC C, ∃x_C ∈ Σ_out s.t. E[x_C,x_C]=1 and D_i[x_C,x_C]=1 for every i labeling some edge inside C.\nConstruction (O(1) algorithm).\n- Compute an (L_width,L_count,L_pattern)-partition (paper’s lemma) with L_width=L_pattern=|T|, L_count=2|T|+2. This splits the cycle into short paths P_short and long periodic paths P_long whose input runs stay inside some SCC C and have at least L_count/|w| periods.\n- On each P_long in SCC C, assign every node output x_C. Local legality holds by choices of E and D; since outputs are constant, the algorithm is phase-free and radius-1.\n- Use f_type to label the length-2 separators and fill the gaps (middle-gap lemma). Remaining unlabeled components are O(1)-sized; fill them locally.\n- Total runtime O(1).\nRemarks. This “SCC-constant” certificate is checkable in EXPTIME (compute SCCs; for each C, test feasibility of x_C by scanning D_0,D_1 and E). It is likely not necessary (there are cases where periodic outputs alternate but are phase-discernible by local windows); it nonetheless provides a nontrivial sufficient condition within our matrix framework.\n\nExamples\n\n- β=2, E=complete, D_0=D_1=I. Then F_i=E, T={I,E}, Z_per={I,E}, and diag(E)≠∅. SCC-constant holds with x_C arbitrary; algorithm returns O(1).\n- β=2, E has only self-loops (E=I), D_0=diag(1,0), D_1=diag(0,1). Then F_0=diag(1,0), F_1=diag(0,1). Z_per contains F_0,F_1; both have empty diagonal on the forbidden coordinate. Necessity detects Ω(log* n).\n\nObstacles\n\n- The SCC-constant condition is sufficient but not necessary; we still need a compressed, exact certificate. The planned refinement is a “window-transducer” defined only on SCC languages: guess a map g_C from bounded-length input windows (over the SCC) to outputs; check homomorphism constraints on the SCC de Bruijn graph. This stays in EXPTIME if the window size is chosen polylog(|T|), but proving such a bound remains open.\n\nNext steps\n\n1) Add to proofs.md: rigorous statement/proof of the replacement lemma and the middle-gap verifier with τ_b,τ_c ∈ R_K∪R_{K+1}.\n2) Implement and test the Z_per necessity filter; produce small counterexamples that fail it and are indeed Ω(log* n).\n3) Formalize the SCC-constant sufficient certificate and its O(1) algorithm; add as a partial result toward the top-gap.\n4) Work toward the “window-transducer over SCC” compression lemma: specify the SCC-window automaton and the EXPTIME homomorphism check; attempt to bound the needed window size by |T|-related parameters.\n"
}