{
  "content": "Ideas\n\nWe collect graph-theoretic conditions under which a signed network coordination (SNC) game with binary actions admits at least one pure Nash equilibrium (PNE). We also add two new, simple-to-check sufficient classes (acyclic dependency graphs; block-triangular assembly via strongly connected components) with short proofs.\n\nModel reminder. Players i∈V choose xi∈{±1}. Utilities: ui(x)=hixi+∑j Wij xixj. Edge (i,j) is present iff Wij≠0 and indicates that i’s utility depends on j’s action.\n\nA. Known sufficient graph classes (with short proofs or references)\n\nA1) Undirected signed graphs (W=W′) ⇒ exact potential game ⇒ PNE exists.\nClaim. If W=W′ then the game is an exact potential game with potential Φ(x)=1/2 ∑i,j Wij xixj + ∑i hi xi. Hence a PNE exists (finite potential games). Proof: For any i and fixed x−i, ui(·,x−i) increments match Φ’s increments by symmetry (standard; see Monderer–Shapley 1996). Thus at least one global maximizer of Φ is a PNE.\n\nA2) Unsigned graphs (Wij≥0) ⇒ supermodular ⇒ PNE exists.\nClaim. If Wij≥0 for all i,j then the game is supermodular (increasing differences). Hence a PNE exists (Tarski). Proof sketch: δi(x)=ui(+1,x−i)−ui(−1,x−i)=2hi+2∑j Wij xj; if Wij≥0 and x≤y then δi(y)−δi(x)=2∑j Wij (yj−xj)≥0, giving increasing differences; existence follows.\n\nA3) Structurally balanced signed graphs ⇒ gauge-transform to unsigned ⇒ PNE exists.\nClaim. If there exists a partition V=V1⊔V2 such that weights are nonnegative within parts and nonpositive across, then there is a diagonal signature [σ] with entries σi∈{±1} for which W[σ]=[σ]W[σ]≥0. The transformed game is unsigned, so it has a PNE; mapping back by xi←σi yi gives a PNE for the original game. (Altafini 2013.)\n\nB. Cohesive-subgraph guarantees (robust consensus/polarization inside a subgraph)\nLet V=R⊔S. Assume GR is unsigned (coordination) or structurally balanced (after some τ∈{±1}R, GR becomes unsigned). Define weighted out-degrees w_i^B=∑j∈B |Wij|.\n\nB1) Existence with R at consensus (unsigned GR).\nAssume for some a∈{±1}:\n(1) w_i^R + a h_i ≥ w_i^S for all i∈R, and\n(2) the S-restricted game with y=a1R has a PNE (e.g., GS undirected or structurally balanced).\nThen the full game has a PNE x* with x*R=a 1R. Proof idea: (1) makes a a best response for every i∈R regardless of z∈{±1}S, while (2) supplies z*∈NES^(a1). Then (a1,z*) is a PNE.\n\nB2) Existence with R polarized (structurally balanced GR).\nAssume there is τ∈{±1}R such that τi Wij τj≥0 for i,j∈R (so GR becomes unsigned under [τ]). If\n(1′) w_i^R + τi h_i ≥ w_i^S for all i∈R, and\n(2′) the S-restricted game with y=τ has a PNE (again true if GS undirected or structurally balanced),\nthen the game has a PNE x* with x*R=τ.\n\nThese are precisely the existence theorems in the provided paper (Proposition 1 and Theorem 1 there, plus corollaries), specialized to binary actions.\n\nC. New sufficient graph classes (simple, checkable)\n\nC1) Acyclic dependency graphs (DAGs) ⇒ PNE exists (for any signs/weights).\nDefine the dependency digraph with arcs i→j iff Wij≠0 (i’s utility depends on j). If this digraph is acyclic, a topological ordering v1,…,vn exists with edges only from lower to higher indices. Then W is strictly upper-triangular in that order: ui depends only on xj for j>i. Construct x by backward induction:\n• Choose xn∈argmax ui(xn) (depends only on hn). For k=n−1,…,1, choose xk∈argmax uk(xk,xk+1,…,xn).\nBecause ui does not depend on x1,…,xi−1, each chosen xk remains a best response in the final profile. Hence the constructed x is a PNE. This covers all DAGs irrespective of signs.\n\nC2) Block-triangular assembly via SCCs (componentwise existence ⇒ global existence).\nLet C1,…,CK be the strongly connected components (SCCs) in a topological order of the condensation DAG (edges only from Ca to Cb with a<b). Suppose each induced subgame on Ck is from a family that admits a PNE for every external field (e.g., undirected, unsigned, or structurally balanced). Then the full game has a PNE.\nProof. Start from sink CK: its players’ utilities depend only on xCK and biases; pick any PNE xCK. Move to CK−1: its utilities depend on xCK only through affine shifts in hk; by hypothesis the restricted game on CK−1 has a PNE; pick xCK−1; iterate upward. The concatenated profile x is a PNE globally. Note this strictly generalizes C1) (DAG = each SCC is a singleton), and also composes the known classes A1–A3 under forward-only inter-component influence.\n\nExamples\n\n1) DAG example. Chain 1→2→3 with arbitrary signed weights. Order (1,2,3). Choose x3 to maximize u3 (depends only on h3). Then choose x2 best responding to x3, then x1 to (x2,x3). The resulting x is a PNE.\n\n2) SCC assembly example. Two components C1 and C2 with edges only C1→C2. Suppose G[C1] is undirected (any signs), G[C2] is structurally balanced. Pick a PNE on C2; treat its effect as an external field on C1 and pick a PNE on C1. Their product is a PNE.\n\nObstacles and limits\n\n• Cycles of pure anti-coordination can destroy existence (3-cycle all −1 weights has no PNE). This violates A3, C1, C2 (since its SCC is not from a guaranteed family).\n• The cohesive-subgraph conditions (B1–B2) require an equilibrium in the complement S when R is frozen. This holds if GS is undirected or structurally balanced; otherwise, it may fail.\n\nNext steps (auditable targets)\n\n• Tighten C2: characterize largest per-SCC families closed under external-field perturbations that guarantee PNE.\n• Develop efficient checks: (i) test structural balance on SCCs via a signed 2-coloring; (ii) find maximal cohesive R satisfying w_i^R + τi h_i ≥ w_i^S.\n• Empirical stress tests: generate random signed DAGs and SCC-assemblies; verify backward-induction PNE construction and the B1–B2 inequalities algorithmically.\n\nFormal statements (for proofs.md)\n\nLemma (Undirected ⇒ potential). If W=W′, Φ(x)=1/2 ∑i,j Wij xixj + ∑i hi xi is an exact potential; hence a PNE exists.\n\nLemma (Unsigned ⇒ supermodular). If Wij≥0, the game has increasing differences and thus a PNE.\n\nLemma (Structural balance ⇒ gauge to unsigned). If ∃σ∈{±1}V with [σ]W[σ]≥0, then a PNE exists and pulls back to a PNE of the original game via x←[σ]y.\n\nTheorem (Cohesive R, unsigned). If V=R⊔S, GR unsigned, ∃a∈{±1} with w_i^R + a h_i ≥ w_i^S ∀i∈R, and the S-restricted game with y=a1R has a PNE, then the full game has a PNE with xR=a1R.\n\nTheorem (Cohesive R, structurally balanced). If V=R⊔S, ∃τ∈{±1}R with τi Wij τj≥0 on R, w_i^R + τi h_i ≥ w_i^S ∀i∈R, and the S-restricted game with y=τ has a PNE, then the full game has a PNE with xR=τ.\n\nLemma (DAG ⇒ PNE). If the dependency digraph is acyclic, a PNE exists by backward induction along a topological order.\n\nTheorem (SCC assembly). If the condensation DAG is ordered C1,…,CK and each subgame on Ck (with arbitrary external field) admits a PNE (e.g., undirected, unsigned, or structurally balanced), then the full game admits a PNE, constructible by solving components from sinks upward.\n"
}