{
  "content": "Ideas\n- We isolate graph-theoretic classes for which every signed coordination game with utilities u_i(x)=h_i x_i + x_i∑_j W_{ij}x_j (binary actions x_i∈{±1}) admits a pure Nash equilibrium (PNE), independently of h.\n- We also give a compositional existence theorem along the DAG of strongly connected components (SCCs). Counterexamples show why negative directed cycles fall outside these classes.\n\nResults and proofs\n1) Undirected signed graphs (exact potential)\nClaim. If W is symmetric (undirected network), then a PNE exists for all h.\nProof. Define Φ(x)= 1/2∑_{i,j}W_{ij}x_i x_j + ∑_i h_i x_i. If x,y differ only at i with y_i=−x_i, then Φ(y)−Φ(x)=2(h_i+∑_jW_{ij}x_j)x_i= u_i(y)−u_i(x). Hence Φ is an exact potential. A finite exact potential game admits a maximizer x*, which is a PNE. ∎\n\n2) Structurally balanced signed digraphs (gauge to supermodular)\nDefinition. G is structurally balanced if V can be bipartitioned V=V_1⊔V_2 with W_{ij}≥0 on edges inside V_q and W_{ij}≤0 on edges between V_1 and V_2.\nEquivalent formulation. There exists σ∈{±1}^V such that W'=[σ]W[σ] is entrywise nonnegative on edges.\nTheorem. If G is structurally balanced, then a PNE exists for all h.\nProof. Consider the change of variables y=[σ]x. Then u_i(x)=u_i^{[σ]}(y)=h_i^{[σ]}y_i + y_i∑_j W'_{ij}y_j with W'≥0. This is a (possibly directed) coordination game, hence supermodular: for x≤y, the discrete slope δ_i(y)−δ_i(x)=2∑_j W'_{ij}(y_j−x_j)≥0. Finite supermodular games have a PNE by Tarski’s fixed-point theorem. Mapping back gives a PNE of the original game. ∎\n\n3) Directed acyclic graphs (DAGs)\nTheorem. If the directed graph (i→j whenever W_{ij}≠0) is acyclic, then a PNE exists for all h and W.\nProof. Take a topological ordering v_1,…,v_n with edges i→j implying i<j. Assign actions in reverse order t=n,…,1. When choosing x_{v_t} set it to a best reply to already assigned out-neighbors {j: v_t→j}. Since u_{v_t} depends only on those out-neighbors and h_{v_t}, later choices x_{v_s} with s<t do not affect u_{v_t}. By induction, the final profile is a best reply for every player. ∎\n\n4) SCC-wise composition\nLet C_1,…,C_m be the SCCs and let 𝒢̂ be the condensation DAG. For S⊆V define the restricted game on S with external field h^S = h_S + W_{S, V\\S} x_{V\\S} (constants once x_{V\\S} is fixed).\nTheorem (SCC existence). Suppose for every SCC C, the induced subgraph G[C] is either (a) undirected (W_{ij}=W_{ji} on C) or (b) structurally balanced. Then a PNE exists for all h.\nProof. Process SCCs in reverse topological order on 𝒢̂. If C is a sink, nodes in C have no out-edges leaving C, so their utilities depend only on x_C and h_C; by (a) or (b) the restricted game on C admits a PNE x_C. Inductively, assume x is fixed on all SCCs that C points to; this turns those out-edges into a fixed h^C. By (a) or (b), the restricted game on C with field h^C has a PNE; fix it. Utilities of already processed SCCs depend only on their out-neighbors (already fixed), so they remain best replies. At termination, all players are best replying. ∎\n\n5) Cohesive balanced cores (mixed graphs)\nLet V=R⊔S. Suppose G[R] is structurally balanced and choose τ∈{±1}^R with τ_i W_{ij} τ_j ≥ 0 for i,j∈R (i.e., [τ]-transform makes R unsigned). If for all i∈R\nw_i^{R} + τ_i h_i ≥ w_i^{S}  (cohesiveness),\nthen fixing x_R=τ is a best reply for every i∈R against any x_S. If, in addition, the subgame on S with field h^S=h_S+W_{S,R}τ admits a PNE (e.g., because G[S] is undirected or structurally balanced), the whole game admits a PNE with x_R=τ. This recovers and generalizes known “robust consensus/polarization” existence results.\n\nExamples\n- Failure (no PNE): the directed 3-cycle with all edges negative. It is neither undirected, nor structurally balanced, nor acyclic; indeed no PNE exists.\n- DAG: any orientation of a tree; the greedy reverse-topological assignment constructs a PNE.\n- SCC mix: a sink SCC that is undirected plus a predecessor SCC that is structurally balanced; the SCC theorem applies.\n\nObstacles\n- Structural balance is necessary for directed signed SCCs in the sense that a strongly connected component with a signed cycle of negative sign that cannot be switched away can destroy PNE existence (e.g., matching pennies-like motifs).\n\nNext steps\n- Tighten SCC conditions: identify minimal SCC classes (beyond undirected/structurally balanced) that guarantee a PNE for any external field, e.g., exact potential on C up to additive separable terms, or classes with acyclic best-response graphs.\n- Algorithmics: linear-time PNE construction for DAGs; polynomial-time via SCC decomposition with per-SCC solvers (potential maximization or lattice-theoretic fixed points).\n"
}