{
  "content": "Ideas\n- Provide two new sufficient graph-theoretic conditions that guarantee existence of pure Nash equilibria (PNE) in signed network coordination (SNC) games with binary actions:\n  1) Acyclic directed graphs (DAGs).\n  2) General directed graphs whose strongly connected components (SCCs) are each “good,” where “good” means: for any external field on that SCC, the restricted SNC game admits at least one PNE. This holds, in particular, if each SCC is undirected or structurally balanced.\n- Both are constructive: equilibria can be built by backward induction on a suitable partial order (a topological order of the DAG, or of the condensation DAG of SCCs).\n\nProposition 1 (DAGs guarantee a PNE)\nLet G = (V,E,W) be a directed acyclic graph. For any h ∈ R^V, the SNC game u_i(x) = h_i x_i + x_i ∑_j W_{ij} x_j with x_i ∈ {±1} has a pure Nash equilibrium.\nProof. Since G is a DAG, take a topological ordering v_1,…,v_n where every edge (v_p→v_q) satisfies p < q. Construct x by backward induction from k = n down to 1. When fixing x_{v_k}, all its out-neighbors lie in {v_{k+1},…,v_n} and have already been assigned; choose x_{v_k} ∈ argmax_{a∈{±1}} [ a( h_{v_k} + ∑_j W_{v_k j} x_j ) ]. This is a best response given the (already fixed) actions of all out-neighbors. Since u_{v_k} depends only on x_{v_k} and on its out-neighbors’ actions, later choices (for indices < k) cannot affect u_{v_k}. Thus, in the final profile, every player is playing a best response. Hence x is a PNE. ▢\nRemarks:\n- The construction yields a strict PNE whenever no tie occurs at any step, i.e., whenever |h_i + ∑_{j∈N^+_i} W_{ij} x_j| > 0 for all i.\n- This is a purely graph-theoretic guarantee (holds for any real weights and any h).\n\nDefinition (Componentwise NE-guaranteed SCCs)\nFor a network G and U ⊆ V, say that G_U is NE-guaranteed if for every f ∈ R^U the restricted SNC game on U with utilities u_i(y) = y_i (∑_{j∈U} W_{ij} y_j + f_i) admits at least one PNE.\nTwo broad classes are NE-guaranteed:\n- Undirected SCCs: by Proposition 1(i)-(ii) in the paper, such subgames are exact potential games for any f, hence admit PNE.\n- Structurally balanced SCCs: by Lemma 2 and Proposition 4 in the paper, gauge-transform to an unsigned subgame (supermodular), which has a PNE for any f.\n\nTheorem 2 (SCC-wise existence via condensation DAG)\nLet G = (V,E,W) and let C^1,…,C^K be the SCCs of G. Suppose each G_{C^k} is NE-guaranteed (e.g., undirected or structurally balanced). Then for any h ∈ R^V the SNC game admits a pure Nash equilibrium.\nProof. Consider the condensation DAG of SCCs and choose a topological order in which all inter-component edges point from earlier to later components. Proceed from sinks to sources:\n- Step t = K,K−1,…,1. Let S_t be the union of components strictly later than C^t. By construction there is no edge entering S_t from C^t (or earlier components), while edges may go from C^t to S_t. Assume x_{S_t} has been fixed in previous steps.\n- Define an external field on C^t by f^{(t)} = h_{C^t} + W_{C^t,S_t} x_{S_t}.\n- Since G_{C^t} is NE-guaranteed, there exists y^{(t)} ∈ {±1}^{C^t} that is a PNE of the restricted game on C^t with field f^{(t)}.\n- Fix x_{C^t} := y^{(t)} and continue.\nAt termination, x ∈ {±1}^V is defined. If i ∈ C^t, its utility depends only on x_j for j in its out-neighbors, which lie in C^t ∪ S_t; these were exactly fixed when solving the restricted game on C^t with field f^{(t)}. Hence x_i is a best response in the full profile. Therefore x is a PNE. ▢\nCorollaries and examples:\n- All DAGs are covered as the special case where every SCC is a singleton (Corollary of Proposition 1).\n- If each SCC is undirected (not necessarily symmetric between SCCs), a PNE exists. If each SCC is structurally balanced, a PNE exists. Mixed cases (some SCCs undirected, others structurally balanced) are allowed.\n- This sharpens and modularizes existing results: global structural balance (the whole graph is structurally balanced) is a special case (single SCC) of the theorem; likewise, undirected graphs are a special case.\n\nAlgorithmic construction\n- For DAGs: one backward pass along any topological order.\n- For general graphs: compute SCCs and their condensation DAG; process SCCs from sinks upwards, solving each restricted subgame (exact potential if undirected; supermodular after gauge if structurally balanced) and fixing actions.\n\nFurther sufficient condition (weight-dominance, graph-independent)\nIf |h_i| > ∑_j |W_{ij}| for all i, then x^* = sign(h) is a strict PNE (unique best responses independent of neighbors). Proof: for any x_{-i}, the sign maximizing u_i is sign(h_i) since the interaction term has magnitude ≤ ∑_j |W_{ij}| < |h_i|.\n\nExamples\n- Acyclic signed digraph (new): 1→2 (W_{12} = −3), 1→3 (2), 2→3 (1), h = (0,1,−2). Topological order 1,2,3. Pick x_3 = sign(−2) = −1; then x_2 ∈ argmax a·(1·x_3 + 1) = a·0 ⇒ pick a = 1; then x_1 ∈ argmax a·(−3·x_2 + 2·x_3) = a·(−3·1 + 2·(−1)) = a·(−5) ⇒ x_1 = −1. The resulting profile (−1,1,−1) is a PNE.\n- Mixed SCCs (new): Let C^1 be undirected on {1,2,3} (arbitrary signed weights, symmetric), C^2 structurally balanced on {4,5}. Suppose edges only from C^1 to C^2. Solve C^2 first for its own h; then induce f on C^1 and solve its exact potential subgame. The union is a PNE.\n- Necessity of “good” SCCs: A single SCC that is a directed 3-cycle with all three arcs negative (Example 2(b) in the paper) is neither undirected nor structurally balanced and has no PNE; Theorem 2 does not apply, illustrating tightness of the condition at the SCC level.\n\nObstacles and limitations\n- The SCC-wise condition is sufficient, not necessary: there are SCCs that are neither undirected nor structurally balanced yet still admit PNE for all external fields (characterizing these seems hard).\n- Replacing “structurally balanced” by weaker notions (e.g., few sign inconsistencies) may still suffice, but additional technical work is needed (e.g., perturbative arguments or mixed supermodularity within blocks).\n\nNext steps\n- Characterize “NE-guaranteed” SCCs beyond undirected/structurally balanced by intrinsic signed cycle conditions (e.g., forbidding matching-pennies minors), or via robust potential-like properties.\n- Explore algorithmic tests: given W_{UU}, decide whether the restricted subgame is NE-guaranteed for all external fields f. Candidate approaches: cycle-space sign conditions or monotone systems after blockwise gauge transformations.\n- Combine with cohesiveness: integrate the paper’s cohesive-core results with the SCC decomposition to handle cases where only a subset in an SCC is good but exerts dominating influence.\n\nSummary of new checkable claims\n- Proposition 1: Any SNC game on a DAG has a PNE (constructive backward induction).\n- Theorem 2: If every SCC is undirected or structurally balanced (hence NE-guaranteed), the overall SNC game has a PNE (constructive via condensation DAG).\n- Weight-dominance condition: If |h_i| > ∑_j |W_{ij}| ∀i, then x^* = sign(h) is a strict PNE.\nThese add graph classes and a modular construction principle to the existing toolkit in the provided paper."
}