{
  "summary_md": "Round results identify graph classes that guarantee existence (and often BR-reachability/stability) of pure Nash equilibria in binary signed-network coordination (SNC) games. Main guarantees: undirected graphs (exact potential), unsigned graphs (supermodular), structurally balanced graphs (gauge to unsigned), DAG dependency digraphs (backward induction yields a PNE and BR-path), and SCC composition (if every SCC is “universally PNE-admitting” under arbitrary external fields — e.g., undirected or structurally balanced — then the full game admits a PNE constructed by solving SCCs from sinks upward). Additional sufficient conditions: cohesive-core bounds (w_R + τ·h ≥ w_S) produce consensus/polarized PNE when the S-subgame admits an NE; weight-dominance |h_i|>∑_j|W_ij| yields a strict PNE. Stability uses (h^-,h^+)-indecomposability to obtain BR-reachability of consensus/polarized equilibria and (when S-subgames are BR-stable) globally BR-stable NE sets. Counterexamples: 2-node discoordination and all-negative directed 3-cycle (no PNE). Next steps: classify universally PNE-admitting SCCs; give polynomial-time checker and end-to-end algorithm; integrate cohesive-core criteria into SCC pipeline. Citations: papers/paper1.txt; Main Results & Proofs (current round).",
  "one_line_summary": "DAGs, undirected/structurally-balanced graphs and SCC composition guarantee PNE; constructive BR paths provided.",
  "highlights": [
    "Undirected (W symmetric) ⇒ exact potential game with Φ(x)=½∑_{i,j}W_{ij}x_ix_j+∑_i h_i x_i ⇒ PNE exist and a nonempty globally BR-stable subset.",
    "Unsigned (W≥0) ⇒ supermodular game ⇒ PNE exist and Nash set is globally BR-reachable.",
    "Structurally balanced directed graphs admit σ with [σ]W[σ]≥0 (gauge transform) → reduce to unsigned case → PNE and BR-reachability.",
    "DAG dependency digraphs: backward induction/topological reverse order constructs a PNE and yields a BR-path to it.",
    "SCC composition theorem: if every SCC is universally PNE-admitting under arbitrary external fields (e.g., undirected or structurally balanced), solve SCCs from sinks upward to obtain a global PNE; BR-paths concatenate per-SCC BR-paths.",
    "Cohesive-core / weight-dominance conditions: (w_R+τ·h ≥ w_S and S-subgame has NE) ⇒ global PNE with x_R=τ; |h_i|>∑_j|W_{ij}| ⇒ strict PNE.",
    "Counterexamples: 2-node discoordination and directed 3-cycle with all-negative arcs lack any PNE; indecomposability ((h^-,h^+)-indecomposable) yields robustness/BR-reachability of consensus/polarized equilibria."
  ],
  "next_questions": [
    "Characterize which SCCs (beyond undirected and structurally balanced) are universally PNE-admitting under arbitrary external fields.",
    "Design and implement a polynomial-time checker/algorithm: detect DAG, SCC-decompose, test SCC universal property, apply gauge/cohesive-core criteria, and construct PNE/BR-path if it exists.",
    "Quantify tightness/necessity of cohesiveness and indecomposability bounds and produce minimal counterexamples when they fail."
  ]
}