{
  "content": "Ideas\n- We isolate a broad, Baire-safe class of alternative metrics on X=G_{\\bullet,D}: strongly local (cylinder-dominating) metrics. We then prove an invariance lemma: any property whose complement can be forced inside a cylinder remains nowhere dense under any such metric.\n- We implement this forcing for “bridgeless” when D is odd (both ≤D and =D). The forcing gadget is a sealed finite bubble attached by a single edge; we give a complete existence and a simple D-regular completion lemma based on attaching (D−1)-ary infinite trees.\n- For even D we prove a parity obstruction forbidding sealed one-edge cuts in cylinder-based forcing on ≤D. Consequently, the odd-D result cannot be extended to even D via degree saturation alone. We also give a clean proof that “2-way infinite bridge” is meagre (and dense) uniformly across strongly local metrics.\n\nDefinitions\n- Strongly local (cylinder-dominating) metric. A metric d on X is strongly local if there exists ψ:(0,1]→\\mathbb{N} with d(x,y)<ε ⇒ B_{ψ(ε)}(x)≅B_{ψ(ε)}(y). Equivalently, every d-ball around x contains some local cylinder C(B_r(x)). Examples: weighted local metrics d_w(x,y)=∑_{r≥0} w_r·1_{B_r(x)≄B_r(y)} with w_r↘0 and ∑ w_r<∞; FO-local metrics using Gaifman locality; all are Polish and strongly local.\n- Cylinder C(F):= {x∈X: B_r(x)≅F} for an r-ball F.\n\nLemma 1 (robust nowhere-denseness under strongly local metrics)\nLet d be strongly local on X and S⊂X satisfy: for every r-ball F with C(F)≠\\varnothing there is r′≥r and an r′-ball F′ extending F with C(F′)≠\\varnothing and C(F′)⊆X\\S. Then S is nowhere dense in (X,d).\nProof. If U is a nonempty d-open set around x, choose ε>0 with B_d(x,ε)⊂U and r=ψ(ε). Then B_d(x,ε)⊂C(B_r(x)). By hypothesis, some F′ extending B_r(x) satisfies C(F′)⊂X\\S and is nonempty. For any y∈C(F′) and δ>0 with ψ(δ)≥r′, we have B_d(y,δ)⊂C(F′)⊂X\\S. Hence every nonempty d-open U contains a nonempty d-open subset disjoint from S. Thus int_d(\\overline{S}^d)=∅.\n\nOdd D forcing gadget and completion\nLemma 2 (sealed bubble for odd D). Fix odd D≥3. There exists an n≥D+2 (odd) and a connected simple graph T on vertices {t_0,…,t_{n−1}} with degree sequence (D−1,D,…,D). Given any cylinder C(F) with a boundary vertex u∈L_r(F) having deg_F(u)<D, form F′ by adjoining a disjoint copy of T and a single edge e=ut_0. Then in any extension of F′ within X=G_{\\bullet,≤D} or X=G_{\\bullet,=D} (odd D), the edge e is a 1‑way infinite bridge.\nProof. Existence of T: The Erdős–Gallai inequalities hold for d=(D,…,D,D−1) when n is odd and n≥D+2: parity ∑ d_i=Dn−1 is even (D and n odd); for 1≤k≤n−1, Dk≤k(k−1)+(n−k)min(D,k) holds by the standard split k≤D and k≥D+1 (the latter reduces to 0≤k^2−(1+2D)k+nD, minimized at k=D+1 with value D(n−D−1)≥D>0). Connectivity follows by degree-preserving edge switches. In F′, every vertex in T has degree D (counting e at t_0). Hence no extension may add edges incident to T without violating the ≤D or =D constraint. The only edge between T and its complement is e, so deleting e separates the finite set T from the rest (infinite), making e a 1‑way infinite bridge in every extension.\n\nLemma 3 (D-regular completion outside a finite preball). Fix D≥3. Let H be a finite connected graph with max degree ≤D. For each vertex v∈V(H), let c(v)=D−deg_H(v)≥0. For each of the c(v) units, attach a disjoint rooted infinite (D−1)-ary tree T_{v,i} whose root s_{v,i} has degree D−1 in T_{v,i}, and add the edge vs_{v,i}. Denote G the union of H and all T_{v,i}. Then G is infinite, connected, and D‑regular.\nProof. Each root s_{v,i} gains one extra neighbor v and reaches degree D; every other node of T_{v,i} has one parent and D−1 children, hence degree D. Each v in H gains c(v) new neighbors and reaches degree D. Connectivity holds since each T_{v,i} is attached to H.\nConsequently, in Lemma 2, C(F′)≠\\varnothing in both ≤D and =D (odd) by taking H:=F′ and completing via Lemma 3.\n\nParity obstruction for even D\nProposition 4 (no sealed one-edge cut when D is even). Let D be even. Let S be a finite vertex set in a graph G whose every vertex has degree D in G. Then |∂S| is even. In particular, there is no way to realize a sealed finite side with exactly one cross-edge in ≤D by saturating all vertices of that side to degree D.\nProof. The handshaking identity gives ∑_{v∈S} deg_G(v)=2|E(S)|+|∂S|. If deg_G(v)=D for all v∈S, then D|S|=2|E(S)|+|∂S|, so |∂S|≡D|S| (mod 2), which is even since D is even.\nCorollary 5 (impossibility of cylinder-forcing a 1‑way bridge for even D in ≤D). Work in X=G_{\\bullet,≤D} with D even. Suppose a cylinder refinement C(F′) purportedly forces an edge e to be a bridge in every extension. Let S be the component (in F′−e) that is intended to be the finite side across e. If some vertex of S has deg_{F′}(v)<D, then an extension may add a new neighbor of v outside the ball, creating an additional cross-edge and violating the bridge property. Hence every v∈S must satisfy deg_{F′}(v)=D, contradicting Proposition 4. Thus no cylinder can force a bridge at bounded distance in ≤D when D is even.\nComment. This does not rule out bridgeless being nowhere dense by some more delicate argument; it only forbids the sealed-bubble forcing for even D in ≤D. It also explains why pendant-leaf forcing fails.\n\nTwo‑way infinite bridges are meagre (and dense)\nFor k∈\\mathbb{N}, let P_k be the set of graphs in X in which some 2‑way infinite bridge meets B_k (equivalently, there exists an edge e with both components of G−e infinite and d(ρ,e)≤k).\nLemma 6. For any strongly local metric d on X and any D≥3, each P_k is nowhere dense.\nProof. Fix a nonempty d-open set U and x∈U. Let ε>0 with B_d(x,ε)⊂U and r=ψ(ε)≥k. Let F=B_r(x). Consider the set E_k of edges of F whose distance to the root is ≤k. Call e∈E_k safe if, in F−e, at least one component contains no boundary vertex with residual capacity (<D); otherwise e is critical. In any completion of F, a safe e cannot be 2‑way infinite bridge (one side is necessarily finite). For the set S of boundary vertices with residual capacity in components of critical edges, adjoin for each v∈S one new vertex x_v at distance r+1 and add the edge vx_v. Connect the x_v’s into a single simple cycle using additional new vertices placed at distance r+2 (degrees ≤2 so far). Let F′ be the resulting (r+2)-ball; degrees in F′ do not exceed D, and all edges e∈E_k now lie on a cycle contained in F′. Therefore no extension of F′ can contain a 2‑way infinite bridge meeting B_k. By Lemma 3, C(F′)≠\\varnothing in ≤D and in =D (odd); in =D (even) complete outside F′ by attaching (D−1)-ary trees to all residual stubs as well. Hence U contains a smaller d-open set disjoint from P_k.\nLemma 7. For any D≥3, P:=⋃_{k} P_k is dense.\nProof. Given any cylinder C(F), adjoin far away (beyond radius r+1) two disjoint infinite rays R_1,R_2 and connect their initial vertices by a single edge e, leaving degrees ≤D and keeping the root-ball unchanged. In any completion, both sides of e are infinite, and e is a bridge. This yields a refinement cylinder contained in P.\nCorollary 8. For any strongly local metric on X and D≥3, the set of graphs with a 2‑way infinite bridge is meagre and dense.\n\nConsequences for bridgeless typicality\n- Odd D (≤D and =D): By Lemma 2 and Lemma 1, “bridgeless” is nowhere dense (hence meagre) under any strongly local metric.\n- Even D, =D: 1‑way bridges are impossible by parity on a finite component; with Corollary 8, 2‑way bridges form a meagre set, so “bridgeless” is comeagre under any strongly local metric.\n- Even D, ≤D: Sealed-bubble forcing is impossible (Corollary 5). The typicality of “bridgeless” under d_\\bullet remains open here; our method does not decide it. Note this casts doubt on the blanket statement “bridgeless is nowhere dense in ≤D for all D>2” (in the extended abstract). If that claim is intended, it must proceed by a different argument than sealed saturation; we invite scrutiny for even D.\n\nExamples of strongly local metrics (Polish)\n- Weighted local metrics d_w: as above; cylinders are clopen, and d_w induces the product topology on the inverse system of finite r-balls.\n- FO-local metrics: Enumerate FO-types up to quantifier depth m around the root, weight by w_m→0; Gaifman locality gives the strongly local property. The topology is again a Polish subspace of a product of finite discrete spaces.\n\nNonlocal attempts and Baire issues\n- Adding global bridge-profile coordinates H_r (existence of a bridge meeting B_r) to define d_new=d_\\bullet+∑2^{−r−1}|H_r(x)−H_r(y)| tends to make the bridge set open (hence not meagre) and breaks completeness: sequences pushing a single bridge farther out are Cauchy but have incompatible limits for H. Without proving Polish/Baire, such metrics are not “reasonable” for typicality.\n\nObstacles\n- Even D, ≤D: Establishing the actual category status of “bridgeless” under d_\\bullet. Our parity obstruction shows the standard sealed-bubble method cannot apply, but it does not preclude bridgeless being nowhere dense by a subtler construction or being comeagre.\n\nNext steps\n1) Even D, ≤D: Either construct an explicit cylinder refinement that forces a 1‑way bridge without sealed saturation (unlikely), or prove an impossibility theorem: for D even, for every cylinder C(F) and every edge e within bounded distance, there exists an extension in which e lies on a cycle (hence no forcing). This would refute the claim of nowhere-denseness in even D for ≤D.\n2) Formalize the shielding proof (Lemma 6) in full detail for both ≤D and =D, including consistent degree bookkeeping at the boundary and completion via Lemma 3.\n3) Catalogue strongly local metrics (weighted local, ultrametrics from decorated balls, FO-local) and record Polishness; conclude invariant typicality for bridgeless in odd D and =D even.\n4) If pursuing a positive metric flip, first propose a nonlocal but Polish/Baire topology, then analyze whether bridgeless can be comeagre without making “has a bridge” open or killing Baire-ness.\n\nSummary\n- We proved a robust invariance scheme (Lemma 1) for strongly local metrics and used a sealed-bubble gadget (Lemma 2) plus a simple D-regular completion lemma (Lemma 3) to show bridgeless is meagre for odd D (≤D and =D) under any such metric. For =D with even D, bridgeless is comeagre, since 2‑way bridges are meagre (Corollary 8) and 1‑way bridges are impossible. For ≤D with even D, sealed forcing is impossible by a parity obstruction (Proposition 4), leaving the category status open and calling for refined arguments. This narrows where a “metric sensitivity” counterexample might exist and provides rigorous tools for the verifier to formalize in proofs.md."
}