{
  "content": "Ideas\n\n- Finalize Conjecture 1 via the forgetful map π from rooted to unrooted spaces: prove π is continuous, open, and surjective, and transfer nowhere‑denseness and meagreness (for Baire‑property sets). This removes any reliance on “saturation preserves nowhere‑denseness” (false in general).\n- Strengthen the “no‑go” for Conjecture 2 in cylinder‑type topologies by completing the odd‑D bridge‑forcing gadget inside a ball and giving an even‑D cut‑vertex forcing gadget, both as cylinder refinements. Add an invariance lemma for section metrics under bounded re‑rootings.\n- Propose and analyze a genuinely non‑local, rootless “occurrence topology” 𝒯_occ on unrooted graphs; prove density of both “has a 1‑way infinite bridge” and “bridgeless” therein. Baire status remains to be settled; if Baire and both dense, neither property is typical in 𝒯_occ.\n\nRigorous statements and proofs\n\nSetup. Let D≥2. Let X:=𝔾_{•,D} be rooted, connected, countably infinite graphs with Δ≤D (or =D), under the local metric d_{•}. Let 𝔽 be the countable set of rooted r‑ball types (all r).\n\nUnrooted space Y and the forgetful map.\n- Let Y be the set of unrooted, connected, countably infinite graphs with Δ≤D (or =D), endowed with the rootless local topology generated by U_Y(F):={G∈Y: ∃v B_r(G,v)≅F} for F∈𝔽. Define π:X→Y by π(G,ρ)=G.\n\nLemma 1 (π is continuous, open, surjective).\n- Continuity: π^{-1}(U_Y(F))=𝔾_{•}^{F} is open in X.\n- Openness: π(𝔾_{•}^{F})=U_Y(F).\n- Surjective: any G∈Y admits some root ρ; then (G,ρ)∈X and π(G,ρ)=G.\n\nLemma 2 (X and Y are Baire). For Δ≤D, both X and Y are compact metrizable (hence Baire). For Δ= D‑regular, they are closed subspaces of the Δ≤D spaces; thus Baire.\nSketch. For X (Δ≤D): compactness by diagonal extraction on rooted balls; limits preserve local finiteness and connectivity. Y is the continuous, open image of compact X under π and is Hausdorff (standard for this topology), hence compact. The regular subspaces are closed by local degree constraints.\n\nProposition 3 (Nowhere‑denseness transfers). For A⊆Y, A is nowhere dense in Y iff π^{-1}(A) is nowhere dense in X.\nProof. If π^{-1}(A) is not nowhere dense, some nonempty open U⊆X is contained in cl_X(π^{-1}(A)); then π(U) is nonempty open and π(U)⊆cl_Y(A), so A is not nowhere dense. Conversely, if A is not nowhere dense, pick nonempty open V⊆cl_Y(A); then π^{-1}(V) is nonempty open and π^{-1}(V)⊆cl_X(π^{-1}(A)), so π^{-1}(A) is not nowhere dense.\n\nProposition 4 (Meagreness transfers for Baire‑property sets). If A⊆Y has the Baire property, then A is meagre in Y iff π^{-1}(A) is meagre in X.\nProof. If A is meagre, pull back a countable cover by nowhere dense sets and use Proposition 3. Conversely, write A=UΔM with U open and M meagre. Then π^{-1}(A)=π^{-1}(U)Δπ^{-1}(M). If π^{-1}(A) is meagre, then π^{-1}(U) is meagre. But X is Baire, so π^{-1}(U)=∅, hence U=∅ by surjectivity of π. Thus A=M is meagre.\n\nCorollary 5 (Conjecture 1 for natural properties). For any Borel/analytic property P of unrooted graphs, S_P:=π^{-1}(T_P) is nowhere dense (resp. meagre) in X iff T_P is nowhere dense (resp. meagre) in Y; smallness is root‑independent.\n\nBounded re‑rooting invariance for section metrics.\n- A section s:Y→X satisfies π∘s=Id_Y. Define d_s(G,H):=d_{•}((G,s(G)),(H,s(H))).\n\nLemma 6 (Homeomorphism for bounded re‑rootings). If sections s,t satisfy dist_G(s(G),t(G))≤N for all G, then the identity Id:(Y,d_s)→(Y,d_t) is a homeomorphism. Hence nowhere‑denseness and meagreness coincide under d_s,d_t.\nProof. If d_s(G,H)<2^{-(r+N)}, then B_{r+N}(G,s(G))≅B_{r+N}(H,s(H)). Moving roots by ≤N gives B_r(G,t(G))≅B_r(H,t(H)), so d_t(G,H)≤2^{-r}. Symmetry yields the inverse continuity.\n\nOdd‑D bridge forcing inside a cylinder (complete gadget).\n- For a finite rooted subgraph H (a candidate refined ball), define the deficit S(H):=∑_{v∈V(H)}(D−deg_H(v)). In any D‑regular extension, |δ(V(H))|=S(H).\n- For odd D: S(H)≡|V(H)| (mod 2).\n\nGadgets (degree‑safe and layer‑respecting):\n- Ports: For a boundary vertex x with current deficit d_x, attach d_x disjoint 2‑edge paths x–a–b, with deg(a)=2, deg(b)=1 in the new partial graph. This moves one unit of deficit from x to b. Doing this for all boundary vertices produces S(H) ports b_i at distance +2 from the old boundary; the updated core H′ has S(H′)=S(H) and all original boundary vertices saturated (deg=D).\n- Pair‑closure: For any two ports b_i,b_j, we can connect them by a bounded D‑regular filler gadget disjoint from the rest that consumes both deficits and saturates all new vertices to degree D (e.g., embed both into a copy of K_{D+1}−e, identifying b_i,b_j with the two degree‑(D−1) ends and adding the missing edge internally). Net effect: S decreases by 2; all additions are placed strictly beyond the current boundary, respecting BFS layers.\n- Parity flipper (odd D): Introduce a small tree T of radius 2 attached to two distinct boundary vertices before port creation to change S by an odd amount (as in the previous round). Concretely, add a new vertex z adjacent to two boundary vertices x,y; then extend z to degree D by adding a (D−2)‑regular local gadget not touching the rest. This changes S by D−4 (odd when D is odd), enabling a transition to S odd.\n\nLemma 7 (Reduction to a single port). Given any rooted r‑ball F in a D‑regular graph with odd D>2, there exists a finite extension H including F (respecting layers so that H is a rooted r′‑ball) such that S(H)=1.\nProof. Start with H:=F. If S(H) is even, apply the parity flipper near the boundary to make S odd. Create ports at all boundary vertices until boundary vertices are saturated. While S>1, repeatedly apply pair‑closure to consume two ports at a time via disjoint filler gadgets; this preserves degrees ≤D and does not create shortcuts to the root because all additions are outward and glued along specified boundary vertices. Termination yields S=1 with all original boundary vertices saturated and exactly one port b* remaining at the outer boundary. The resulting H is a finite connected graph which, by our outward‑only construction and layer control, is the r′‑ball of its root for some r′.\n\nProposition 8 (Odd‑D bridge forcing). In 𝔾_{•,=D} with odd D>2, for any cylinder 𝔾_{•}^{F}, there is a refinement cylinder 𝔾_{•}^{F′} such that every D‑regular extension of F′ has a bridge. Hence the bridgeless set is nowhere dense (for any cylinder‑based topology).\nProof. Take H from Lemma 7 with S(H)=1 and let F′ be its rooted r′‑ball. Any D‑regular extension G satisfies |δ(V(H))|=1; the unique edge in δ(V(H)) is a bridge of G.\n\nEven‑D cut‑vertex forcing inside a cylinder.\n- Observation: In a D‑regular graph with even D, 1‑way infinite bridges cannot occur. To force non‑2‑connectedness, centralize all external deficit through a single designated cut‑vertex c.\n\nLemma 9. For any rooted r‑ball F in a D‑regular graph with even D>2, there exists a finite extension H containing F (again as a rooted r′‑ball) such that in any D‑regular extension G of H, some vertex c∈V(H) is a cut vertex of G.\nProof sketch. Choose a vertex c on the boundary of F. Create ports at all other boundary vertices and pair‑close them as in Lemma 7 until all boundary vertices except possibly c are saturated. Route the remaining required deficit to c by attaching disjoint 2‑edge paths towards c and saturating intermediate vertices to degree D using local fillers, ensuring no new shorter paths to the root. Arrange that all edges leaving V(H) (there are S(H) of them, with S(H) even) are incident to c and that the removal of c disconnects H into at least two nonempty blocks (create two internally 2‑edge‑connected blobs H_1,H_2 attached to c only). In any D‑regular extension, all outside edges attach at c, hence removing c disconnects G. Degree constraints are preserved by construction. The same layer discipline shows H is a ball F′.\n\nConsequences for Conjecture 2 (no‑go region)\n\n- Cylinder‑based invariance: The proofs of Propositions 8 and Lemma 9 are purely by cylinder refinement. Therefore, under any metric whose open sets are unions of rooted cylinders (i.e., inducing the Benjamini–Schramm topology), bridgeless graphs remain nowhere dense in 𝔾_{•,≤D} (D>2) and in 𝔾_{•,=D} for odd D; and graphs without a cut vertex are nowhere dense for all D>2.\n- Bounded re‑rootings: By Lemma 6, section metrics that change roots within uniformly bounded distance preserve typicality; thus they cannot make bridgeless graphs typical.\n\nA genuinely non‑local alternative: occurrence topology 𝒯_occ on Y\n\nDefinition. Let 𝔽_r be the finite set of rooted r‑ball types (Δ≤D). Define the map Occ:Y→∏_{r≥0}2^{𝔽_r} by Occ(G)_r = {F∈𝔽_r : F occurs somewhere in G}. Equip ∏_{r}2^{𝔽_r} with the product topology; let 𝒯_occ be the pullback topology on Y via Occ. Equivalently, a subbasic open set is U_Y(F): “F occurs somewhere.”\n\nLemma 10 (Density of 1‑way infinite bridges in 𝒯_occ). For D≥3, the set B_1⊆Y of graphs having a 1‑way infinite bridge is dense in (Y,𝒯_occ).\nProof. Given finitely many required occurrences F_1,…,F_k, realize each within vertex‑disjoint finite subgraphs inside a finite connected core C while respecting Δ≤D (use fresh vertices and avoid degree overflow). Attach an infinite ray to a vertex x∈C with spare degree, and ensure all other vertices of C are saturated via local fillers; then in any completion the edge on the ray out of x is a 1‑way infinite bridge. The resulting graph contains all F_i and has Δ≤D.\n\nLemma 11 (Density of bridgeless graphs in 𝒯_occ). For D≥3, the set B_0⊆Y of bridgeless graphs is dense in (Y,𝒯_occ).\nProof. Given finitely many required occurrences F_1,…,F_k, realize them disjointly in a finite core C without creating bridges (add cycles/chords locally so every edge of C lies on a cycle). Extend C to an infinite bridgeless Δ≤D graph by attaching an infinite ladder‑like 2‑edge‑connected “backbone” (e.g., a 2‑edge‑connected cubic skeleton such as the 3‑regular “ladder of ladders”) and connect C to it via two edge‑disjoint paths; saturate degrees with local 2‑edge‑connected fillers. This yields a connected infinite bridgeless graph containing all F_i.\n\nRemark. The Baire/Polish status of (Y,𝒯_occ) remains open; we have not yet proved that Occ(Y) is closed in ∏ 2^{𝔽_r}. If (Y,𝒯_occ) is Baire and both B_1 and B_0 are dense, neither is comeagre; thus “bridgeless” cannot be typical under 𝒯_occ.\n\nExamples\n\n- Parity sanity check (odd D): For D=3 and a tree H on m vertices, S(H)=3m−2(m−1)=m+2 is odd iff m is odd, in line with the parity flipper’s necessity.\n- Section metrics: On an infinite D‑regular tree T_D, picking s(G) as any root and t(G) as a neighbor gives N=1; Lemma 6 applies.\n\nObstacles\n\n- Occurrence topology: Proving that Occ(Y) is closed (hence compact) requires a projective‑limit consistency theorem for occurrence profiles; we currently only have necessary closure constraints (truncation monotonicity) and a heuristic that compactness should follow by a standard compactness/ultraproduct or Kőnig’s‑lemma argument. A full proof is pending.\n- Even‑D cut‑vertex gadget: We provided a proof sketch; a fully explicit, layer‑respecting construction with precise degree bookkeeping should be written to eliminate any ambiguity.\n\nNext steps\n\n- Move Lemmas 1–2, Propositions 3–4, and Lemma 6 to proofs.md to close Conjecture 1 and to record section‑metric invariance.\n- Write a detailed, layer‑respecting proof for Lemma 7 and Proposition 8 (odd‑D bridge forcing) with explicit filler gadgets and port pairing; ensure F′ is indeed a ball.\n- Provide a complete, explicit construction for Lemma 9 (even‑D cut‑vertex forcing), including routing of all deficits through c and verification that H is a ball.\n- Formalize 𝒯_occ: either prove (Y,𝒯_occ) is Baire/compact by identifying Occ(Y) as a closed subshift, or provide a counterexample; then decide typicality of B_0 and B_1.\n\nTakeaways\n\n- Conjecture 1 is resolved for natural (Borel/analytic) properties by π‑transfer of nowhere‑denseness and meagreness.\n- Conjecture 2: In all cylinder‑based topologies and bounded re‑rooting section metrics, bridgeless graphs remain non‑typical (nowhere dense or not comeagre). A non‑local occurrence topology changes density behavior (both bridgeless and 1‑way‑bridge graphs dense), but Baire status is open; settling it will decide (non‑)typicality there."
}