{
  "content": "Ideas\n\n- Strengthen and formalize the root–forgetful map approach to Conjecture 1 (both nowhere‑dense and meagre for Baire‑property sets), with complete, short proofs suitable for proofs.md.\n- Establish a robust no‑go theorem for Conjecture 2 across all ball‑local (cylinder‑based) topologies: Theorems 14–17 persist unchanged. Add the “meagre but dense” robustness for 2‑way infinite bridges (Theorem 16) in any such topology.\n- Provide a fully explicit parity/counting gadget for odd D to force a unique external edge (hence a 1‑way infinite bridge in any D‑regular completion). This repairs earlier parity issues and pins that the argument is topology‑agnostic within ball‑local classes.\n- Give an explicit even D cut‑vertex forcing gadget: a finite D‑bounded r′‑ball F′ in which all deficits are concentrated at a single vertex u with deg_{F′}(u)=D−2 and all other vertices saturated to D. In any D‑regular extension, all external edges must be incident to u, making u a cut vertex.\n- For a natural rootless, re‑rooting‑insensitive pseudometric d_any, prove new density lemmas: 2‑way infinite bridges are dense as well (in addition to previously shown 1‑way bridges and bridgeless graphs). This sharpens our picture of Conjecture 2 under genuinely different topologies.\n\nRigorous results and proofs\n\nA. Root‑invariance (Conjecture 1)\n\nLet X=\\mathbf{G}_{\\bullet,D} (rooted space with BS topology) and Y=\\mathbf{G}_{\\varnothing,D} (unrooted space with rootless‑local topology generated by U_F^Y={G: ∃v with B_r(G,v)≅F} for rooted r‑balls F). Let π:X→Y be π(G,ρ)=G.\n\nLemma A1 (π continuous, open, surjective). For any rooted r‑ball F, π(\\mathbf{G}_\\bullet^F)=U_F^Y and π^{-1}(U_F^Y)=\\mathbf{G}_\\bullet^F. Hence π is continuous, open, onto.\n\nLemma A2 (closure/interior commute with π^{-1}). For all A⊆Y,\ncl_X π^{-1}(A)=π^{-1}(cl_Y A) and int_X π^{-1}(A)=π^{-1}(int_Y A).\nProof. Continuity gives cl_X π^{-1}(A)⊆π^{-1}(cl_Y A). For the reverse, if x∈π^{-1}(cl_Y A) and U⊂X is open with x∈U, then π(U) is open (π open), π(x)∈cl_Y A ⇒ π(U)∩A≠∅ ⇒ U∩π^{-1}(A)≠∅. Interior identity follows by complementing and reapplying closure identity.\n\nProposition A3 (nowhere‑dense equivalence). For any A⊆Y, A is nowhere dense in Y iff π^{-1}(A) is nowhere dense in X.\nProof. Nowhere dense ⇔ int cl = ∅. Using Lemma A2, int_X cl_X π^{-1}(A) = π^{-1}(int_Y cl_Y A). Surjectivity of π implies the right side is empty iff int_Y cl_Y A is empty.\n\nProposition A4 (meagre equivalence for sets with the Baire property). Suppose A⊆Y has the Baire property. Then A is meagre in Y iff π^{-1}(A) is meagre in X.\nProof. “⇒” is immediate by A3 and countable unions. For “⇐”: if π^{-1}(A) is meagre but A is non‑meagre, then some nonempty open V⊂Y has A comeagre in V. Thus V∖A is meagre, hence π^{-1}(V∖A) meagre by A3. But π^{-1}(V) is nonempty open in X, so π^{-1}(A) is comeagre in π^{-1}(V), contradicting meagreness of π^{-1}(A) in the Baire space X.\n\nCorollary A5 (Conjecture 1). For any unrooted property P and S_P=π^{-1}(T_P), smallness is root‑invariant: S_P nowhere dense (resp. meagre for Baire‑property P) in X iff T_P nowhere dense (resp. meagre) in Y. A root‑free cylinder criterion follows: for saturated S⊂X, S is nowhere dense iff ∀ unrooted balls B ∃ refinement B′ with Cyl(B′)⊂Cyl(B)\\S.\n\nB. No‑go for ball‑local topologies (Conjecture 2)\n\nDefinition B1. A topology τ on X is ball‑local if {\\mathbf{G}_\\bullet^F} is a base.\n\nTheorem B2. In any ball‑local topology on X, Theorems 14–17 (bridgeless nowhere dense; cut‑vertex nowhere dense; 2‑way infinite bridges meagre; χ′=D nowhere dense) remain valid. In particular, bridgeless graphs cannot be typical in any ball‑local topology.\nProof. Each proof proceeds by rooted cylinder refinements that enforce a local obstruction in every extension of a refined ball F′. Such refinements depend only on the extension poset of finite rooted balls, not on metric numerics. Hence the same arguments show nowhere denseness/meagreness in any topology with the same cylinder base.\n\nC. Odd D regular: a compact parity gadget\n\nDefine S(F)=∑_{v∈V(F)}(D−deg_F(v)). In any D‑regular completion H⊇F, |δ_H(V(F))|=S(F).\n\nProposition C1 (S(F′)=1 forcing). Let D be odd ≥3 and F a rooted r‑ball that occurs in a D‑regular graph. There exists an r′ and a rooted refinement F′ with max degree ≤D and S(F′)=1. Consequently, any D‑regular extension of F′ contains a 1‑way infinite bridge.\nProof. Let L be the boundary of F, c=∑_{v∈L}(D−deg_F(v))=S(F). Add a new layer W of t vertices at distance r+1, and connect each v∈L to D−deg_F(v) distinct vertices in W (total c edges). Add e_W edges inside W so that e_W=(D t−c−1)/2 (choose t≥c with t≡c+1 mod 2; D odd ensures integrality). This yields S(F′)=D t−(c+2 e_W)=1. Degree bounds at W are respected by choosing t large and building the needed e_W‑edge simple graph on W. Then every D‑regular completion has exactly one edge leaving V(F′), which is a bridge; the outside component is infinite, hence 1‑way infinite.\n\nD. Even D regular: a cut‑vertex forcing gadget\n\nProposition D1 (cut vertex forcing for even D). Let D be even, D≥4. For any rooted r‑ball F that occurs in some D‑regular graph, there exists an r′ and a rooted refinement F′ with max degree ≤D and a vertex u∈V(F′) such that: (i) deg_{F′}(u)=D−2 and every other vertex of F′ has degree D; (ii) F′−u has exactly two connected components A,B; (iii) there are no edges between A and B in F′. Consequently, in any D‑regular completion H⊇F′, all edges leaving V(F′) are incident to u, and u is a cut vertex of H.\n\nProof. Pick any connected D‑regular graph R on D+2 vertices obtained as K_{D+2} minus a perfect matching (exists and is connected). It admits further perfect matchings (since K_{D+2} has a 1‑factorization; removing one perfect matching leaves a union of the remaining 1‑factors). Take two disjoint copies R_A,R_B. Let k=D−2 (even). Choose nonempty disjoint sets V_A⊂V(R_A), V_B⊂V(R_B) with |V_A|+|V_B|=k. For each x∈V_A∪V_B, delete one incident edge x y_x such that the deleted edges are pairwise disjoint (possible by abundance of matchings in dense R_⋅). Collect the freed endpoints W={y_x}. Pair up W inside each copy and add an edge between each pair within that copy (avoiding parallel edges). This restores all degrees in R_A∪R_B to D except at x which are now D−1; add a new vertex u and connect u to each x∈V_A∪V_B. Then deg(u)=k=D−2 and all other vertices have degree D. The resulting graph F* is connected and F*−u has exactly two connected components R_A and R_B. Now let F′ be the (r′)-ball refinement obtained by grafting F* far outside the original boundary L of F and saturating all vertices within distance ≤ r′ from the root so that F′ contains F and F*. Because all vertices except u have degree D in F′, any D‑regular extension H of F′ must add exactly two new edges (since S(F′)=2), both incident to u. No edge can join A and B outside F′ (their vertices are saturated inside F′). Thus removing u disconnects H into (at least) the outside part and the two components containing R_A and R_B, so u is a cut vertex. Degree bounds and simplicity are maintained by the local rewiring and by adding u. (A standard choice is to work inside K_{D+2} minus one 1‑factor to ensure plentiful matchings; removing a small matching and re‑adding a matching preserves connectivity.)\n\nE. Robustness of Theorem 16 in ball‑local topologies\n\nLet T_{2wb} be the set of rooted graphs in X that contain a 2‑way infinite bridge.\n\nProposition E1 (meagre). For each k∈\\mathbb{N}, the set A_k={ (G,ρ): there exists a 2‑way infinite bridge at graph distance ≤k from ρ } is nowhere dense in any ball‑local topology; hence T_{2wb}=⋃_k A_k is meagre.\nProof. Fix a rooted r‑ball F and k. Enlarge r if needed so that all edges at distance ≤k from the root lie strictly within B_{r−1}(F). Construct a refinement F′ by locally adding short cycles (triangles/squares or parity gadgets respecting degree constraints) around each edge within distance ≤k so that in any extension each such edge lies on a cycle contained within distance ≤ r from the root. This is possible by attaching bounded‑size 2‑edge‑connected gadgets to the endpoints while keeping max degree ≤D (in =D, use parity gadgets to balance degrees, as in C1). Then every extension of F′ has no bridge at distance ≤k. Therefore \\mathbf{G}_\\bullet^{F′}⊂\\mathbf{G}_\\bullet^{F}\\A_k, proving A_k is nowhere dense.\n\nProposition E2 (dense). T_{2wb} is dense in any ball‑local topology on X.\nProof. Given any cylinder \\mathbf{G}_\\bullet^F, construct a graph G by extending a copy of F outside its boundary by attaching two disjoint infinite bounded‑degree connected graphs S_1,S_2 (e.g., two infinite ladders) and then adding a single edge e between S_1 and S_2. Ensure all attachments occur beyond distance r+1 so B_r equals F. The edge e is a 2‑way infinite bridge in G. Hence \\mathbf{G}_\\bullet^F meets T_{2wb}, proving density.\n\nThus Theorem 16 (meagre but not nowhere dense) persists across all ball‑local topologies.\n\nF. Re‑rooting–insensitive pseudometric d_any: further density\n\nDefine on X the symmetric pseudometric\nδ(x,y)=2^{−sup{ r: ∃σ B_r(x)≅B_r(y,σ) }} and d_any(x,y)=max{δ(x,y),δ(y,x)}.\nTwo graphs are close if each contains a large rooted ball occurring somewhere in the other.\n\nLemma F1 (1‑way infinite bridges dense in ≤D). For any x=(G,ρ) and r, there exists H with a 1‑way infinite bridge and σ∈V(H) such that B_r(H,σ)≅B_r(G,ρ) and d_any(x,(H,σ))≤2^{−r}.\nProof. As previously shown: attach an infinite pendant ray outside the r‑ball at a boundary vertex with available degree and complete the rest at distance ≥ r+1.\n\nLemma F2 (bridgeless dense in ≤D). For any x and r, there exists bridgeless H and σ with the same r‑ball and d_any≤2^{−r} (attach the r‑ball to a 2‑edge‑connected infinite scaffold and route boundary edges into cycles; see earlier E2‑type construction).\n\nLemma F3 (2‑way infinite bridges dense in ≤D). For any x and r, there exists H with a 2‑way infinite bridge and σ with B_r(H,σ)≅B_r(G,ρ), hence d_any≤2^{−r}.\nProof. Let F=B_r(G,ρ). Outside the copy of F, attach two disjoint infinite bounded‑degree connected graphs S_1,S_2 and connect them by a single edge e. If some boundary vertex v in F has degree < D, join v by a path of length ≥2 to S_1 to ensure H is connected while keeping degrees ≤D (if none, add a new tree beyond distance r+1 and connect appropriately to respect bounds). Then e is a 2‑way infinite bridge. Since attachments are beyond distance r, the r‑ball remains F at σ.\n\nConsequences for Conjecture 2. Under d_any on ≤D, all three classes—bridgeless, 1‑way, and 2‑way infinite bridge graphs—are dense. Determining typicality requires understanding whether the d_any‑quotient is Baire; if it is Baire, none of these dense sets can be comeagre simultaneously. Establishing (non‑)Baireness of the d_any topology is the next critical step.\n\nObstacles\n\n- Even D cut‑vertex gadget (D1): while the local rewiring scheme is standard in regular graphs (using matchings in dense graphs), one must ensure the chosen deleted edges form a matching and connectivity of each component R_A,R_B is preserved. Working inside K_{D+2} minus one perfect matching ensures abundant matchings; removing a tiny matching and re‑adding a matching preserves connectivity in such dense graphs.\n- For E1 (meagreness of near‑root 2‑way bridges), ensuring degree constraints in =D requires parity gadgets akin to C1 to avoid exceeding D; the argument is local and uniform but should be written with an explicit small 2‑edge‑connected gadget for each D.\n- For d_any, Baire/Polish status remains open; we avoid any claims here.\n\nNext steps\n\n- Write full proofs of A3–A4 into proofs.md, settling Conjecture 1 for natural (Borel/analytic) properties.\n- Expand C1 and D1 into detailed constructions with explicit small gadgets (e.g., instantiate R_A,R_B as K_{D+2} minus a fixed perfect matching; spell out the matching deletions and reconnections; verify connectivity rigorously).\n- For E1, fix explicit 2‑edge‑connected gadgets for each D (≤D and =D) to cycle‑protect all edges within a prescribed radius without violating degree bounds.\n- Analyze the Baire property of (X/∼,d_any): characterize basic neighborhoods via finite bi‑directional occurrence constraints and attempt a completion procedure; alternatively, embed the image into the Cantor cube via pattern‑occurrence indicators and study the subspace topology.\n- Optional: strengthen density by showing that 2‑vertex‑connected graphs are also dense under d_any (construct via attaching to a 3‑edge‑connected scaffold and ensuring two internally disjoint connections from the r‑ball boundary), further separating typical behaviors under d_any.\n"
}