{
  "content": "Ideas\n- Strengthen and clean up Conjecture 1: formalize transfer of nowhere‑denseness and (for Baire‑property sets) meagreness between the rooted and unrooted spaces via the forgetful map π. Add a short, self‑contained proof that the unrooted space Y (rootless local topology) is Baire using that π is continuous, open, surjective and X is Baire.\n- Repair and simplify the odd‑D regular “bridge‑forcing” cylinder: construct an R‑ball F′ with L_R consisting of a single vertex z adjacent to D−1 vertices in L_{R−1}; then S(F′)=1, so every D‑regular extension has a unique crossing edge, hence a 1‑way infinite bridge. This avoids parity bookkeeping gadgets and is easier to verify.\n- Extend the “no‑go” region for Conjecture 2: any topology on X that refines the rooted cylinder topology inherits a nonempty interior for “has a bridge” (≤D) and for “has a 1‑way infinite bridge” (=D, odd), preventing bridgeless from being typical there.\n- Coarser, root‑insensitive topology τ_any (pullback of the unrooted topology): prove Y is Baire; show in Y: “has a 1‑way infinite bridge” is dense, and (for D≥4) “bridgeless” is dense; thus neither can be typical in Y nor in (X,τ_any). For D=3, leave density of “bridgeless” open.\n\nFormal statements and proofs\n1) Forgetful map framework\nSetup: X=\\mathbf{G}_{\\bullet,D} with the rooted local topology; Y the unrooted degree‑bounded space with the rootless local topology generated by U_F^Y={G: ∃v with B_r(G,v)≅F}. Let π:X→Y, π(G,ρ)=G.\n\nLemma 1 (π is continuous, open, surjective).\nProof. For a rooted r‑ball F, π^{-1}(U_F^Y)=U_F^X is open in X (union over all choices of root), so π is continuous. Also π(U_F^X)=U_F^Y, hence open. Surjectivity is clear. ∎\n\nProposition 2 (nowhere‑denseness transfers exactly).\nFor any A⊆Y, A is nowhere dense in Y iff π^{-1}(A) is nowhere dense in X.\nProof. (⇒) Let A be nowhere dense. For any nonempty open U⊆X, π(U) is nonempty open in Y; choose nonempty open V⊆π(U) with V∩A=∅. Then U∩π^{-1}(V) is nonempty open and disjoint from π^{-1}(A). (⇐) If π^{-1}(A) is nowhere dense and W⊆Y is nonempty open, then π^{-1}(W) is nonempty open; pick nonempty open U′⊆π^{-1}(W) with U′∩π^{-1}(A)=∅. Then π(U′)⊆W is nonempty open disjoint from A. ∎\n\nCorollary 3 (meagreness transfers for Baire‑property sets).\nIf A⊆Y has the Baire property, then A meagre in Y iff π^{-1}(A) meagre in X.\nProof. (⇒) Preimages of meagre sets under continuous maps are meagre. (⇐) Suppose π^{-1}(A) is meagre but A is not. Since A has the Baire property, some nonempty open V has A∩V comeagre. Then π^{-1}(A∩V)=π^{-1}(A)∩π^{-1}(V) is comeagre in nonempty open π^{-1}(V), contradiction. ∎\n\n2) Y is Baire\nLemma 4 (Y is a Baire space).\nProof. X is Baire (standard for the rooted local space on degree‑bounded graphs). Let U_n⊆Y be dense open. Then π^{-1}(U_n) are dense open in X. Their intersection is dense in X, hence nonempty on every nonempty open O⊆X. For any nonempty open W⊆Y, π^{-1}(W) is nonempty open in X, so π^{-1}(W)∩⋂_n π^{-1}(U_n)≠∅, and applying π (open and surjective) yields W∩⋂_n U_n≠∅. Hence ⋂_n U_n is dense. ∎\n\nWhy useful: Typicality in τ_any (the pullback of Y) is governed by Y; in particular, if both a set and its complement are dense in Y, neither can be typical in τ_any.\n\n3) Odd‑D regular bridge‑forcing cylinder\nProposition 5 (odd D≥3). Let F=B_r(G,ρ) occur in \\mathbf{G}_{\\bullet,=D}. There exist R≥r and an R‑ball F′ extending F with the following properties:\n- All vertices at distance <R from the root in F′ have degree D (inside F′).\n- The boundary L_R of F′ consists of a single vertex z, and deg_{F′}(z)=D−1.\nConsequently, for any D‑regular extension G′ of F′, the cut δ(V(B_R(G′,ρ))) has size 1, so the unique crossing edge is a 1‑way infinite bridge.\nProof. Starting from F, extend outward layer by layer to radius R−1 so that L_{R−1} contains at least D−1 vertices (this is possible by attaching enough new vertices outward from L_r; at each step, saturate layers < current boundary to degree D by allocating their remaining degree to the newly created outer layer). At the last step, create L_R={z} and connect z to D−1 distinct vertices in L_{R−1}, adding no edges within L_R. All vertices at distance <R are saturated to degree D by construction. Then S(F′)=∑_{x∈L_R}(D−deg_{F′}x)=D−(D−1)=1. In any D‑regular supergraph, by the edge‑cut identity |δ(V(B_R))|=S(F′)=1; hence the sole edge leaving B_R is a bridge whose interior side is finite, i.e., a 1‑way infinite bridge. Nonemptiness: realize an extension by connecting z to one new vertex w outside B_R and completing outside to an infinite D‑regular graph (e.g., a D‑regular tree modified to eliminate bridges far from B_R if desired; completion is routine since only degrees outside need to be filled). ∎\n\nCorollary 6 (no‑go for “bridgeless typical” under cylinder‑refining topologies).\n- In ≤D: the 1‑ball with a leaf at the root is a cylinder contained in “has a bridge”, giving nonempty interior. Hence “bridgeless” cannot be comeagre.\n- In =D, D odd: by Proposition 5, there is a cylinder contained in “has a 1‑way infinite bridge”; thus “bridgeless” cannot be comeagre.\nThis applies to any topology on X that contains all rooted cylinders as open sets (hence to any metric topologically finer than or equivalent to d_•).\n\n4) Density facts in the unrooted space Y\nLemma 7 (1‑way infinite bridges are dense in Y for ≤D).\nProof. Let U_F^Y be a basic open set (F an r‑ball). Since F occurs in some graph with Δ≤D, it has a boundary vertex u∈L_r with deg_F(u)<D (Lemma 13‑type observation). Attach a pendant infinite ray to u, and complete arbitrarily elsewhere without changing the r‑ball around the occurrence of F. The first edge of the ray is a 1‑way infinite bridge. Thus U_F^Y intersects the set of graphs with a 1‑way infinite bridge. ∎\n\nProposition 8 (for D≥4, bridgeless graphs are dense in Y).\nProof. Fix U_F^Y. Consider the infinite grid Z^2 (degree 4), which is bridgeless. Subdivide finitely many edges of Z^2 inside a large finite box so that F embeds as a subgraph; subdivisions preserve bridgelessness and keep maximum degree ≤4. If D>4, freely append pendant 2‑paths to split degrees down to ≤D (or take Cartesian products with cycles to reach degree exactly D and then subdivide). Thus for D≥4 we obtain a bridgeless G with Δ(G)≤D that contains an occurrence of F, so G∈U_F^Y. ∎\nRemark. For D=3, finding a fixed universal bridgeless host is subtler; density of bridgeless graphs in Y for D=3 is left open here.\n\n5) Bounded re‑rooting invariance\nLemma 9. If T:X→X maps (G,ρ)↦(G,ρ′) with d_G(ρ,ρ′)≤B uniformly, then T is a homeomorphism of (X,d_•) onto its image; hence any “section metric” obtained by such re‑rootings is topologically equivalent to d_•.\nProof. For each r, U_{r+B}(x)⊆T^{-1}(U_r(Tx))⊆U_{r−B}(x), yielding continuity of T and T^{-1} on their domains. ∎\n\nExamples\n- Odd‑D gadget check for D=3: Take R so that |L_{R−1}|≥2. Set L_R={z} and connect z to two distinct vertices of L_{R−1}. Then deg_{F′}(z)=2, so S(F′)=1.\n- Density of 1‑way bridges in Y for ≤D: If F’s boundary has no degree deficit (e.g., F comes from an =D occurrence), enlarge r by one and take F′ with a boundary deficit at the new layer; then apply the same ray attachment.\n\nObstacles\n- Even D regular case: we cannot force a 1‑way infinite bridge (parity obstruction). Constructing a cylinder that forces a genuine 2‑way infinite bridge in =D, D even, remains open. The current interior “no‑go” uses cut‑vertices instead of bridges; while useful (Theorem 15), it does not by itself preclude the possibility that “bridgeless” could be comeagre under some very nonlocal topology.\n- Density of bridgeless graphs in Y for D=3: a uniform bridgeless host accommodating arbitrary finite degree‑≤3 patterns as subgraphs is nontrivial. A tailored external 2‑edge‑connected completion attached by two disjoint connections should work, but a clean, degree‑bounded, fully general construction needs care.\n- τ_any on X (preimage of Y’s topology): By Lemma 4, Y is Baire; π:(X,τ_any)→Y is open and continuous. Typicality of saturated properties in (X,τ_any) matches Y’s. For non‑saturated properties, category analysis requires separate work.\n\nNext steps\n- Move Lemma 1, Proposition 2, Corollary 3, and Lemma 4 into proofs.md to finalize Conjecture 1 for Borel/Baire‑property properties.\n- Write a full, layer‑by‑layer construction for Proposition 5, including the degree‑saturation algorithm up to radius R−1, and the completion argument beyond B_R.\n- Extend the “no‑go” corollary to any topology τ on X with the property that every rooted cylinder U_F^X is open (or more generally, that for some fixed finite pattern P witnessing a bridge, the set “contains P at bounded distance from the root” is open). Record the precise hypotheses.\n- For Conjecture 2, analyze even D in =D: either build an explicit R‑ball forcing a 2‑way infinite bridge, or prove a universal obstruction. In parallel, for D=3 establish density of bridgeless graphs in Y by a degree‑bounded 2‑edge‑connected completion scheme around arbitrary F.\n- If pursuing τ_any, describe an explicit complete metric inducing Y’s topology (and hence τ_any on X via pullback), to allow a black‑box Baire proof and to compare typical sets rigorously.\n"
}